{"image_id": 226988, "caption": "The image features a woman sitting at a table, taking a picture of two pieces of pizza using her camera. The table she is seated at is red, and there is another table visible behind her. One of the tables appears to be empty.\n\nThere are several other people present in the scene. One person can be seen near the left side of the woman taking the picture, another person is located further away on the left side, and another person is visible near the right side of the image. Additionally, there are two more people close to each other in the background on the right side of the scene."}
{"image_id": 337443, "caption": "The image depicts a traffic sign placed on a street corner next to a roadway. The sign, which reads \"obstructruction,\" is orange in color and prominently displayed to alert drivers of any obstacles or construction work ahead.\n\nThere are several cars visible in the scene, one parked near the sign and others driving past it on the roadway. The cars vary in size and positioning, showcasing different perspectives of traffic flowing through the area. Additionally, there is a truck visible on the left side of the scene, further illustrating the variety of vehicles present in this area."}
{"image_id": 112022, "caption": "The image depicts a crowded airport terminal where a group of people are waiting for their luggage. There are numerous suitcases scattered around the scene, some sitting upright while others are placed horizontally on the floor.\n\nSeveral people can be seen in various positions within the terminal, some standing close together while others are more spread out. There are at least nine individuals visible in the scene, each with their own luggage. Some of them are even carrying backpacks and handbags, adding to the busy atmosphere of the airport terminal."}
{"image_id": 394444, "caption": "The image depicts a person wearing jeans, shoes, and a sweater, standing next to a black skateboard on a sidewalk. The person appears to be either preparing to skateboard or just finished skateboarding. A hand can be seen holding onto the skateboard, likely getting ready to skate or already resting after skateboarding. The person is positioned towards the left side of the image."}
{"image_id": 481635, "caption": "The image depicts a woman smiling as she enjoys a delicious slice of deep-dish Chicago pizza with tomato sauce. She is seated at a table in what appears to be a restaurant setting. The table features another plate of pizza next to her plate, along with a few other items such as a fork, knife, and a bottle placed at different positions around the table.\n\nThere are other people present in the background, but they are not the focus of the scene. The woman appears to be the center of attention as she savors her delicious meal."}
{"image_id": 285258, "caption": "In this image, two dogs are playfully wrestling each other on a grassy field. The dogs are both brown, one positioned on the left side of the field and the other on the right side. They appear to be enjoying themselves as they playfully interact with each other.\n\nThere are other dogs present in the background as well, one located towards the left side of the field and another towards the right side, both seemingly engaged in their own activities. The scene depicts a lively atmosphere, where dogs are enjoying themselves outdoors on a grassy field."}
{"image_id": 479057, "caption": "The image depicts a polar bear standing in a grassy field, grazing on grass. The bear is positioned towards the center of the field, occupying most of the space, as it feeds on the grassy area. The background consists of trees and grassy fields, creating a natural environment for the bear to graze in."}
{"image_id": 66238, "caption": "The image depicts a snowboarder performing a trick high above a snowy mountain range. The snowboarder is in mid-air, showcasing their skills as they jump off a ski lift at a ski resort.\n\nThere are several other people visible in the background, likely fellow snowboarders or skiers enjoying the snowy environment. The scene captures the excitement and thrill of winter sports activities in a mountainous setting."}
{"image_id": 558458, "caption": "The image features two women smiling at the camera while holding a plate full of delicious food. One woman is smiling directly at the camera while the other woman smiles slightly away from it. They both appear happy and content as they enjoy their meal.\n\nThe plate contains a variety of food items such as hot dogs, pasta, and a sandwich, making it an appetizing meal. Both women are smiling, one woman smiling directly at the camera while the other woman smiles slightly away from it. The overall atmosphere seems joyful and enjoyable as they share their meal together."}
{"image_id": 400596, "caption": "The image depicts a bathroom scene with a green sink basin prominently placed in the center of the space. Next to the sink, there is a toilet bowl lid open, revealing its contents. A bathroom scale can be seen nearby, indicating that this bathroom is well-equipped for weight management. \n\nAdditionally, there are two bottles placed on the countertops, one near the sink and another further away. A cup can also be seen placed near the sink area, possibly used for storing bathroom essentials. The bathroom's overall appearance gives off a clean and organized vibe."}
{"image_id": 373266, "caption": "The image depicts three men wearing blue scrubs working together inside a room with various equipment and instruments. Two of them are situated closer to each other while the third one is slightly further away. All three men appear to be doctors, possibly performing surgery or other medical procedures.\n\nThere are several pieces of equipment scattered around the room, including two TVs positioned on opposite sides of the room and two computers placed near each other. Additionally, there are two microphones positioned at different locations within the room, one near each of the men working on the medical procedures.\n\nThere are also two sets of headphones in the room, one near each of the men working on the procedures. Finally, there is a keyboard positioned near one of the men working on the procedures, likely used for controlling the equipment during the operation."}
{"image_id": 38332, "caption": "In this image, an elephant stands tall in a grassy field, with its trunk extended forward. The elephant occupies most of the frame, with its legs spread apart as it roams through the grassy field. Its presence in the field signifies its natural habitat and its role as a keystone species in its environment."}
{"image_id": 84533, "caption": "The image features a woman wearing leather clothing sitting on a motorcycle parked outside a building. She appears to be smiling for the camera as she poses on the motorcycle. The woman is seated in the middle of the motorcycle, occupying most of the frame.\n\nThe motorcycle itself occupies a large portion of the image, stretching from left to right side of the frame. There are also two other people visible in the background, one on the left side and another towards the right side of the frame."}
{"image_id": 449963, "caption": "The image depicts a room filled with tables, each equipped with a laptop computer and mouse. There are several laptop computers spread across the tables, along with multiple computer mice placed next to them. The room appears to be designed for presentations or collaborative work, given the number of tables and laptops present.\n\nThere are also several chairs scattered around the room, some placed near the tables and others positioned at different angles. A television screen is visible on one wall, likely used for presentations or multimedia purposes. Overall, the room appears to be well-equipped for collaborative work or group presentations."}
{"image_id": 128180, "caption": "The image features a plate of delicious pizza with cheese and tomatoes on top, placed on a table. A fork is placed next to the plate, ready to be used to enjoy the pizza. Two pairs of shoes can be seen in the scene, one pair close to the plate, likely belonging to someone who is preparing to eat the pizza, and another pair situated further away from the plate. The presence of these shoes and the fork suggests that someone is ready to savor the delicious meal."}
{"image_id": 204232, "caption": "The image captures a thrilling moment where a skateboarder is performing an aerial trick in mid-air. The skateboarder is skillfully jumping over a metal barrier or obstacle, showcasing their skill and agility. The skateboard itself can be seen flying through the air as well, adding to the excitement of the scene.\n\nIn addition to the main skateboarder, there are other people present in the background, possibly spectators or fellow skateboarders. They are positioned at various distances from the main action, with some standing close together while others are spread out."}
{"image_id": 477867, "caption": "The image depicts a man riding a surfboard on top of a wave in the ocean. He is skillfully navigating the waves, showcasing his surfing skills. Several other people are present in the scene, some of them also surfing or preparing to surf, while others are likely spectators or fellow surfers waiting for their turn. \n\nThere are several surfboards visible in the scene, some of them being ridden by surfers while others are floating or stationary in the water. Additionally, there are two surfboards lying on the ground near the surfers, possibly waiting to be used or already retired after being used."}
{"image_id": 308128, "caption": "In this image, a man is skillfully skateboarding down a rail, performing a trick in a park setting. The skateboarder is positioned towards the left side of the scene, with his skateboard visible underneath him as he moves down the rail. The park appears to be a popular spot for skateboarders, as there are several other skateboards scattered around the area.\n\nIn addition to the main skateboarder, there are four other skateboards visible in various locations within the park. These skateboards are likely used by other skateboarders practicing their own tricks or simply enjoying their time at the park."}
{"image_id": 222407, "caption": "The image depicts a black bird perched on a tree branch amidst rain. The bird appears to be facing forward, giving us a view of its face as it stands on the branch. Its positioning on the branch suggests that it might be resting or observing its surroundings during the rain."}
{"image_id": 469543, "caption": "The image features two bedroom sets placed next to each other in a room. Each bedroom set includes two twin beds, one bed occupying each side of the room. The bedroom sets are both furnished with green bedding, creating a cohesive look. There is also a third bed visible in the room, though it appears to be separate from the two bedroom sets.\n\nIn addition to the bedroom sets, there are two telephones present in the room, one placed near each bedroom set. Furthermore, there is a book placed on one of the bedroom sets, likely for reading during bedtime or leisure time."}
{"image_id": 421564, "caption": "The image features a little girl, who appears to be naked, sitting in a high chair and reaching for a birthday cake placed right in front of her. The cake is decorated with pink and blue icing, making it look delicious and appealing to the little girl. \n\nThe scene also includes several other objects such as a knife placed near the cake, another smaller cake located towards the right side of the main cake, a sink further back in the background, and a chair positioned in the background as well."}
{"image_id": 177419, "caption": "The image depicts a blue fire hydrant with a painting on its side, located next to a sidewalk. It seems like the hydrant has been repurposed as a public art display or a decorative piece. The fire hydrant itself is positioned on the sidewalk, which also has a fence running parallel to it. \n\nThere are two other smaller objects visible in the background: one on the left side of the image and another on the right side. These objects may be part of the same artistic display or simply coincidental objects in the background."}
{"image_id": 86432, "caption": "The image depicts a baseball game in progress with several players on the field. One player is swinging a baseball bat, attempting to hit a ball that is already in motion towards him. Another player is holding a baseball glove, ready to catch the ball if needed. \n\nThere are other players positioned around the field, some closer to the batter and others further away. In total, there are seven people visible in the scene, including the batter, glove holder, and others who are either waiting for their turn or just observing the game.\n\nTwo baseball gloves can be seen in the scene, one held by the player ready to catch the ball, and another glove positioned near the middle of the field."}
{"image_id": 544590, "caption": "The image depicts a cat laying down on a gray couch cushion, looking directly at the camera. The cat appears to be sleeping or resting, occupying most of the couch cushion's surface. Its furry body and large orange color make it stand out against the background. The cat's gaze captures attention as it gazes straight at the camera, creating a captivating scene."}
{"image_id": 513060, "caption": "A person is sitting down in a chair and eating a donut, biting into it. Another donut is visible next to them on the table, ready to be eaten as well. The person is holding both donuts in their hands, savoring the delicious treat. Additionally, there are two other donuts placed on the table in front of them."}
{"image_id": 140921, "caption": "The image depicts a sandy beach with a white surfboard laying horizontally on the sand. The surfboard is covered in various writings, likely advertising beach rentals or other beach-related services. A few chairs can also be seen scattered around the beach area. \n\nAdditionally, there are two bottles visible in the scene. One bottle is located towards the left side of the surfboard, while the other bottle is positioned towards the right side of the surfboard."}
{"image_id": 361351, "caption": "The image displays a delicious pizza with tomatoes and cheese, sitting inside a box on a table. The pizza occupies most of the space within the box, leaving room only for one slice. Next to the pizza box, there is a bottle of beer, likely ready to accompany the meal. The combination of pizza and beer creates an inviting atmosphere for a delicious meal or gathering with friends."}
{"image_id": 202154, "caption": "The image features a delicious cheese pizza served on a wooden table, cut into pieces. The pizza is placed on a cutting board with a few remaining pieces remaining intact. The remaining pieces are spread out on the table, ready to be enjoyed by those who want to savor them. There are also two chairs visible in the background of the scene, one on the left side and another on the right side of the table."}
{"image_id": 94248, "caption": "The scene features two clocks mounted on a tall stone column in a city street, likely in London. Each clock is positioned side by side on different sides of the column, one clock on the left side and the other on the right side. The clocks are mounted higher than eye level, making them visible from afar.\n\nThere are several people around the clocks, one person standing on the left side of the column, another person on the right side, and another person further away. Additionally, two cars can be seen parked on the street below the clocks.\n\nThere are also two potted plants visible in the scene, one on the left side of the column and another on the right side, adding some greenery to the urban environment."}
{"image_id": 200681, "caption": "The image depicts a man and his dog, both jumping to catch a blue frisbee in a grassy field. The dog is positioned on the left side of the scene, jumping upwards to catch the frisbee mid-air. The man is also jumping upwards, likely to catch the frisbee too or just for fun.\n\nThere are two other dogs in the background, one slightly behind the main dog, and another dog positioned further away to the right side of the scene. These dogs appear to be watching the game unfold between the man and his main dog."}
{"image_id": 532989, "caption": "The image features a giraffe sitting on the grass, enjoying its time in a grassy field. The giraffe is positioned in a relaxed manner, taking up most of the grassy area. In the background, there are logs and branches scattered around, giving the scene a natural and serene atmosphere."}
{"image_id": 565989, "caption": "The image features a clock tower with two statues of raccoons on top of it. The clock itself is placed on top of the tower, visible above the statues. The statues are positioned to one side of the clock tower, while another statue is positioned on the other side. \n\nThere are trees in the background behind the clock tower, adding a sense of depth to the scene. Two people can be seen in the background, likely admiring the clock tower and statues from afar."}
{"image_id": 67315, "caption": "The image depicts a man wearing a striped tie and buttoned up shirt. He is leaning forward with his hands behind him, possibly resting them on a table or chair. The tie he's wearing is blue with white stripes. In addition to his formal attire, there is another tie visible in the background, suggesting that he might be in a professional setting or preparing for a formal occasion."}
{"image_id": 157170, "caption": "The image depicts a group of sheep standing together on top of a hillside. There are five sheep visible in total, with some of them positioned close together while others stand slightly apart from each other. They appear to be gazing into the distance, possibly admiring their surroundings or contemplating their next steps.\n\nThe hillside itself has grassy patches where the sheep stand, and there are also some buildings visible in the background, likely farm buildings or structures related to the sheep's care and feeding. Overall, it is a picturesque scene of sheep enjoying their time outdoors on a hillside with buildings in the background."}
{"image_id": 328786, "caption": "The image depicts a row of benches along a pathway in a park setting. The benches are arranged in a row, facing each other, creating an inviting space for park visitors to sit and relax. There are a total of nine benches visible in the scene, varying in size and position along the pathway. \n\nThe pathway itself is lined with leaves, adding to the park's natural ambiance. Some leaves are scattered around the benches, and others are found along the pathway itself. This creates a pleasant environment for park visitors to enjoy their time outdoors."}
{"image_id": 46011, "caption": "The image depicts a small white airplane parked inside a fenced area at an airport. The plane occupies most of the space within the fenced area, extending from the left side of the frame almost all the way to the right side. The fence itself consists of wire mesh, and it surrounds the entirety of the aircraft.\n\nThere are two people visible near the plane; one person is situated close to the left side of the airplane, while the other person is slightly behind them, closer to the right side of the aircraft. In addition to the main airplane, there is another smaller aircraft visible in the background on the left side of the frame."}
{"image_id": 384348, "caption": "The image depicts a snowy ski slope with a woman skiing downhill on skis and poles. She is wearing a blue jacket and hat, giving her a stylish appearance as she skiing down the snowy path. The woman appears to be skiing alone on this snowy hillside, enjoying the winter sport."}
{"image_id": 451798, "caption": "The image depicts a wall hung with numerous different colored ties, which are hung neatly and organized. There are at least thirteen different tie styles visible, each one distinctly different in pattern or color. Some of the ties are hung higher than others, creating an eye-catching display. \n\nA hat hangs above the array of ties, adding an extra layer of visual interest to the scene. The combination of the wall hung tie display and the hat creates an appealing display for anyone browsing through tie options."}
{"image_id": 376545, "caption": "The image depicts a young man skillfully performing a trick on his skateboard, jumping into the air while others watch him. The skateboarder is in the center of attention as he showcases his talent. \n\nThere are two other people in the scene, one on the left side and another on the right side of the image. These spectators appear to be admiring the skateboarder's performance. Additionally, there is another skateboard visible near the right edge of the image, possibly belonging to one of the spectators or another skateboarder who has momentarily paused their own activity to observe the action unfolding before them."}
{"image_id": 11538, "caption": "The image depicts a man riding a motorcycle on a roadway or highway, possibly near the woods. The motorcycle occupies most of the frame, with its front wheel visible on the left side of the image. The man riding the motorcycle has his hands on the handlebars, maintaining control of the motorcycle as he rides down the road.\n\nThere are also two other smaller motorcycles visible in the background, one towards the right side of the frame and another slightly left of center. The motorcycle rider appears to be alone on the roadway, enjoying his ride."}
{"image_id": 346207, "caption": "The image depicts a cat laying down on a desk next to two computer monitors. The cat occupies most of the space on the desk, positioned between the two monitors, which are turned on. There is also a laptop placed on the desk, slightly to the left side of the cat.\n\nIn addition to the cat and monitors, there are several books scattered around the desk. Some books are placed near the left side of the desk, while others are positioned near the right side. There is also a cell phone resting on the desk near the middle of the scene."}
{"image_id": 359238, "caption": "The image depicts a man wearing a brown jacket and yellow shirt sitting on a chair on a train. He appears to be sleeping or resting with his eyes closed, and his mouth is open. There is a cup placed next to him on the table where he is sitting. \n\nA handbag can be seen close to the man, likely belonging to him or someone else on the train. The train itself occupies most of the background of the image, creating a sense of motion and transportation."}
{"image_id": 297610, "caption": "The image depicts a young man riding a skateboard inside an indoor skateboarding park. He is skillfully balancing himself on the skateboard while performing tricks and grinding along a surface. The indoor skateboarding park provides him with the necessary environment to practice his skills without external factors such as weather conditions or traffic interference."}
{"image_id": 428447, "caption": "The image depicts a street scene where two traffic lights are mounted on poles on opposite sides of a street. Both traffic lights are displaying red signals. Several cars are parked along the street, with one car parked near each traffic light pole. There are also two trucks parked along the street.\n\nTwo people can be seen walking down the street, one near the left side of the image and another person towards the right side of the scene. A car can be seen parked close to the right side of the street, and another car is parked further away towards the left side of the scene."}
{"image_id": 428769, "caption": "The image features a black Mercedes car parked next to a parking meter on the street. There are several other cars parked nearby in various sizes and positions. The Mercedes car is parked close to the meter, occupying most of the frame, while other cars are parked further away in the background."}
{"image_id": 452084, "caption": "The image depicts a table with two bowls containing breakfast items such as eggs, sausage, and tomatoes. The first bowl contains sausage, tomatoes, and bread while the second bowl contains eggs. A fork is placed next to these bowls, ready to be used. The table seems to be made of wood.\n\nThere are two pieces of bread visible in the scene, one placed near the first bowl and another near the second bowl. Additionally, there are two tomatoes visible in the scene, one inside each bowl."}
{"image_id": 545363, "caption": "The image depicts a bench that has been placed on its side, lying next to a concrete structure or wall, possibly on a sidewalk near a river or canal. There are several people around the bench, some close to it while others are farther away. In total, there are nine people visible in the scene, some standing closer to the bench while others are more distant.\n\nA chair can also be seen next to the bench, further emphasizing that this location might be a place where people gather or rest. The placement of the bench on its side suggests that it might have been intentionally positioned this way or accidentally fell due to external factors such as wind or an accident."}
{"image_id": 77963, "caption": "The image features a store with two large cow statues suspended from the ceiling, one above the other. Both cow statues are black and white, resembling actual cows, and they are positioned above a display of flowers. \n\nThe store has a green background that complements the colorful display of flowers below the cow statues. In addition to the main display, there are several smaller flowers scattered throughout the store, further adding to the colorful decoration. Two people can be seen in the store, one towards the left side and another towards the right side of the image, likely admiring the store display or browsing through items for sale."}
{"image_id": 78093, "caption": "The image depicts a woman skiing down a snowy pathway during wintertime. She is wearing pink skiing gear and skiing downhill on skis. There are trees along the pathway, adding to the scenery of the winter landscape. She appears to be smiling as she skiing down the snowy pathway."}
{"image_id": 346334, "caption": "The image depicts two brown bears grazing on grass in a field with tall grass. They are both standing on their hind legs and appear to be eating grass or leaves off the ground. The field is expansive and provides ample space for these animals to roam freely. The scene captures a moment of these animals feeding in their natural habitat."}
{"image_id": 185633, "caption": "The image depicts a bathroom with a bathtub positioned next to a sink. The bathtub appears to be partially empty, and there are several bottles scattered around the bathroom. One bottle is located near the bathtub, another is near the sink, and two others are placed close together near the sink area. There are also two cups present in the bathroom, one near the sink and another close to the bathtub. In addition to these items, there is a toothbrush resting near the sink."}
{"image_id": 327165, "caption": "The image depicts a man trimming a little boy's hair at home, likely preparing him for school. The boy is seated in a chair while the man, likely his father or another relative, carefully clips his hair using scissors. \n\nIn addition to the main scene, there are two other people present in the room: one person standing near the right side of the room, and another person further back on the left side. A few objects are also visible in the background: a chair positioned near the right side of the room, another chair towards the right edge of the room, and a book placed near the middle of the room."}
{"image_id": 410632, "caption": "The image depicts three baseball players standing on a field during a game, likely taking a break or discussing strategy. They are positioned close together, with one player on the left side of the field, another player slightly more centrally located, and the third player on the right side of the field. The players appear to be enjoying the game and each other's company as they pause momentarily during the gameplay."}
{"image_id": 468471, "caption": "The image depicts a man jumping high above a bed in what appears to be an interior showroom or bedroom display area. He is dressed in a suit and tie, demonstrating his jumping ability in front of various bedding options. There are multiple pillows on the bed, including ones positioned near the middle and others towards the right side of the bed.\n\nIn addition to the main jumping man, there are other people present in the scene, one person located on the left side of the bed and another person on the right side. All these people seem to be observing the jumping man or participating in the display activity."}
{"image_id": 241317, "caption": "The image depicts a man walking next to a cart loaded with fruit, likely transporting it to sell at a marketplace or doorstep. The cart contains various fruits such as bananas, apples, and oranges, which are visible in different positions on the cart. The man appears to be managing the cart himself, possibly transporting these fresh produce items from one location to another."}
{"image_id": 444982, "caption": "The image depicts three zebras grazing on grass in an enclosure. They are spread out across the grassy field, one zebra towards the left side of the field, another in the middle, and the third zebra towards the right side. Their heads are down as they feed on the grass. \n\nThere is also a tree visible in the background, providing some shade and texture to the scene. Overall, it is a peaceful scene showcasing these animals grazing together in their habitat."}
{"image_id": 117563, "caption": "The image depicts two men standing up in a room playing video games together using a Wii console. Both men are holding remote controllers, one controller each, engaging in the gameplay activity. One of the men is positioned slightly left of center, while the other man is positioned towards the right side of the room.\n\nThe room features two couches, one occupying most of the background area, and another smaller one towards the right side of the room. There is also a chair situated near the right side of the room, providing additional seating options for the room."}
{"image_id": 206579, "caption": "In this image, an older man is kneeling down next to a table where a birthday cake with candles is placed. He appears to be blowing out the candles on his birthday cake, celebrating his special day. Another person can be seen standing behind him.\n\nThe table occupies most of the background of the scene, and there are two chairs visible around it. On the table, there are two knives placed next to each other, likely used for cutting the cake."}
{"image_id": 221172, "caption": "The image depicts a tennis court where two men are playing tennis. One of them is actively engaged in hitting a tennis ball with his racquet, while the other player watches him play. They both appear to be professionals participating in a match.\n\nThere are several chairs scattered around the court, some placed near the players, others placed farther away. A tennis ball can be seen on the court, likely in motion during the game. The scene captures the intense nature of the game and the players' focus on their respective positions on the court."}
{"image_id": 317969, "caption": "The scene depicts a herd of sheep walking down a roadway, with mountains visible in the background. There are at least thirteen sheep visible in the image, spread along the roadway, some walking in groups while others are solo. They appear to be traversing the roadway together, likely being guided by their owner or herder.\n\nA person can be seen standing near the middle of the scene, likely overseeing the sheep as they travel down the roadway. The sheep seem to be peacefully grazing their way through the countryside, creating a picturesque scene of rural life."}
{"image_id": 82150, "caption": "The image depicts a young man lying down on a bed, holding two white Wii controllers in his hands. The controllers resemble steering wheel and pedal setups, suggesting he might be playing a racing game on his Nintendo Wii console. The man appears to be smiling and enjoying himself as he engages with the game.\n\nThe bed occupies most of the space in the room, with a chair visible towards the right side of the bed. The overall scene gives off a relaxed and casual atmosphere as the young man spends time playing games on his console."}
{"image_id": 284064, "caption": "The image depicts a man playing tennis on a court, swinging his tennis racquet and successfully hitting a tennis ball above his head. The tennis ball is flying high above him, towards the right side of the court. There are other people present in the background, possibly spectators or fellow players. The scene captures the dynamic nature of tennis as the man skillfully plays his game."}
{"image_id": 372203, "caption": "The image depicts a lonely bench situated on a desert plain, which appears dry and deserted. The bench is located near a fire hydrant, making it a unique combination of objects in this setting. Above the bench, there is an umbrella providing some shade to the area.\n\nThere are several people scattered around the desert plain, some far away from the bench, others closer. A few cars can also be seen parked in the background, perhaps belonging to those who visit this desert plain. The overall atmosphere of the scene is peaceful and serene."}
{"image_id": 359136, "caption": "The image depicts a woman laying down on the floor next to a bathtub, wearing a black tank top and boots. She appears to be relaxed and enjoying her time in the bathroom. The bathroom itself features a sink positioned to the left side of the scene. The woman's positioning in relation to the bathtub adds a sense of comfort and relaxation to the scene."}
{"image_id": 499281, "caption": "The image depicts a kitchen equipped with modern appliances such as an oven and microwave. The oven is located towards the center of the scene, while the microwave is positioned above the oven on the left side of the scene. The kitchen also features a sink towards the right side of the scene.\n\nThere are several bottles scattered around the kitchen, some placed on countertops and others resting on shelves or surfaces. Additionally, there are two bowls visible in the kitchen, one placed near the center-left side of the scene and another towards the right side. A potted plant can be seen on the left side of the scene, adding a touch of greenery to the environment. Lastly, there is a knife placed near the center of the scene, ready for use in cooking or preparing food."}
{"image_id": 192233, "caption": "The image captures a tennis player in action on a court, swinging his tennis racquet with precision at a ball. The player is wearing a blue shirt and white shorts, showing off his athleticism and focus on the game. The tennis ball is positioned near the center of the scene, indicating that it is the main focus of the player's attention at that moment. The player's shadow can be seen cast on the court surface, adding depth and dimension to the scene."}
{"image_id": 11987, "caption": "The image depicts a room with an odd architectural design that resembles a tent or a treehouse. The room contains two bedrooms connected by a common area. There are two bedroom suites within the room, one occupying the left side and the other occupying the right side of the room.\n\nIn each bedroom suite, there are two beds positioned side by side. Additionally, each bedroom suite features a chair placed near one of the beds. The common area features two dining tables, one located towards the left side of the room and another towards the right side.\n\nInterestingly, there is also a fireplace present in the room, adding warmth and coziness to the space. Finally, two chairs can be found in the common area between the two bedroom suites, providing additional seating options for relaxation or conversation."}
{"image_id": 406810, "caption": "The image depicts a crowded room where a man is sitting at a table using his laptop computer. The room seems to be set up for a presentation or lecture, as there are several other people present in various positions around the room. \n\nIn addition to the laptop computer, there are two TV screens visible in the room. One TV screen is positioned above the table where the laptop is placed, while the other TV screen is located towards the right side of the room.\n\nThere are also several other objects in the room such as chairs, a clock on the wall, a handbag placed near one of the tables, and a bottle placed on another table. Some people are seated while others are standing, creating a busy atmosphere."}
{"image_id": 99965, "caption": "The image depicts a person sitting down at a dining table, enjoying a sandwich and some chips. The sandwich is cut in half and placed on a plate next to a plate full of potato chips. The person's hand can be seen resting on the table next to the plate of sandwiches and chips. The table itself occupies most of the background of the image."}
{"image_id": 17328, "caption": "The image depicts a red train traveling along tracks in winter conditions. The train occupies most of the frame, occupying a large portion of the tracks as it travels down the track.\n\nThe snowy conditions can be seen in various parts of the scene, including snow covering the ground and tracks. Additionally, there are several birds scattered around the scene, adding life to the wintery atmosphere. Overall, the scene captures the beauty of wintertime as seen through the eyes of the train traveling through the snowy landscape."}
{"image_id": 393682, "caption": "The image depicts a plate full of delicious desserts, including two pieces of pie with red sauce drizzled over them. One pie is positioned towards the left side of the plate, while the other pie occupies the right side of the plate. Alongside these two delicious pieces of pie, there is also a fork placed prominently on the plate, ready to be used to enjoy the desserts."}
{"image_id": 540093, "caption": "The image depicts a car covered in plastic, likely protecting it from rain or other weather conditions. The car is parked next to a tree on a street corner. Another car can be seen parked behind it, slightly further away. \n\nThere are several people scattered around the scene, some close to the cars and others walking along the street. Some of them are carrying umbrellas, protecting themselves from the rain or sunlight. Additionally, there are two handbags visible in the scene, one near the middle of the scene and another towards the right side of the image."}
{"image_id": 242400, "caption": "The image depicts a woman standing next to a decorated tree sign pole, smiling as she poses for the camera. She appears to be enjoying herself while standing next to the festive pole with Christmas lights wrapped around it.\n\nThere are several other people in the background, including one person to the right side of the woman and another person behind her on the left side. Additionally, there are two cars parked behind the woman, one behind her left side and another behind her right side.\n\nA handbag can be seen close to the woman, possibly hers or another woman's bag. The scene seems to capture a festive moment during the holiday season."}
{"image_id": 409009, "caption": "The image depicts a modern train station with a white train parked on the tracks. The train occupies most of the scene, extending from left to right and occupying most of the space between the station platform and the train tracks. The station itself appears to be empty of passengers at the moment.\n\nThere are several signs visible throughout the station, possibly providing information about train schedules or directions. One sign is located above the train, another on the left side of the train, and another near the right side of the train."}
{"image_id": 6091, "caption": "The image depicts a person standing next to a stop sign with their hand placed on it. They appear to be touching or writing something on the sign. The person's hand can be seen occupying most of the sign area, which draws attention to their action.\n\nThere are other people present in the background, but they are smaller and do not seem to be interacting with the main subject or the stop sign. The scene seems to be taking place at nighttime, with darkness covering most of the background."}
{"image_id": 42834, "caption": "The image depicts an older woman sitting at a table in what appears to be a restaurant setting. She is eating ham sandwiches off a plate placed on the table, while simultaneously using a camera or camera phone to capture her meal. The woman appears to be enjoying both her meal and capturing the moment.\n\nThere are several ham sandwiches visible on the table, some closer to her plate, and others spread out across the table. The table itself occupies most of the scene, with the woman occupying a significant portion of the space as she eats and uses her camera."}
{"image_id": 433554, "caption": "The image depicts a group of people enjoying themselves at a waterfront park. There are several people water skiing in a lake, some of them wearing life jackets for safety. The skiers are spread out across the lake, some closer to the shore while others are further away.\n\nOn land, there are numerous spectators watching the water skiing action unfold, some standing close together while others are scattered throughout the scene. A few spectators are wearing life jackets, likely preparing to join the water skiing fun themselves.\n\nVarious objects can be seen around the scene, such as a chair positioned near the water skiing action and a boat in the background. The overall atmosphere is lively and energetic as people engage in water sports and activities at this park."}
{"image_id": 174987, "caption": "The image showcases a train covered in graffiti artwork, particularly green graffiti. The train itself is blue and yellow, adding to the colorfulness of the scene. It appears to be stationary at a train station, ready to board passengers.\n\nThere are several windows visible on the train, and one window has a handwritten number \"13\" visible on it. The train occupies most of the image, and its vibrant colors make it stand out against the background."}
{"image_id": 116208, "caption": "The image depicts a table full of delicious food and drinks, likely in a restaurant setting. There are two pizzas prominently displayed on the table, one occupying most of the space and another smaller one towards the right side of the table. A third smaller pizza can be seen near the edge of the table.\n\nAdditionally, there are several wine glasses scattered across the table, some empty and others full. There are also bottles on the table, one placed near the center of the table and another towards the right side. The table appears to be a dining table, and a chair can be seen in the background on the left side of the table."}
{"image_id": 80131, "caption": "The image depicts two people, a man and a woman, smiling together while standing in a kitchen. They appear to be enjoying themselves as they stand next to each other near a table. The woman is wearing a plaid shirt, and both are smiling brightly at the camera.\n\nThe kitchen is equipped with a sink and an oven, both placed near each other. There are several wine bottles scattered around the space, some placed on the table and others placed elsewhere. Additionally, there are two bowls on the table, one nearer to the woman and another nearer to the man. \n\nThe overall atmosphere of the scene is friendly and warm, as the couple smiles together in their kitchen environment."}
{"image_id": 310663, "caption": "The image depicts an old train engine parked on tracks in an abandoned lot. The train occupies most of the scene, with its front portion visible in the left foreground and its rear portion occupying the right side of the image.\n\nThere are two people visible near the train engine, one person located near the middle of the scene and another person slightly further away towards the left side of the image. The abandoned train car appears to be rusty and old, giving it a nostalgic feel."}
{"image_id": 100138, "caption": "The image features a black motorcycle parked on a street next to a green bush. The motorcycle is positioned close to the bushes, occupying most of the scene. Its front wheel is visible, resting on the ground near the motorcycle's front end.\n\nThere is also a sign visible at the left side of the scene, likely providing information or instructions for motorcycle riders or pedestrians passing through the area."}
{"image_id": 415613, "caption": "The image depicts a man wearing a green shirt, standing behind a counter and preparing sandwiches. He is using a knife to cut bread for sandwiches while wearing gloves for hygiene purposes. Various sandwiches can be seen laid out on the countertop, waiting to be prepared or already done. \n\nThere are several other items scattered around the countertop, including a bottle, a cup, a bowl, and several carrots. These items may be ingredients or utensils used during the sandwich preparation process.\n\nOutside of the countertop area, there are two cars visible in the background, one behind the other, possibly parked outside of a store or restaurant where the sandwiches are prepared."}
{"image_id": 214737, "caption": "The image depicts a beautifully decorated archway inside an ornate building, likely a church or a similar establishment. A clock hangs prominently above the archway, and two statues can be seen on each side of the clock, enhancing the grandeur of the architecture. \n\nThe archway itself has intricate detailing, including fancy scrollwork, adding an element of elegance to the overall design. There are windows placed above the archway, further accenting the structure's grandeur. The overall impression is one of majesty and grandeur, evoking a sense of wonder and admiration for the architecture and design of this building."}
{"image_id": 172718, "caption": "The image features a young boy wearing a tie and button-up shirt, likely posing for a portrait. He appears to be looking straight into the camera, seemingly focused on the camera person. The boy's tie is positioned diagonally across his chest, creating a well-put-together appearance."}
{"image_id": 99186, "caption": "The image depicts a red stop sign prominently positioned at an intersection on a roadway. The sign is placed next to a pole, and it appears to be facing away from the camera. In addition to the main stop sign, there are two smaller signs visible in the scene.\n\nThere are two cars present in the scene – one parked on the left side of the image and another one on the right side, both slightly behind the main stop sign. Furthermore, there are two trucks visible in the background, one occupying most of the background on the right side of the image and another one smaller truck on the left side of the scene."}
{"image_id": 3580, "caption": "The image depicts a man lying down on a couch, holding a Wii remote controller in his hands as he plays video games. He appears to be relaxed and enjoying himself. Around him, there are several books scattered around the room, some on the couch and others placed on other surfaces.\n\nThere are also two chairs present in the room, one positioned near the left side of the couch and another chair towards the right side of the room. Additionally, there are two cups placed on surfaces, one near the center of the room and another towards the left side of the room."}
{"image_id": 526044, "caption": "The image depicts a cow standing on the edge of a beach near a lake or ocean. The cow appears to be gazing at something, possibly the water or something else in its vicinity. The cow is positioned towards the center of the scene, occupying most of the space between the water and the shore."}
{"image_id": 105291, "caption": "The scene depicts a red stop sign on a pole next to a white house, with a blue sign hanging above it. There are two cars parked near the house, one on the left side and another on the right side of the image. A third car can be seen parked further away on the left side of the image. A person can also be seen standing near the cars on the left side of the scene."}
{"image_id": 577169, "caption": "The image depicts a group of people standing around a large clock, admiring its intricate design. There are seven people visible in total, each one positioned around the clock, possibly admiring its craftsmanship or simply enjoying the view. A woman can be seen pointing at something inside the clock, drawing attention to it among the group. \n\nThe clock itself occupies most of the background of the image, and its size emphasizes its importance in the scene. There is also a handbag visible near one of the people, likely belonging to one of them."}
{"image_id": 181574, "caption": "In this image, two people are sitting at a table enjoying a delicious pizza together. A smiling man is cutting into the pizza using a fork and knife while another person, likely a woman, watches him intently. They both seem to be enjoying their meal.\n\nThe table has two white plates, one located towards the left side of the table and another towards the right side. There are also two glasses placed on the table, one towards the right end and another towards the left end of the table."}
{"image_id": 83441, "caption": "The image depicts two different views of a living room, both displaying various furniture and items. In both views, there are two black couches positioned opposite each other, one occupying most of the space on the left side of the room and the other occupying most of the space on the right side of the room. \n\nThe first view shows the first couch occupying most of the space on the left side of the room, while the second view shows the second couch occupying most of the space on the right side of the room. Both views also feature a television placed centrally in each room, along with several books scattered around both sides of the room, possibly indicating a reading area or library. \n\nThe first view also includes a chair positioned near the first couch, while the second view includes another chair placed near the second couch. Both views also showcase a clock on the wall in each room, providing a sense of time to the occupants of the living room."}
{"image_id": 130527, "caption": "The image depicts a herd of cows grazing peacefully on a grassy hillside near a blue ocean. There are at least thirteen cows spread across the scene, some grazing closer to the ocean while others are situated further away. The cows are spread out across the field, making it appear like a peaceful scene of animals grazing freely in nature."}
{"image_id": 86471, "caption": "The image depicts a tennis player on a court, skillfully swinging his tennis racquet to hit the ball. The player appears to be well-positioned and ready to hit the ball in motion.\n\nThere are several tennis balls visible in the scene, one of which is in motion near the player's racquet. Another tennis ball can be seen further away from the player, possibly after hitting the racquet or awaiting to be hit by the player.\n\nOverall, the scene captures the excitement of a tennis game, showcasing the player's skill and focus on the ball."}
{"image_id": 105737, "caption": "The image depicts a cozy reading room with numerous books stacked up and arranged on shelves. In the center of the room, there is a teddy bear sitting on top of a bookcase, likely on top of a book shelf or a shelf full of books. The teddy bear appears to be sitting on top of a book or a stack of books, adding a touch of warmth and personality to the room."}
{"image_id": 212842, "caption": "The image depicts a herd of zebras gathered together in a grassy field near a tree. There are at least thirteen zebras visible in the scene, some of them standing close together while others are spread out throughout the field. They appear to be grazing peacefully on the grassy field under the tree, enjoying their natural habitat."}
{"image_id": 105220, "caption": "The scene depicts a snowy ski slope with two skiers skiing downhill under a red tent. Both skiers are wearing helmets for safety. They are skiing side by side, one skiing slightly ahead of the other.\n\nThere are three flags visible in the background, one towards the left side of the scene, another towards the right side, and the third flag is further away towards the left side of the slope. The skiers are skiing past these flags as they navigate down the slope."}
{"image_id": 490701, "caption": "The image depicts a person eating dessert in front of a plate full of delicious treats. They are using a fork to scoop ice cream off a dessert item, possibly a brownie or cake covered in ice cream. The person appears to be enjoying their dessert experience.\n\nThere is a glass cup next to the plate, most likely containing a drink to accompany the dessert. The scene captures the person's attention as they savor their dessert creation."}
{"image_id": 368961, "caption": "The image depicts two elephants in an enclosure at a zoo, one of them is larger than the other. They are both standing next to each other near a doorway, possibly looking for food or awaiting their turn to exit the enclosure. A third elephant can be seen behind them, but it is smaller and less prominent.\n\nThere are two sports balls in the scene, one near the larger elephant and another closer to the smaller elephant. These balls might be used as part of their enrichment activities at the zoo. A person can also be seen in the background, likely observing or caring for the elephants."}
{"image_id": 520892, "caption": "The image depicts a woman holding a hot dog wrapped in paper, preparing to eat it. She is wearing a black shirt and has her eyes closed as she bites into the hot dog. The woman appears to be enjoying the moment.\n\nThere are two other people visible in the background, one on the left side of the woman and another person located on the right side. These individuals seem to be at a distance from the main subject, possibly observing her or engaging in their own activities."}
{"image_id": 113354, "caption": "The image depicts three zebras grazing together in their habitat. They are feeding on grass in an area with trees in the background, creating a naturalistic environment for them to thrive.\n\nEach zebra is focused on eating grass, with one zebra positioned on the left side of the image, another zebra in the middle, and the third zebra on the right side. Their striped patterns can be seen clearly against the background of grass and trees."}
{"image_id": 33652, "caption": "The image features a delicious homemade pizza on a pan, loaded with cheese and chicken. It appears to be a specialty pizza with cheese and chicken as its main ingredients. The pizza is placed on top of a table in a kitchen setting, inviting viewers to savor its deliciousness."}
{"image_id": 511153, "caption": "The image depicts a blue and white train traveling along tracks in a train yard. The train occupies most of the scene and appears to be traveling past a station. There are several other smaller trains visible in the background, some closer to the main train and others positioned further away. Additionally, there are several people scattered around the train yard, likely either waiting for trains or conducting business related to train operations."}
{"image_id": 328957, "caption": "The image features a cat comfortably sitting on top of a cat tree, enjoying its elevated position. The cat tree itself is made up of several components, including multiple cat scratching posts and catnip toys scattered around the cat's position. These cat scratching posts and catnip toys are placed at different heights and angles, providing the cat with a variety of options to play with and climb on. The cat tree occupies most of the room, creating a playful environment for the cat to explore and interact with its surroundings."}
{"image_id": 190015, "caption": "The image depicts a green truck parked next to a pile of hay in a field. The hay pile is large and overflowing onto the ground, creating an impressive stack. The truck appears to be parked nearby, possibly ready to load or transport the hay. \n\nIn addition to the truck and hay pile, there are trees in the background. Some trees are located near the truck, while others are scattered throughout the field. Overall, it is an agricultural scene where hay is being managed and transported."}
{"image_id": 244925, "caption": "The image features a person wearing a backpack, with a banana poking out of one side of it. The banana is prominently visible and seems to be a unique feature of the backpack design. The person is also holding a camera in their other hand, ready to capture moments as they go about their day.\n\nThere are two other people visible in the background, one on the left side of the image and another on the right side. They appear to be unrelated to the main focus of the scene, which is the person with the banana-themed backpack and camera."}
{"image_id": 29406, "caption": "The image depicts a bench placed in a grassy area next to a building, possibly a house or an apartment complex. The bench is made of wood and is positioned in front of a bush that adds a touch of greenery to the scene. \n\nNumerous plants surround the bench, including a shrub directly next to it, another shrub behind it, and another one on the left side of the bench. In addition to these plants, there are two birds visible in the scene, one in the background towards the right side of the bench, and another one towards the left side of the bench."}
{"image_id": 32570, "caption": "The image depicts a surfer riding a wave on his surfboard in the ocean. He appears to be skillfully navigating the wave as it breaks around him. The surfer's surfboard is visible, as well as his arms extended outward to maintain balance while riding the wave. The water appears to be murky green, creating an atmospheric scene."}
{"image_id": 260608, "caption": "The image depicts a group of children playing soccer on a grass field. There are four girls actively engaging in the game, running around to kick the ball. One girl is closer to the left side of the field, another girl is more centrally positioned, and two others are on the right side of the field. They all appear to be concentrating on their respective positions on the field.\n\nAdditionally, there is another ball visible in the background, likely another ball being used during practice or practice session."}
{"image_id": 291286, "caption": "The image depicts a man riding a skateboard down a street in an urban setting. He is wearing jeans and a black shirt as he skateboards down the street. The street is busy with pedestrian traffic, including several people walking around. Some of them carry handbags with them as they navigate through the crowded street. The atmosphere seems vibrant and bustling as people go about their day."}
{"image_id": 375278, "caption": "The image depicts a black dog sitting inside an open suitcase, possibly in a hotel room or bedroom setting. The dog appears to be comfortable inside the suitcase, sniffing around it. There are two magazine covers visible in the scene, one on the left side and another on the right side of the suitcase. \n\nThe suitcase itself occupies most of the space in the image, with the dog occupying a portion of the suitcase and the magazine covers occupying the remaining space on either side of it."}
{"image_id": 290684, "caption": "The image features a woman sitting on a pole outside, holding a stuffed pink teddy bear close to her chest. The woman appears to be smiling and enjoying herself as she poses with the teddy bear. The scene takes place outdoors, with trees visible in the background, adding to the pleasant atmosphere of the scene."}
{"image_id": 29306, "caption": "The image depicts a brown dog standing on a sandy beach. The dog appears to be wearing a collar and tags, indicating that it may be well-loved by its owner. The dog's ears are perked up as if it is alert and ready to respond to any incoming commands or stimuli.\n\nThe beach itself seems deserted, with no other visible animals or people in the scene. The dog's positioning is towards the center of the frame, making it the focal point of the image."}
{"image_id": 173375, "caption": "In this snowy scene, a man wearing snowboarding gear is riding downhill on a snowboard. He appears to be enjoying himself as he navigates through the snowy terrain. \n\nThere are other people present in the background, possibly fellow snowboarders or skiers enjoying the snowy mountain slope. The scene depicts a winter sports enthusiast having fun on the snowboard slope, with others also participating in winter sports activities nearby."}
{"image_id": 198590, "caption": "The image depicts a red bird perched on the mirror of a tan truck parked next to another truck. The red bird is looking directly into the camera, capturing attention as it perches on the mirror. Another smaller bird can be seen slightly behind the main bird, likely also part of the same species.\n\nThe trucks are parked side by side on a street, adding context to the scene. Additionally, there are two bottles visible in the image, one placed near the main truck and another further away."}
{"image_id": 25747, "caption": "The image depicts a train traveling along tracks through a forest area. The train is traveling past trees and the tracks are visible running parallel to each other. There are several trees on both sides of the tracks, creating a serene atmosphere.\n\nThe train itself has two locomotives attached to it, one towards the front and another towards the middle of the train. The train appears to be traveling along tracks that are part of a train yard, indicating that it may be a freight train or simply passing through a train yard."}
{"image_id": 346589, "caption": "In this snowy scene, two people are skiing down a mountain slope. The first person is skiing uphill while the second person is skiing downhill, both of them in motion. The skiing couple appears to be enjoying their time together on the snowy slope.\n\nAdditionally, there are two skis visible in the scene, one near each person. The first person's ski is positioned uphill while the second person's ski is downhill. Furthermore, there are two backpacks present in the scene, one near each person. The first person's backpack is positioned uphill while the second person's backpack is downhill."}
{"image_id": 121106, "caption": "The image depicts a crowded airport terminal with numerous people waiting around luggage claim area number 11. Passengers are seen retrieving their luggage from luggage claim conveyor belts. Various suitcases can be seen at different locations within the scene, some of them near the conveyor belts while others are placed on the floor.\n\nThere are several people in the scene, some closer to the conveyor belts while others stand further away, patiently waiting for their luggage to arrive. Some people are carrying handbags, further indicating their traveling status. Overall, it is a busy scene typical of an airport terminal during luggage claim time."}
{"image_id": 392850, "caption": "The image depicts a tabletop with various fruits and a knife on it. There are three apples arranged, one on the left side of the table, another in the middle, and the third one towards the right side. A banana is also present on the table, positioned towards the right side, occupying most of the space from top to bottom. \n\nThe tabletop also features two bowls placed on top of each other, one occupying most of the upper right corner of the table, and the other occupying the upper left corner. A knife can be seen placed on the tabletop, likely used for cutting or preparing the fruit."}
{"image_id": 554241, "caption": "The image depicts a crowded city street scene where people are walking around and engaging in various activities. In the center of the scene, there is a woman carrying an umbrella, possibly preparing for rain or sun protection. Another woman is seen walking with an umbrella too, possibly for similar reasons.\n\nThere are several other people dispersed throughout the scene, some walking alone or in groups, creating a busy atmosphere typical of an urban environment. Some people are carrying handbags as they walk around, adding to the busy nature of the scene. \n\nVarious modes of transportation can be seen as well, including cars parked along the street, bicycles parked or being ridden by people, and even a bus visible in the background."}
{"image_id": 341017, "caption": "The image depicts a man standing on top of a truck or truck bed, surrounded by a herd of animals. There are fourteen goats in total, some of them standing on the truck bed next to the man, while others are scattered around him. The man appears to be interacting with the animals, likely feeding them or taking care of them.\n\nThe truck itself occupies most of the frame, showcasing its size and capacity to transport such a large number of animals. The man seems to be well-versed in handling livestock and handling the situation safely."}
{"image_id": 135497, "caption": "The image depicts a man sitting at a table in what appears to be a restaurant setting. The man is making an odd gesture with his hands, likely gesturing towards a plate of food placed on the table. Another plate of food is visible further away from him.\n\nThere are several bottles placed around the table, some on the table itself and others on a surface nearby. The table also contains a fork and a knife, both of which are likely used for enjoying the food. Additionally, there are two cars visible outside the restaurant window, one towards the left side of the window and another towards the right side."}
{"image_id": 159260, "caption": "The image depicts a blue and white train traveling along railroad tracks. The train is moving fast, occupying most of the scene as it travels down the tracks. There are two train tracks visible in the image, one towards the left side of the scene and another towards the right side.\n\nThere are two people visible in the scene, one near the middle of the image and another towards the right side. Additionally, there are two cars visible in the background, one towards the left side of the scene and another towards the right side."}
{"image_id": 417332, "caption": "In this baseball game scene, a pitcher is in action on a pitcher's mound. He is holding a baseball and has just thrown it towards home plate. The baseball can be seen in mid-air during this moment.\n\nThere are other players on the field, including one player holding a baseball bat, ready to hit the ball once it arrives at home plate. The scene captures the action-packed moments during a baseball game."}
{"image_id": 90520, "caption": "The image features two dolls dressed up as Japanese geisha women. They are both wearing red dresses, one doll appearing slightly more elegant than the other, and both dolls have their hair styled in intricate hair ornaments. \n\nThere are also two teddy bears present in the scene, one near each doll. One teddy bear is positioned behind the doll on the left, while the other teddy bear is behind the doll on the right. Additionally, there are two smaller dolls in the background, one on the left side and another on the right side of the scene."}
{"image_id": 318524, "caption": "The image depicts a rusty old train compartment with paint peeling off its sides. The rusty metal surface is covered in paint droppings and streaks of paint chips, giving it a weathered appearance. \n\nThere are several instances of paint peeling off the train compartment, creating a patchwork effect that highlights its age and wear. The train itself appears to be old and abandoned, adding to its rustic charm."}
{"image_id": 118406, "caption": "The image depicts a group of men playing soccer on a field, with one player skillfully leaping into the air to head the ball. The other players are scattered around the field, either actively participating or observing the action.\n\nThere are two cars parked near the field, one towards the left side of the field and another towards the right side. The cars seem to be parked by spectators or team members who have come to watch the match."}
{"image_id": 25748, "caption": "The image features a white boat with black lettering on its side, sitting docked in a harbor. The boat is tied up to a dock with rope, ensuring its positioning and stability. The boat's name is visible in black letters on its side, adding a personal touch to its appearance.\n\nThere are several other boats visible in the background, some docked close together while others are further away. Additionally, there are two people present in the scene, one located near the middle of the image and another towards the right side. Their presence might suggest they are either boarding or disembarking from one of the boats or simply enjoying their time near the waterfront."}
{"image_id": 365557, "caption": "The image depicts a snowboarder in blue attire riding down a snowy hill on their snowboard. They are making their way down the slope at speed, navigating through snowdrifts along the way. The snowboarder appears to be enjoying the thrill of snowboarding down the hill."}
{"image_id": 320978, "caption": "The image depicts a lively marketplace where fresh produce is sold. Numerous fresh vegetables and fruits are displayed, including broccoli and tomatoes. There are several broccoli bunches scattered around, some placed closer together while others are spread out across the marketplace. Tomatoes can be found both in bunches and individually placed around the marketplace. The marketplace appears to be filled with fresh produce, enticing customers to buy fresh vegetables and fruits."}
{"image_id": 315073, "caption": "In this image, there is a cat laying down next to a window, looking at the camera with its mouth open. The cat appears to be yawning or expressing its displeasure. A blanket or sweater is placed next to the cat, providing warmth and comfort. \n\nThere is also a bottle visible in the background, which might be related to the cat's owner or simply coincidentally placed near the window."}
{"image_id": 363927, "caption": "The image depicts a bus traveling down a roadway, with its orange lettering visible against the background. It appears to be a bus for Metrobus LLC. In addition to the main bus, there are several other smaller buses visible in the background, indicating a busy roadway or bus station area.\n\nThere are also several people present in the scene, some standing near the buses while others are scattered along the roadway. A car can be seen parked further back in the scene, near the left side of the roadway."}
{"image_id": 243355, "caption": "The image features a zebra walking through a grassy field enclosed by a fence. The zebra is the main focus of the scene, occupying most of the space from left to right. The field appears to be relatively dry, with grasses spreading out across the ground.\n\nIn addition to the zebra, there are two other animals visible in the background, one on the left side and another on the right side of the field. It seems like these animals are also part of the same enclosure or habitat as the zebra."}
{"image_id": 373521, "caption": "The image depicts an old bus parked on grass, likely abandoned or retired from service. The bus occupies most of the scene and covers a large portion of the grassy field where it is parked. The bus appears to be weathered and rusty, indicating its age and exposure to the elements.\n\nThe bus features an open door on one side, likely for passengers to board or exit. It also has windows along its sides, providing visibility for passengers inside. Although it appears empty and abandoned, it still retains its original design and structure as a bus."}
{"image_id": 76409, "caption": "The image depicts a bedroom with a bed occupying most of the space in the room. The bed has red bedding and appears to be in a bedroom with a sunny window, illuminating the room. There are two pictures on the wall above the bed, one on each side of the bed frame. \n\nOn the bedside table next to the bed, there are two bottles placed. A doorway can be seen on the right side of the room, possibly leading to another room or hallway."}
{"image_id": 485985, "caption": "The image depicts a young boy smiling and brushing his teeth while sitting down. He is wearing a blue sweater and appears to be enjoying the process of brushing his teeth. The boy is holding the toothbrush in his hand as he brushes his teeth.\n\nThere is a chair visible in the background behind the boy, possibly used for him to sit down while brushing his teeth."}
{"image_id": 27564, "caption": "The image depicts two young girls sitting next to each other on a leather couch. Both girls are playing video games using game controllers. They appear to be enjoying themselves as they immerse themselves in the gameplay.\n\nThere are two remote controllers visible in the scene, one near each girl. The girls are positioned side by side, occupying most of the space on the couch. Their feet can be seen resting on a table or floor below them as they sit and play the game together."}
{"image_id": 92749, "caption": "The image depicts a lush green field where three giraffes are peacefully grazing. They are spread out across the field, one closer to the left side, another in the middle, and the third one towards the right side of the field. Two of them are feeding on leaves from trees while the third one is grazing on grass near the trees.\n\nThere are two benches placed within the field, one towards the middle and another towards the right side of the field, likely meant for visitors to sit and observe the animals. Additionally, there are two bottles placed near the middle bench, possibly belonging to visitors who wanted to hydrate themselves during their visit."}
{"image_id": 554958, "caption": "The image features a cat sitting in a pile of leaves, branches, and grasses. The cat appears to be gazing at something, possibly observing its surroundings or its owner. The leaves are scattered around the cat's body, with some leaves positioned higher than others. The cat itself occupies most of the frame, showing its entirety as it rests amidst the leaves."}
{"image_id": 439971, "caption": "The image depicts a woman taking a selfie in her bathroom mirror. She is standing near the mirror with her camera held up in front of her face, capturing her reflection. She appears to be wearing a scarf around her neck and appears to be in a bathroom setting.\n\nThere are several bottles visible in the background, likely soap or other bathroom products. Additionally, there are two bottles placed near each other on the left side of the scene, and another bottle on the right side of the scene, further away from the woman taking the selfie."}
{"image_id": 559006, "caption": "The image depicts a large bear swimming in a body of water, possibly an ocean or a lake. The bear appears to be enjoying itself as it swims through the water. Its fur and furry ears are visible as it swims across the water surface. The bear's body occupies most of the image, showcasing its size and strength as it swims effortlessly through the water."}
{"image_id": 457262, "caption": "The image features two bananas on a table, one placed next to a coin that is also on the table. The coin is positioned at the bottom right side of the table, while the bananas are located above it. The bananas are in different stages of ripeness; one banana is ripe and ready to eat, while the other banana is still partially unripe."}
{"image_id": 263881, "caption": "The image features a large giraffe standing tall in a grassy field with trees in the background. The giraffe's legs are spread wide apart, showcasing its impressive height. Its head is positioned forward, gazing into the camera with its eyes open wide, as if posing for a picture.\n\nThis majestic creature occupies most of the frame, capturing attention due to its size and presence. Its unique patterns and striking appearance make it an interesting sight in this natural setting."}
{"image_id": 322594, "caption": "The image features two different bathroom sets side by side, showcasing different styles and layouts. Each bathroom includes a sink, a toilet, and a mirror. The first bathroom contains a white sink and a white toilet, while the second bathroom boasts a brown sink and a white toilet. There are also several bottles scattered around both bathroom sets, adding some personal touches to each space."}
{"image_id": 22423, "caption": "The image depicts a man feeding an elephant a hat, with both parties enjoying their interaction. The elephant is positioned on the left side of the scene, occupying most of the space from left to right. The man stands on the left side of the elephant, holding the hat out for the elephant to eat.\n\nThere are other objects in the scene as well. There are two more hats visible near the elephant, one placed higher than the other. A bottle can also be seen on the left side of the scene, close to the elephant."}
{"image_id": 59000, "caption": "The image depicts a cozy living room filled with furniture and decorations, including a Christmas tree. There are two chairs positioned in the room, one on the left side and another on the right side. The room also features a television located towards the left side of the room, and a collection of books scattered around the room, some stacked on shelves and others placed on various surfaces.\n\nThere are several bottles scattered throughout the room, some placed on surfaces and others placed in a line. Additionally, there are two remote controls found near the television, one on the left side and another on the right side of the room. A doorway can be seen in the background, leading into another room in the house."}
{"image_id": 119547, "caption": "The image depicts a group of people gathered together outside under a tent. One man wearing a suit and tie can be seen adjusting his tie, while another man wearing glasses and a yellow tie is standing next to him. There are three other people in the group, one woman wearing glasses and another woman wearing glasses and a white shirt.\n\nA microphone can be seen placed near one of the people in the group, possibly for interviews or speeches. Among the group, one person has a tie visible, adding to the professional appearance of the scene."}
{"image_id": 432763, "caption": "The image depicts a beach scene where a group of birds is gathered near the water. There are at least thirteen birds visible in various positions on the beach, some standing while others are flying over the water's edge. The birds are spread out along the sandy beach, some closer to the water and others further away, creating a dynamic scene."}
{"image_id": 125635, "caption": "The image features a black and white cat sitting on a windowsill, gazing out through the window. The cat appears to be curious about something outside, possibly watching birds or other animals passing by. The windowsill itself is white, contrasting nicely with the black and white cat."}
{"image_id": 542549, "caption": "The image depicts a bedroom scene where an unmade bed occupies most of the space. The bed appears messy with pillows and blankets scattered around it. Next to the bed, there are several books lying on the bedding, possibly books that were read earlier or ones that were left behind. \n\nA table, possibly a nightstand, can be seen in the background, holding additional books and a tablet. A chair is also present in the room, positioned close to the bed. The entire scene exudes a lived-in, cozy atmosphere typical of someone who spends time reading and relaxing in bed."}
{"image_id": 494759, "caption": "The image depicts three people enjoying a windy day on the beach. They are standing together, with one person on the left side of the image, another person in the middle, and the third person on the right side. One of them is flying a multicolored kite high in the sky above them. \n\nThe kite can be seen occupying a large portion of the sky above the group of people, and its colorful design contrasts beautifully against the background. The beach setting provides a perfect environment for these individuals to enjoy outdoor activities such as flying kites."}
{"image_id": 5617, "caption": "The image depicts two cat pillows on a bed, each pillow shaped like a cat lying down comfortably. The first cat pillow is positioned towards the left side of the bed, while the second cat pillow is towards the right side. The cat pillows are placed next to each other, creating an adorable scene. \n\nIn addition to the two cat pillows, there are three pillows situated at different positions on the bed, one near the center of the bed and two others towards the right side. Additionally, there are two remote controls placed on the bed, one towards the left side and another towards the right side of the bed."}
{"image_id": 279774, "caption": "In this image, there are several children playing baseball on a field. One young boy is swinging a bat towards home plate, attempting to hit a ball during the game. Another boy is also swinging a bat, waiting for his turn to hit the ball.\n\nThere are other children scattered around the field, some wearing baseball gloves, ready to catch the ball once it's hit. A few adults can also be seen on the field, likely coaches or spectators observing the children play.\n\nSome chairs are positioned around the field, likely for spectators or resting players to sit on during breaks in the game."}
{"image_id": 323442, "caption": "The image depicts two people seated at a table outdoors under umbrella shades, enjoying their meal together. They are smiling and appear to be having a good time. Various wine glasses are placed around the table, suggesting that they are drinking wine together.\n\nThere are numerous chairs around the table, some empty and others occupied by diners. Multiple wine bottles can be seen placed near the table, further emphasizing their wine-drinking experience. The table itself occupies most of the space in the scene, creating a cozy atmosphere for their meal together."}
{"image_id": 109454, "caption": "The image depicts a man wearing a blue tie and blue shirt, drinking from a green bottle. He is holding the bottle up to his mouth, engaging in a drinking motion. The bottle appears to be quite large, occupying a significant portion of the scene.\n\nIn the background, there are two other people present. One person is situated behind the man drinking from the bottle, while the other person is located on the right side of the scene. Additionally, there are two wine glasses visible in the background, one towards the right side of the scene and another towards the left side."}
{"image_id": 370677, "caption": "In this image, three women are smiling and posing together in front of a display case full of delicious donuts at a bakery. They appear to be employees of the establishment and are proudly showcasing their workplace's products.\n\nThere are several donuts visible in the background, arranged neatly on display shelves behind the women. Additionally, there are two clocks visible in the scene, one above the other, likely used to track time during bakery operations. The women are positioned close together, emphasizing their camaraderie and their connection to the delicious treats they are showcasing."}
{"image_id": 521509, "caption": "In this image, a woman wearing glasses is sitting on a bed, holding a camera in her hands. The bedroom environment features a bed occupying most of the space in the room. Various potted plants are scattered around the room, one near the bed, another near the wall, and another on the floor. \n\nThere are two vases placed in different parts of the room, one near the bed and another further away. Additionally, there are two books on the bed, one on the left side and another on the right side of the bed. A cup can also be seen placed near the bed, likely used for drinking while working or engaging in activities in the room."}
{"image_id": 236461, "caption": "The image depicts a surfer riding a wave in the ocean, skillfully balancing on their surfboard as they surf through the waves. The surfer appears to be at the peak of their ride, showcasing their expertise in surfing. The wave itself is relatively small, but it still adds excitement and challenge to the surfer's performance."}
{"image_id": 534845, "caption": "The image features a teddy bear suspended from a balcony or window ledge, creating an interesting scene. The teddy bear is hung on a clothesline next to clothes, possibly drying them. The clothesline is stretched across the entire width of the balcony or window ledge, showcasing various clothes hung out for drying.\n\nIn addition to the teddy bear and clothesline, there are two clocks visible in the scene, one located on the left side and another on the right side of the balcony or window ledge. These clocks add more detail to the scene, showing that time management may be important to the people living there."}
{"image_id": 180580, "caption": "The image features a plate full of various vegetables placed on a tablecloth-covered table. The plate contains broccoli, potatoes, and asparagus, all arranged neatly. There are several broccoli pieces scattered around the plate, some placed closer to the center while others are positioned towards the edges of the plate. Potatoes can be found both near the center and along the edges of the plate, making them the main accompaniment to the broccoli and asparagus."}
{"image_id": 484551, "caption": "The image features a woman wearing an orange sweatshirt and hat, smiling and posing on a boat. She is seated on a boat bench near the center of the boat, facing forward. The woman appears to be enjoying her time on the boat, possibly fishing or participating in a leisurely activity on the water.\n\nThere are two other people visible in the background, one on the left side of the boat and another person on the right side. These individuals seem to be either passengers or fellow fishermen accompanying the woman on her boat ride."}
{"image_id": 456146, "caption": "The image depicts a group of sheep walking along a roadway, likely in the countryside. There are multiple sheep visible in the scene, some standing close together while others are spread out along the road. They appear to be grazing or simply enjoying their surroundings as they walk together. The scene captures the serene nature of rural life, with these animals roaming freely through the countryside."}
{"image_id": 283131, "caption": "The image depicts a bathroom with a white sink and a white toilet positioned next to each other. Both fixtures have been removed from their respective countertops or cabinetry, leaving them exposed. A bathtub can be seen occupying most of the space in the bathroom, suggesting that it is currently empty.\n\nTwo grocery bags are placed on top of each other near the sink, possibly containing items needed for cleaning or other tasks in the bathroom. In addition to these items, there are two bottles placed close to each other near the bottom right corner of the image."}
{"image_id": 23309, "caption": "The image features a delicious pasta salad made with pasta noodles and various other ingredients. The pasta salad contains broccoli florets scattered throughout the dish, creating a colorful and healthy appearance. Some broccoli florets are located towards the center of the salad while others are placed towards the edges of the plate. \n\nIn addition to broccoli, there are multiple pieces of carrot throughout the salad. These carrot pieces are arranged in various sizes and positioned throughout the plate. The combination of pasta noodles, broccoli, and carrot create a delicious and nutritious pasta salad."}
{"image_id": 547487, "caption": "The image captures a young boy jumping high into the air while riding a skateboard, performing a trick. Another skateboard can be seen lying on the ground nearby. Several other people are present in the scene, some standing and others sitting on benches. They appear to be spectators watching the boy perform his trick or simply enjoying their time at the skateboarding area. \n\nThere are benches placed around the area, one near the center of the scene and another towards the right side. The boy's action draws attention, as the viewers observe him skillfully navigating his skateboard mid-air."}
{"image_id": 34830, "caption": "The image depicts a bathroom scene with a urinal wallpapered with red tiles. The urinal itself is white, and it appears to be mounted on the wall above a urinal cake. The urinal is positioned against a wallpapered wall with red tiles, adding a touch of color to the bathroom setting."}
{"image_id": 125997, "caption": "The image depicts a wall adorned with blue graffiti artwork that reads \"UAREAL alive.\" It is likely located near a street corner, given the presence of a signpost visible in the background. The graffiti itself occupies most of the wall space, creating an eye-catching and unique display."}
{"image_id": 19916, "caption": "The image features a table with a bowl containing apples and a fork next to it. Inside the bowl, there are apples and cinnamon scattered about. A laptop computer is also present on the table, occupying the left side of the table. The table itself appears to be made of wood and completes the scene."}
{"image_id": 145019, "caption": "In this scene, several people are gathered around a crashed plane in a field. One person appears to be watching the plane crash site while others are looking at something else. There are two main people in the image: one person standing in front of the crashed plane and another person behind them. \n\nA truck can be seen parked near the crashed plane, possibly used for transportation or recovery purposes. The crashed plane occupies most of the field, indicating a significant impact. The presence of multiple people around the crashed plane suggests that they might be witnesses or involved in the incident in some way."}
{"image_id": 127161, "caption": "The image shows a plate containing two pieces of cheese pizza on a table. The plate itself is square-shaped and placed on a tablecloth. Each piece of pizza appears to be a slice of cheese pizza with tomatoes. The plate is positioned towards the center of the table, likely ready to be eaten by someone. The tablecloth covers most of the table surface, providing a clean and elegant background for the plate of pizza."}
{"image_id": 543660, "caption": "The image depicts a bathroom with two toilets side by side. One toilet is positioned towards the left side of the room, while the other is located towards the right side. Both toilets are white and appear to be identical. \n\nThere is also a sink visible in the bathroom, situated in the upper left corner of the scene. Above the sink, there is a mirror to aid in daily grooming activities. Additionally, there is a clock mounted on the wall above the sink area."}
{"image_id": 8333, "caption": "The image depicts a red and white Virgin train traveling through a city landscape. The train is passing through a station that appears to be part of a train yard. Several other trains can be seen in various positions around the station, some further away than others.\n\nThe area around the station is quite busy with activity. Several buses can be seen parked or driving around the area, some closer to the train station while others are further away. Additionally, there are two trucks visible in the scene, one near the train station and another one further away from it."}
{"image_id": 482907, "caption": "The image features a gray World War II era plane flying through a blue sky. It appears to be a French plane with a number \"81\" on its tail. The plane is flying alone without any other aircraft visible in the sky. Its wings are spread out wide as it soars through the sky. The scene captures the plane's impressive size and its historical significance."}
{"image_id": 290130, "caption": "The image depicts a surfer riding a wave on his surfboard in the ocean. The surfer is skillfully navigating the waves and maintaining balance on his surfboard as he rides the waves towards the shore. There are several other surfers visible in the background, scattered throughout the scene, some of them riding waves while others are waiting for their turn or simply observing the others. The scene captures the excitement and thrill of surfing."}
{"image_id": 58225, "caption": "The image depicts a person holding up a hot dog in their hand at a baseball stadium. The hot dog is placed inside a bun and appears to be fully loaded with condiments. The person holding the hot dog is standing near the stadium seats, likely enjoying the game and their snack.\n\nThere are other people present in the stadium as well, scattered around the stadium seats. Some are close to the person holding the hot dog, while others are farther away, perhaps watching the game or socializing with others."}
{"image_id": 249550, "caption": "The image depicts a bedroom scene with a bed taking up most of the space, occupying the left side of the room. Next to the bed, there is a table with a plant placed on it. A chair can be seen in the room as well, positioned near the bed, adding to the furniture arrangement. \n\nThe bedroom is decorated with a floral bedspread, adding a touch of color to the room. This bedroom appears to be well-organized and comfortable, ready for someone to relax and enjoy their time there."}
{"image_id": 448765, "caption": "The image depicts a bathroom with white fixtures, including a white toilet positioned next to a white sink. Both fixtures are clean and well-maintained. There is also a brown box placed next to the toilet. The bathroom appears to be in a hotel setting, as evidenced by its cleanliness and minimalistic design."}
{"image_id": 498439, "caption": "The image features a baseball field where a baseball player wearing number three is standing on the field, likely preparing for his turn at bat or ready to catch a ball. There are other players scattered around the field, some closer to the player at number three while others are further away. In total, there are thirteen players visible on the field, including the player in number three.\n\nAdditionally, there are three baseball gloves visible on the field, one near the player at number three, one a little further away, and another glove positioned towards the right side of the field."}
{"image_id": 252403, "caption": "The image features a woman with long hair holding a blue Colgate electric toothbrush up against her mouth. She appears to be posing for a picture with the toothbrush held prominently in her hand. Her hair cascades down her shoulders, adding a sense of elegance to the scene. The woman appears to be smiling, possibly enjoying the moment or the dental care product she is holding."}
{"image_id": 347995, "caption": "The image depicts a woman laying in bed with two children, one baby and one toddler. The woman appears to be smiling as she enjoys her time with her children. Next to her, there is a black dog lying down on the bed as well, sharing the moment with her. \n\nA bottle can be seen on the bed near the woman, probably for feeding one of her children. In addition to the bed, there are several books scattered around the room, possibly books for bedtime reading or for the children. A clock can also be seen on the wall above the bed."}
{"image_id": 544216, "caption": "The image depicts a table with a plate filled with various food items. The main focus of the plate is a sandwich made with bread and bacon, accompanied by chips. There are two sandwiches visible on the plate, one occupying most of the space and another smaller sandwich placed next to it. Additionally, there are two cups on the table, one near the center and another towards the right side of the table. A bowl can also be seen towards the right side of the table."}
{"image_id": 205729, "caption": "The image depicts a group of skiers climbing a snowy mountain slope. There are five skiers visible in the scene, each wearing ski equipment and skiing uphill. They are skiing single file and appear to be heading towards the top of the mountain or a skiing area.\n\nSeveral skiers are carrying backpacks on their backs, likely containing essentials for their skiing adventure. Two backpacks can be seen clearly visible near the middle of the group, while another one is visible further back on the left side of the group. The skiers are using ski poles to help them navigate through the snowy terrain."}
{"image_id": 350988, "caption": "The image depicts a multi-level wooden auditorium with several benches placed in rows. Each row of benches has a sign placed above them, instructing people not to sit there. The signage indicates that these particular seats are reserved or reserved for specific purposes, such as VIP seats or for certain events.\n\nThere are benches placed at different levels of the auditorium, including ones on the lower level, middle level, and upper level. Overall, there are nine benches visible in the image, each with a sign warning against use."}
{"image_id": 288673, "caption": "The image depicts a group of people enjoying their time at a beach with palm trees in the background. They are flying a colorful kite high above them, taking advantage of the windy conditions. There are at least six people visible in the scene, spread out along the beach to keep an eye on their kite's progress.\n\nThe beach itself seems sandy and appears to be a popular spot for activities such as flying kites. The kite can be seen soaring above the people, filling the sky with its vibrant colors."}
{"image_id": 568690, "caption": "The image depicts a cat sitting on top of an open white toilet seat, likely on top of a bathroom sink as well. The cat appears to be quite comfortable in this position and gazes into the camera. The bathroom features a blue wall and a blue countertop that the cat is sitting on. There are also some flowers on the wall, adding a touch of color to the scene."}
{"image_id": 504194, "caption": "The image features a dog sitting on a bench next to a flower bed. The dog is positioned on the bench's left side, occupying most of the bench space. \n\nThere are several bicycles parked around the bench area, some nearby and others further away. Additionally, there are two bicycles parked on the left side of the image, one in the background and another one close to the bench.\n\nThe presence of these bicycles suggests that this scene might be located near a bike path or bike rental service where people can rent bicycles for leisure or exercise purposes."}
{"image_id": 35368, "caption": "The image depicts a tabletop scene with various fruit items arranged on it. Among these items are bananas, lemons, and a bowl containing bananas and other fruit. There are also a few bananas placed on top of each other, some bananas in a bowl, and others scattered around the tabletop. \n\nA yellow pitcher is located near the center of the tabletop, adding color to the scene. There are two cups placed on the tabletop as well. One cup is positioned towards the left side of the tabletop, while the other cup is on the right side. Additionally, there is a bowl towards the right side of the tabletop, further adding to the variety of fruit items present in this scene."}
{"image_id": 307332, "caption": "The image depicts three people sitting on a bench near a lake, enjoying their time together. They are accompanied by their dog, which is positioned to their right side. The dog appears to be standing guard or simply accompanying them during their time by the lake.\n\nEach person is seated on the bench, with one person occupying the left side, another person occupying the middle section, and the third person occupying the right side of the bench. They appear to be enjoying their time together outdoors, watching over their dog as they sit by the lake."}
{"image_id": 490878, "caption": "The image depicts a man skiing alone on a snowy mountain slope, likely on a ski slope. He is wearing skis and skiing downhill, surrounded by snowy terrain. The man appears to be enjoying the skiing experience as he skiers down the slope. The snowy conditions create a serene atmosphere for skiing enthusiasts like him."}
{"image_id": 507187, "caption": "The image depicts a group of people gathered around two motorcycles parked on a grassy field. The first motorcycle is positioned towards the left side of the scene, while the second motorcycle is located towards the right side. Both motorcycles appear to be old-style motorcycles, attracting attention from the crowd.\n\nThere are several people standing around the motorcycles, observing them closely. Some people are standing near the first motorcycle, while others are gathered around the second motorcycle. A few people are also standing closer to the right side of the scene. \n\nThere are two handbags visible in the scene – one is placed near the center-left area of the scene, while the other is located near the center-right area. Additionally, there are two bottles present in the scene, one near the center-left and the other near the center-right."}
{"image_id": 254644, "caption": "The image depicts a clean and well-organized kitchen with wooden cabinets and countertops. On the countertops, there are multiple cups, spoons, and bowls arranged neatly. A coffee maker and a microwave are also present in the kitchen area.\n\nIn addition to these items, there are several bottles scattered around the countertops, possibly containing various ingredients or beverages. A sink can be seen towards the right side of the kitchen, completing the functional space."}
{"image_id": 400803, "caption": "The image depicts a large orange boat floating on top of blue water. The boat seems to be a rescue boat or a boat with people aboard. There are three people visible on the boat, one person standing near the middle of the boat and two others towards the rear. They appear to be enjoying their time aboard the boat as it cruises through the blue waters."}
{"image_id": 574928, "caption": "The image depicts a large herd of sheep grazing in a grassy field. There are sheep spread out across the field, some closer to the camera while others are further away. The sheep are spread out in groups, enjoying their time grazing on the grassy field. The scene captures the essence of rural life and the animals' natural environment."}
{"image_id": 559247, "caption": "The image depicts a group of people gathered around a table filled with various sandwiches. They are in line, waiting for their turn to pick up their sandwiches and enjoy them. Among the sandwiches, there are also some hot dogs available at the table. \n\nThere are several people visible in the scene, some closer to the table while others stand further away. They are all actively involved in the process of picking up their sandwiches or waiting their turn. The table itself occupies most of the space in the scene, with sandwiches placed on it and the people around it."}
{"image_id": 254625, "caption": "The image depicts a baseball player swinging his bat in a batting practice session. He is wearing a hat and a baseball uniform while swinging the bat towards a baseball in mid-air. The player appears to be concentrating on his technique as he prepares to hit the ball.\n\nIn addition to the main player, there are other people visible in the background, likely fellow players or coaches observing the practice session. The scene captures the intensity and focus required during such practice sessions to refine skills and improve performance."}
{"image_id": 374966, "caption": "The image depicts a group of young skateboarders practicing their skills at a skateboarding park. There are several boys on skateboards scattered around the park, performing various tricks and maneuvers. Some skateboarders are stationary while others are moving around the park.\n\nThere are also several other people present in the background who might be spectators or other skateboarders, watching the action unfold.\n\nThe scene captures the spirit of youthfulness and camaraderie as these young skateboarders hone their skills together in the park."}
{"image_id": 351967, "caption": "The scene features a yellow taxi cab speeding past a building at night, with its lights illuminating the scene. The building's front is adorned with a large clock prominently positioned above a sign reading \"Tourneau.\" The clock appears to be lit up by lights inside the building, creating a striking contrast against the darkness of the night. \n\nThere are also several other smaller clocks visible on the building's facade, further emphasizing its importance as a clock-related establishment. A person can be seen walking past the building, completing the urban nighttime atmosphere of the scene."}
{"image_id": 172877, "caption": "The image depicts a man wearing glasses sitting on a chair in a room. He appears to be relaxed and casually dressed in a shirt and tie. The chair he is sitting on occupies most of the scene.\n\nThere are two other chairs visible in the room, one positioned behind him and another on the left side of the room. A clock can be seen on the wall above the man's head, while another clock is visible on the wall on the right side of the room. Additionally, there are two ties visible in the scene - one tied around the man's neck and another one placed nearby."}
{"image_id": 309237, "caption": "In the image, there is a cat lying down on a chair, occupying most of its surface area. The cat appears to be black and white and appears to be sleeping or resting on the chair. The chair itself has a patterned blue fabric and a remote control placed on it, likely indicating that the chair is part of a living room setting."}
{"image_id": 565877, "caption": "A woman wearing glasses and a hat is sitting on a red couch, smiling and posing for the camera. She is holding a laptop computer in her lap. The couch occupies most of the scene and is positioned against the wall. There are two clocks visible in the background, one located near the middle-left side of the wall and another towards the right side of the wall. The woman's smile and pose create a friendly atmosphere in the image."}
{"image_id": 489924, "caption": "The image depicts a woman riding a skateboard down a street or sidewalk. She appears to be enjoying herself as she rides through the scene. She is wearing short shorts and a blue shirt, making her look casually stylish while skateboarding. There is another person visible in the background, but they are not the main focus of the scene.\n\nThe street itself appears to be empty of traffic, giving the woman ample space to skateboard without worrying about any accidents or interference from other vehicles or pedestrians."}
{"image_id": 125472, "caption": "The image captures a young boy skillfully performing a trick on his skateboard, jumping high into the air above it. The boy's arms are spread out, showcasing his control and balance during the trick. He is wearing jeans and a green shirt while executing this impressive feat."}
{"image_id": 422706, "caption": "The image depicts a boat floating in blue ocean waters, likely near a cruise ship deck. The boat appears to be a ferry boat or a small boat carrying passengers. People can be seen on the deck of the cruise ship, watching the boat pass by.\n\nThere are multiple people visible on the deck, some closer to the edge while others are positioned more towards the center of the scene. They appear to be enjoying their time aboard the cruise ship as they observe the passing ferry boat or small boat below them."}
{"image_id": 290700, "caption": "The image depicts a surfer riding a wave on his surfboard in the ocean. He is skillfully maneuvering through the waves, showcasing his talent. The surfer is wearing a white shirt, and his surfboard is visible below him as he rides the wave. The scene captures the essence of surfing as an exciting sport, highlighting the surfer's ability to control his surfboard amidst the waves."}
{"image_id": 365177, "caption": "The image features a bus parked on a street next to a building, likely loading or waiting for passengers. The bus occupies most of the scene, extending from the left side to almost the right side of the image. It appears to be a large bus, possibly a tour bus or a bus from a company such as Budget or First Bus.\n\nThere are several people visible near the bus, with one person standing close to it on the left side, another person slightly further away on the right side, and another person closer to the building."}
{"image_id": 398661, "caption": "The image depicts a kitchen with a black countertop and white walls. A microwave is placed on top of the countertop, occupying a significant portion of the space. Next to the microwave, there are two bowls placed on the countertop. \n\nThe kitchen also features an array of utensils, including knives and spoons, displayed on a wall pegboard or cabinet. There are multiple knives placed vertically at different heights and positions on the wall. Additionally, several spoons are hung horizontally and positioned at various heights and angles on the same wall pegboard or cabinet."}
{"image_id": 175611, "caption": "The image depicts a person skillfully cutting a piece of cigar using a pair of red scissors. They are cutting the cigar lengthwise, with precision and care. The person is positioned on the left side of the scene, while the cutting process takes place on the right side.\n\nThere are several books scattered around the scene, some close to the person cutting the cigar and others placed farther away. The presence of these books suggests that this might be an environment where cigars are being manufactured or displayed."}
{"image_id": 477673, "caption": "The image features a small cat lying inside a bag. The cat is curled up on top of a bag that resembles a backpack or suitcase, occupying most of the space inside it. Its positioning suggests that it feels comfortable and secure inside the bag."}
{"image_id": 1270, "caption": "The image depicts a baseball game taking place at a stadium. There are several children playing baseball on the field, including a boy who is up at bat with his bat ready to hit the ball. Other players are positioned around the field, ready to catch or field the ball as needed.\n\nThere are spectators seated in the stadium seats watching the game unfold, including some in the background and others closer to the action. A bottle can be seen placed near one of the spectators, possibly containing a drink to quench their thirst during the game."}
{"image_id": 224012, "caption": "The image features a plate full of delicious food items including ham, broccoli, potatoes, and mushrooms. There are several broccoli florets scattered across the plate, some positioned near the center and others towards the edges of the plate. Alongside these vegetables, there are potatoes placed in various positions on the plate, some closer to the edge and others toward the center. The ham is cut into pieces and placed in between the vegetables, completing a colorful and balanced meal."}
{"image_id": 552510, "caption": "The image depicts a group of children playing soccer on a grass field. There are ten children visible in total, some standing closer to the camera while others are spread out across the field. \n\nTwo children are actively engaged in the game, one kicking a yellow ball while another child is guarding him. The other children are dispersed around the field, some closer to the ball while others are further away, ready to react to the action or waiting for their turn to play."}
{"image_id": 272880, "caption": "The image depicts a person placing their hand over a piece of pizza on a plate placed on a wooden table. The pizza is cut into pieces, and there are other pieces scattered around the plate. A fork and a knife are also present on the table, ready to be used for enjoying the delicious meal.\n\nThe table itself occupies most of the background of the image, and there are two cups visible on the table, one near the left edge and another towards the top left corner. Additionally, there are two spoons placed on the table: one near the bottom right corner and another towards the top right corner of the table."}
{"image_id": 580540, "caption": "The image depicts a black dog sitting on a wood floor in front of a television. The dog is positioned to the right side of the screen, seemingly mesmerized by what's happening on the TV. The television occupies most of the scene, covering a large portion of the background from left to right.\n\nThere are several remote controls scattered around the scene, hinting at the dog owner's love for television. Additionally, there are two books placed on a surface near the left side of the television, likely serving as reading material for the owner when they're not watching TV."}
{"image_id": 242934, "caption": "The image depicts a cozy living room furnished with black leather furniture. There are two black leather couches positioned opposite each other in the room, one occupying most of the space while the other one occupies a smaller portion of it. Two black coffee tables are present in the room, one placed between the two couches and another one located towards the right side of the room.\n\nIn addition to the furniture, there are several books scattered around the room, some placed on shelves while others are placed on surfaces or stacked on top of each other. A clock hangs on the wall above one of the couches, adding to the room's decorative elements.\n\nTwo people can be seen in the room, one standing near the left side of the room and another one towards the right side. They appear to be admiring the room's furniture or possibly preparing to use it."}
{"image_id": 178807, "caption": "The image depicts two boys skateboarding side by side on a concrete surface. Both boys are wearing jeans, one slightly above the other, and they each have their own skateboard. They appear to be having fun together as they skateboard down the path.\n\nThere are also two other skateboards visible in the image, one slightly off to the side and another further away from the boys. Additionally, there is a car parked in the background on the left side of the scene."}
{"image_id": 135748, "caption": "In the image, there is a small brown dog laying down on a bed next to a blue blanket. The dog appears to be sleeping or resting peacefully. Beside the bed, there is an orange juice bottle, which may indicate that the owner was drinking juice while spending time with their pet.\n\nAdditionally, there are several other bottles scattered around the room, some on the floor and others on surfaces. A chair can also be seen in the background, near the right side of the room."}
{"image_id": 255036, "caption": "The image depicts a busy intersection with traffic flowing past a blue building. There are several cars parked along the sides of the road, with some situated closer to the building. Multiple traffic lights can be seen throughout the scene, controlling the flow of traffic.\n\nIn addition to cars, there are two buses present, one towards the center of the intersection and another towards the right side of the scene. Two pedestrians can also be seen in the area, one near the center of the intersection and another towards the right side. The scene captures a typical busy urban intersection during daytime."}
{"image_id": 3926, "caption": "The image depicts two sheep standing in a snowy field with snow covering their bodies. The first sheep is positioned towards the left side of the field, occupying most of the frame, while the second sheep is located towards the right side of the field.\n\nIn addition to the two main sheep, there are several other smaller sheep scattered throughout the field. They are spread out across the snowy landscape, some closer to the first two sheep while others are further away."}
{"image_id": 236762, "caption": "The image depicts a group of people gathered around a large dining table in what appears to be a restaurant or a dining hall. They are enjoying a meal together, smiling, and socializing with each other. The table is filled with various food items such as pizza, bowls, and cups, along with utensils like knives and spoons.\n\nThere are several bottles placed around the table, likely containing drinks for the guests. The table also contains numerous chairs surrounding it, some of which are empty while others are occupied by people. Among the diners, one person can be seen using a cell phone, possibly capturing memories or communicating with others outside the room."}
{"image_id": 248314, "caption": "The image depicts a tabletop filled with various items, including a laptop computer and a mouse. Next to the laptop, there are two bowls containing different types of food, one containing rice and another containing vegetables. In addition to these bowls, there are two bottles placed on the table, one towards the top left corner and another towards the top right corner.\n\nA chair can be seen positioned against the table, ready for someone to sit down and work or eat their meal. A keyboard is also present on the table, likely used in conjunction with the laptop computer."}
{"image_id": 559773, "caption": "The image depicts a ski jumping competition where a skiier wearing yellow boots is seen soaring through the air after jumping off a hill. The skiier is skillfully skiing downhill on skis, demonstrating their skill and control over their movements.\n\nThere are several other skiers present in the background, likely spectators or fellow competitors, scattered around the scene. Some are positioned near the ski jumping area while others are spread out across the scene. The overall atmosphere of the scene is energetic and full of action as skiers showcase their skills and athleticism."}
{"image_id": 340665, "caption": "The image depicts a woman standing on the street under a large umbrella, likely rainbow colored, shielding herself from the rain. She is holding a smaller umbrella in her hand as well. The woman appears to be wearing glasses and is dressed casually, giving off a hipster vibe.\n\nThere are other people in the background who are also using umbrellas to protect themselves from the rain. In total, there are four umbrellas visible in the scene, one of which is larger than the others, covering most of the woman in the center of the image. Additionally, there are two handbags visible in the scene, one held by the woman with glasses and another one placed nearby."}
{"image_id": 388599, "caption": "In this image, a dog is playing fetch with a frisbee in an open grassy field. The dog is holding the frisbee in its mouth, and its owner is getting ready to throw it again for the dog to catch. There are two people visible in the scene: one person is standing close to the dog, ready to throw the frisbee, while another person is standing behind them both, perhaps waiting for their turn or observing the game."}
{"image_id": 163528, "caption": "The image features a delicious pizza with various toppings such as lettuce, tomatoes, bacon, and cheese. There are two slices of pizza visible on the plate, one occupying most of the space, while the other occupies a smaller portion. A fork is placed near the pizza, ready to be used for eating. The plate itself occupies most of the frame, showcasing the deliciousness of the pizza."}
{"image_id": 481212, "caption": "The image depicts a man sitting on a red couch with two dogs resting on him. One dog is positioned on his lap, while the other dog is lying next to him on the couch. The man appears to be enjoying his time with his pets, drinking coffee from a cup placed on his lap. \n\nThere is also a remote control placed near the man on the couch, likely used for controlling electronic devices such as a television or a media player. The scene suggests a cozy, relaxed atmosphere where the man spends time with his dogs."}
{"image_id": 277533, "caption": "A man wearing jeans and a jacket is sitting on a red couch while holding a game controller. He appears to be engaged in playing video games, possibly on a Nintendo Wii console, given the controller he's holding. The man seems to be smiling as he enjoys his gaming session.\n\nThe room also contains several books scattered around the area, likely indicating an interest in reading or a collection of books. There are also two cell phones present in the scene, one near the man and another slightly further away from him, possibly belonging to other family members or friends."}
{"image_id": 173383, "caption": "The image depicts a wedding celebration with a beautifully decorated white wedding cake prominently displayed on a table. The cake is adorned with flowers and blue ribbon, making it look festive and elegant. Surrounding the cake are candles, further adding to the festive atmosphere of the event.\n\nThere are several other items on the table, including a book placed towards the right side of the table, a fork towards the left side, and two knives positioned at different locations on the table. The table itself occupies most of the space in the image."}
{"image_id": 419624, "caption": "The image depicts a train traveling along tracks through a park or countryside setting, possibly in Europe. The train has several compartments and is traveling past trees and a forest. There are multiple train compartments visible, including one towards the left side of the train, another in the middle, and another towards the right side of the train.\n\nThe train is surrounded by greenery, creating a serene atmosphere as it travels through the countryside. In addition to the main train compartments, there are several smaller train compartments scattered along the tracks, further emphasizing the train's length and complexity."}
{"image_id": 130291, "caption": "The image depicts a man and woman adjusting each other's ties, possibly preparing for a formal event or simply dressing up for a special occasion. The man is wearing a suit jacket and tie, while the woman is adjusting his tie. They both seem to be paying attention to detail as they adjust each other's tie knots.\n\nAdditionally, there are two other people visible in the background, one located on the left side of the scene and another person towards the right side. A cell phone can be seen placed on a surface near the bottom right corner of the image, possibly indicating that they were taking a break from their activity or capturing the moment."}
{"image_id": 193369, "caption": "The image depicts a bench made of metal wire, placed outside on a rock pathway. It is positioned next to grassy areas with plants growing around it. The bench seems rusty due to its age and exposure to weather conditions. The bench occupies most of the scene, with its woven structure prominently visible against the background."}
{"image_id": 367804, "caption": "The image depicts a little girl on a sandy beach enjoying herself as she flies a blue kite high in the sky. She is holding onto the strings of the kite with determination. Several other people can be seen scattered around the beach, some standing closer to the girl while others are further away. There are also several umbrellas dispersed throughout the scene, providing shade for beachgoers."}
{"image_id": 84735, "caption": "The image captures a moment during a baseball game where a player is swinging his bat over home plate. Several other players can be seen scattered around the field, ready to react to the outcome of the swing. There are also spectators watching from the stands, their attention focused on the action unfolding on the field.\n\nIn total, there are around fifteen people visible in the scene, including players and spectators. They are spread out across the field and stands, some closer to the action while others are situated further away. The player swinging the bat is positioned towards the center of the scene, drawing attention and interest from both players and spectators alike."}
{"image_id": 247285, "caption": "The image features a man and a woman standing together under an umbrella, holding their child close to them. They appear to be protecting their child from rain or sunlight. The umbrella spans across most of the scene, covering them all.\n\nThe woman is holding the child close to her chest, while the man is holding onto the umbrella handle. Both the woman and man seem to be engaged in conversation or simply enjoying their time together under the umbrella."}
{"image_id": 438432, "caption": "The image is an old black and white photograph of a cricket team posing together outdoors. There are thirteen girls in total, all wearing uniforms and white dresses, forming a large group as they pose for the picture. Each girl is positioned next to each other, creating a sense of unity and camaraderie within the team.\n\nThe girls are holding a baseball bat in their hands, showcasing their equipment and sportsmanship. Some girls are also wearing ties as part of their uniforms, further emphasizing their uniformity as a team. Overall, the picture captures a moment of team spirit and camaraderie among these young girls who are part of the cricket team."}
{"image_id": 185479, "caption": "The image depicts a man sitting on the floor next to his laptop computer. He appears to be wearing glasses and is in a position where he can easily access his laptop while sitting down. The laptop is placed close to him, occupying a large portion of his lap area.\n\nThe man seems to be focused on his work or leisure activities on the laptop, which may include browsing the internet or working on a project. His positioning on the floor indicates that he might be working in a casual environment or perhaps even taking a break from work."}
{"image_id": 570826, "caption": "The image depicts a blue and yellow train parked next to a building, likely a station or an industrial facility. The train appears to be a bus-like structure, as it is parked next to another bus. The buses are parked next to each other on tracks.\n\nThere are several people around the train, some of them standing near the buses while others are further away from them. A total of five people can be seen in various positions around the train and buses. Additionally, there are two motorcycles parked near the train and buses, one on the left side and another on the right side of the scene."}
{"image_id": 127394, "caption": "The image depicts a group of people gathered around a dining table filled with delicious food, including several different types of pizza and salads. There are at least five people visible in the scene, some seated while others stand around the table. \n\nVarious utensils such as knives and spoons are present on the table, ready for use during the meal. Additionally, there are multiple cups placed around the table, likely holding drinks for the guests. \n\nThe table itself is adorned with bowls containing salads and other food items, and some bottles are also present on the table, likely holding drinks for the diners. The scene is a cheerful gathering of friends or family members sharing a meal together in a warm and inviting atmosphere."}
{"image_id": 311081, "caption": "The image depicts a white bathtub with a white shower curtain installed in it. The curtain is located towards the middle of the bathtub, providing privacy for the shower area. Next to the bathtub is a toilet, which occupies most of the left side of the room. The overall scene is clean and well-organized, ready for use."}
{"image_id": 376677, "caption": "The image depicts a truck driving on a roadway underneath a bridge construction area. The truck is parked underneath the bridge construction area, likely transporting materials needed for the construction project. A construction worker can be seen walking near the construction site. \n\nThere are several other cars visible in the scene, one behind the truck, another one to its left, and another one to its right. Additionally, there are two traffic lights visible in the image, one located near the truck and another one further away on the left side of the scene."}
{"image_id": 269419, "caption": "The image features a tall clock tower with a clock face prominently visible on its side. The clock tower is made of bricks and stone, giving it a sturdy appearance. The clock itself is set against a background of trees, creating a contrast between the tower and the natural surroundings.\n\nThere are two clocks visible on the tower, one near the middle and another towards the bottom right side of the tower. The background trees are quite noticeable, with one tree near the left side of the tower and another tree towards the right side."}
{"image_id": 210708, "caption": "The image depicts two elephants swimming together in a river. An adult elephant can be seen swimming next to a smaller elephant, possibly a calf or young elephant. They both seem to be enjoying their time in the water, possibly cooling off or bathing themselves. \n\nThere is also another smaller elephant visible in the background, but it is not interacting with the main elephants in the water. Additionally, there are two birds present in the scene. One bird is flying above the elephants while another bird is flying above the smaller elephant in the background."}
{"image_id": 472246, "caption": "The image displays three different types of fruit arranged neatly on a white background. There are two apples positioned towards the left side of the image, one slightly above the other. On the right side of the image, there is an orange, standing tall next to the apples. The arrangement of these three fruit types creates a visually appealing scene."}
{"image_id": 187475, "caption": "The image depicts a person holding a large hot dog in their hands, ready to eat it. The hot dog is loaded with condiments such as mustard and relish, making it look delicious and appetizing. The person is likely preparing to enjoy their meal in the company of others who are also present in the scene. \n\nThere are two other people visible in the background, one on the left side of the image and another one further back on the right side. A table can also be seen in the background, likely where the people are seated while enjoying their meal together."}
{"image_id": 299457, "caption": "The image depicts a young Asian man with glasses eating a small piece of cake. He is seated in a chair, using his fork to hold the cake. A whiteboard is visible behind him, possibly indicating his workplace or study environment.\n\nIn addition to the main subject, there are two other people present in the scene, one on the left side and another on the right side of the frame. A chair can also be seen towards the right side of the scene. Interestingly, there is a cat present in the background, likely a pet or a decorative element of the room."}
{"image_id": 2894, "caption": "The image depicts a train station where a train is parked next to a platform. The train occupies most of the scene, occupying the left side of the image from top to bottom. The platform stretches from the middle of the scene to the right side of the image.\n\nThere are several people visible at the station. Three people can be seen near the train, while others are scattered along the platform. Additionally, two cars can be seen parked near the train station, one towards the middle of the scene and another towards the right side of the image."}
{"image_id": 209733, "caption": "The image depicts two men flying a purple kite together in a grassy field. The kite soars high above them as they enjoy their time outdoors. The field is part of a park setting with trees surrounding it. \n\nThere are several cars parked near the park, with one car positioned on the left side of the field, another car on the right side, and another car towards the back of the scene. The park also features two benches, one located towards the left side of the field and another bench towards the right side."}
{"image_id": 428231, "caption": "The image depicts a large living room with a white theme and wooden paneling. There are two white couches placed against the walls, one occupying most of the left side of the room and another smaller one situated towards the right side. A chair can also be seen near the right side of the room.\n\nThe room features a table with a bowl placed on it, likely for holding fruit or other objects. In addition to the table, there is another smaller table positioned towards the right side of the room. The room also contains multiple potted plants scattered around, one near the left side of the room, another near the right side, and a third one placed closer to the center of the room. A TV is located on the wall in the background, completing the living room setup."}
{"image_id": 250619, "caption": "The image depicts a woman lying on a beach blanket under an umbrella, enjoying a sunny day near the ocean. The umbrella provides shade for her as she relaxes on the beach. Several other umbrellas can be seen scattered around her area, indicating that this is a popular spot for beachgoers seeking respite from the sun.\n\nThe woman is lying down close to a bag, which is placed next to her on the beach blanket. Other items such as a handbag and a suitcase are also present in the scene. The handbag is located near the woman's feet, while the suitcase is positioned further away from her, towards the right side of the image."}
{"image_id": 434693, "caption": "The image features a white fire hydrant sitting on a street corner next to a pink building. The fire hydrant has a chain attached to it, likely for security purposes or to prevent unauthorized access. The street itself appears to be empty, with no cars visible in the scene.\n\nAdditionally, there are two potted plants visible in the background, one positioned near the left side of the scene and another towards the right side. These plants add some greenery to the otherwise urban setting."}
{"image_id": 15596, "caption": "The image captures two motorcycle racers racing down a track on a sunny day. Both motorcycles are racing side by side, as they race around the track. One motorcycle is positioned towards the left side of the track while the other motorcycle is towards the right side. \n\nThere are several other motorcycles visible around the track, likely belonging to other racers or spectators. The track itself appears to be made of grass, giving it a more informal feel than a typical race track."}
{"image_id": 569415, "caption": "The image features an elephant standing in a grassy field with grasses reaching up to its knees. The elephant appears to be walking through the grassy field, possibly searching for food or simply enjoying its surroundings. The elephant's trunk is visible in front of its body, indicating its curiosity or movement within the field."}
{"image_id": 305004, "caption": "The image depicts a young man surfing on a wave, riding a surfboard skillfully through the ocean waves. He is wearing swimming shorts while surfing, possibly with a patterned design. The surfboard itself is visible in the water, positioned beneath him as he rides it towards the shore.\n\nThe scene captures the surfer's dynamic movements as he navigates through the waves, showcasing his skill and athleticism in this sport."}
{"image_id": 510527, "caption": "The image depicts a man wearing a black tie, adjusting it with his hands while seated inside a car. The tie is checkered and has a pinkish color. The man appears to be adjusting his tie to look sharp for his next event or formal occasion.\n\nThe car itself occupies most of the background, stretching from left to right. There are also two other people visible in the background, one on the left side of the car and another person further back on the right side."}
{"image_id": 581317, "caption": "The image depicts a woman standing on top of a hillside or mountain, gazing downwards at her cell phone. She appears to be focused on something on her device, likely texting or browsing. \n\nThe woman is in a grassy field or grassy hillside, providing a scenic background for her phone usage. Trees can be seen around her, adding to the natural setting of the location. A handbag can also be seen near her, probably belonging to her."}
{"image_id": 532071, "caption": "The image depicts a brown bear cub resting in a grassy field near a tree. The bear cub appears to be sleeping or resting its head on the tree branch. The scene captures the bear cub in its natural habitat surrounded by green grass and trees."}
{"image_id": 467978, "caption": "In this image, a black and white dog is running through an open field alongside a herd of sheep. The dog appears to be chasing the sheep, possibly herding them together. There are nine sheep in total, spread out throughout the field. Some sheep are located closer to the dog while others are further away. The scene captures the dog's active engagement with the sheep as they move together through the field."}
{"image_id": 184972, "caption": "The scene depicts a group of people gathered around a table, smiling and enjoying themselves at what appears to be a social gathering or party. Among them, an older gentleman wearing glasses and a tie stands out, smiling and possibly giving a speech or engaging with others. The room contains several other people seated or standing around the table, making it a lively atmosphere.\n\nThere are multiple dining tables in the room, one of which is occupied by the group of people. The tables are adorned with various items such as cups, wine glasses, and books. The cups are placed near the center of each table, while wine glasses can be found scattered around the tables, indicating that drinks are being served during this gathering. Books are also present on one table, possibly signifying a shared interest or topic of discussion among the guests."}
{"image_id": 525568, "caption": "The image depicts two zebras standing together in a grassy field under a tree. One zebra is positioned slightly behind the other. Both zebras appear to be looking at something, possibly grazing or observing their surroundings. There are also two other zebras visible in the background, one behind the other, further away from the main pair."}
{"image_id": 165056, "caption": "The image features two giraffes standing next to each other in their habitat at a zoo. They are both close to trees, one on the left side and another on the right side of the frame. Both giraffes have their eyes open, gazing forward.\n\nThere is also a person present in the scene, positioned between the two giraffes. They appear to be watching the animals closely and possibly taking care of them or feeding them, given their location near the trees."}
{"image_id": 362240, "caption": "The image depicts a garage full of motorcycles parked next to each other. There are three motorcycles visible in the scene, one occupying most of the space in the garage, another smaller motorcycle towards the right side of the garage, and the third motorcycle towards the left side of the garage.\n\nIn addition to the motorcycles, there are two deer heads hung on the wall above them, one above each motorcycle. There is also a clock hanging on the wall above the motorcycles, and several books scattered around the garage, adding to the cluttered appearance of the space."}
{"image_id": 179558, "caption": "The image depicts two giraffes standing next to each other in an open field with grassy terrain. They appear to be interacting with each other and possibly feeding on tree branches. One giraffe is positioned more towards the left side of the image, while the other occupies the right side, both standing close together.\n\nThere are several tree branches visible in the scene, one placed horizontally across the middle of the image and another branch further down on the right side. These branches serve as a source of food for the giraffes as they graze together in their natural habitat."}
{"image_id": 120792, "caption": "The image depicts two men playing video games together in a room. They are both standing close to each other and using Nintendo Wii controllers as they play boxing on the screen. The television screen is positioned in the left side of the room.\n\nThe room also features a chair situated towards the center of the room, a bottle placed near the right edge of the room, and two remote controls close to each other in the middle of the room. Additionally, there are two cups placed near the right side of the room, one slightly higher than the other."}
{"image_id": 294865, "caption": "The image captures a train traveling along tracks with numerous passengers onboard. Some passengers are inside the train's windows, waving and waving their hands, while others are standing outside, waving too. The train itself occupies most of the scene, stretching from left to right across the image.\n\nThere are at least thirteen people visible in various positions inside and outside the train. Some passengers are near the front of the train, others are in the middle section, and others are close to the rear end of the train. The scene captures a moment of excitement as passengers wave goodbye or greet each other during their journey."}
{"image_id": 159662, "caption": "The image depicts a woman wearing a pink dress and hat, standing on a tennis court holding a tennis racquet. She appears to be focused on something, possibly preparing to play or practice tennis. The tennis court is filled with other people in various positions, likely spectators or fellow players.\n\nThere are several other tennis racquets visible in the scene, some held by other people on the court or placed near them. Additionally, there are several chairs scattered around the court, likely for spectators or players to sit on during breaks or between matches."}
{"image_id": 176906, "caption": "The image depicts a group of people standing around a fenced area filled with various animals, including sheep and goats. The people seem to be feeding and interacting with the animals. There are at least six sheep inside the fenced area, one of which is feeding from a bowl held by one of the people. \n\nAdditionally, there are two cars parked outside the fenced area, one positioned further away and another closer to the left side of the scene. Overall, the scene appears to be a casual gathering where people are enjoying the company of animals in a rural setting."}
{"image_id": 250608, "caption": "The image depicts a bus parked along a roadside, possibly waiting for passengers or simply parked temporarily. The bus occupies a large portion of the scene, extending from the left side to the right side of the image.\n\nSeveral cars are parked along the roadside as well, with one car positioned behind the bus on the left side, another car slightly behind and to the right of the bus, and another car parked further away on the right side of the scene. Additionally, there are two pedestrians visible, one standing near the bus on the left side and another person further away on the right side of the scene."}
{"image_id": 33561, "caption": "The image depicts a large herd of cattle grazing on a green field. There are at least thirteen cows spread across the field, some closer to the camera while others are farther away. The cows are spread out across the field, some closer together while others are more spread out. The scene captures the peacefulness of rural life as these animals graze in their natural habitat."}
{"image_id": 274612, "caption": "The scene features a row of bicycles parked outside a building, possibly a cafe or restaurant. Some of these bicycles are parked under umbrellas, providing protection from the sun or rain. There are three umbrellas visible in the scene: one on the left side of the row of bicycles, another on the right side, and the third umbrella positioned above the middle of the row.\n\nThere are also two people present in the scene. One person is located near the middle of the row of bicycles, while the other person is slightly further away from them, near the right side of the row."}
{"image_id": 288714, "caption": "The image depicts a delicious pizza covered in various ingredients, including olives and other vegetables. The pizza appears to be homemade and freshly cooked, with the ingredients scattered generously on top of it. The pizza occupies most of the frame, showcasing its deliciousness and enticing appearance."}
{"image_id": 284379, "caption": "The image depicts a young boy riding on a yellow surfboard in a pool. The boy appears to be enjoying himself as he glides through the water on his surfboard.\n\nThere are several other people present in the pool area, some swimming or floating. The pool itself seems to be quite large and accommodating multiple swimmers at once."}
{"image_id": 205247, "caption": "The image depicts a white bus parked on a street, advertising basketball games. The bus is parked next to a tree, with branches visible above it. There are several people around the bus, some standing close to it while others are further away. \n\nSome people are seen boarding the bus while others are exiting it. A person appears to be carrying a backpack, likely traveling with belongings for their journey. Overall, the scene captures the bus transporting people to a basketball game."}
{"image_id": 200267, "caption": "The image depicts a woman playing tennis on a court, focused on hitting a tennis ball with her racquet. There are several other people around her, watching her play the game. Some of them are standing close to her while others are farther away, observing her performance.\n\nThere are multiple tennis balls scattered around the court, indicating that this might be a practice session or practice match. One tennis ball can be seen close to the woman, another further away to her left, and others scattered around the court. Additionally, there are two chairs visible near the tennis court, one towards the left side and another towards the right side of the scene."}
{"image_id": 296775, "caption": "The image depicts a blue bus driving down a street on a wet roadway. The bus occupies most of the scene, occupying from left to right, and from top to bottom. There are no other vehicles visible on the street.\n\nIn addition to the bus, there are two people visible on the street. One person is located towards the right side of the scene, while the other person is positioned slightly left of center. A bicycle can also be seen parked on the left side of the scene, closer to the bottom edge of the image."}
{"image_id": 4265, "caption": "The image depicts a window with various plants placed on it, including a blue jar, a blue vase, and a blue pitcher filled with flowers. These plants are arranged beautifully, creating a visually pleasing display.\n\nThere are two plants visible in the window: one occupies most of the window space, while the other occupies a smaller portion towards the right side of the window. Alongside these plants, there are three bottles positioned on the window ledge, adding more details to the scene.\n\nThe window itself is located in a room, possibly a living room or a kitchen, where plants are placed to bring life and color to the space."}
{"image_id": 104392, "caption": "The image depicts a large kitchen with a countertop island and a microwave placed above it. The countertop island has a sink built into it, making it a functional and space-saving feature. There are several cabinets around the kitchen, providing ample storage space for kitchenware and other items. The countertop itself is marble, giving the kitchen a luxurious touch.\n\nA microwave can be seen above the countertop island, and another microwave is positioned above the countertop itself. The kitchen also features a refrigerator towards the right side of the scene, completing the picture of a well-equipped kitchen space."}
{"image_id": 316658, "caption": "The image depicts a tranquil scene by a lake where two ducks are swimming peacefully. There are two benches placed near the lake, one towards the left side and another towards the right side of the scene. A person can be seen sitting on one of the benches, observing the ducks swimming in the water.\n\nThe lake itself appears to be calm, providing a serene environment for both the ducks and the person enjoying their time by the water."}
{"image_id": 230993, "caption": "The image depicts two women walking together under umbrellas on a wet street. Both women are holding umbrellas to protect themselves from the rain, one umbrella being red and plaid while the other is gray. The women are both carrying handbags as they walk along the street.\n\nThe scene is set against a background of buildings, with one woman positioned slightly behind the other. Both women appear to be walking side by side, engaged in conversation or simply enjoying each other's company as they navigate through the wet conditions."}
{"image_id": 321035, "caption": "The image features a large white frosted birthday cake decorated with red icing and red and green frosting flowers, resembling cherries and berries. The cake is placed on a green tablecloth and is ready to be cut and enjoyed by guests at a birthday party. \n\nThere are two knives present in the scene, one positioned near the left side and another towards the right side of the cake. The knives are likely used for cutting the cake into pieces for serving."}
{"image_id": 571038, "caption": "The image depicts a woman smiling while holding a large pan full of delicious looking food in a kitchen setting. The pan is full of variously sized pieces of pizza, which seem to be homemade and delicious-looking. The woman appears to be proudly presenting her creation, possibly ready to serve it to others or enjoy it herself.\n\nThe kitchen itself contains several items such as a sink towards the right side of the scene, a knife placed on the left side, and two bottles one above the other near the center of the room. Additionally, there are two bowls placed on the countertops, one towards the left side and another towards the right side of the room."}
{"image_id": 395978, "caption": "The image depicts two men digging holes in the snowy ground at an airport runway. They appear to be digging holes for an airplane, possibly preparing for maintenance or inspection purposes. There are also two other people visible in the background, likely observing or assisting with the digging process.\n\nAdditionally, there are two airplanes visible in the background, one occupying most of the background on the left side of the image, and another smaller plane located towards the right side of the scene. These planes likely belong to the airport where the digging is taking place."}
{"image_id": 482917, "caption": "The image depicts a person laying down on a red couch with their feet propped up on another couch next to them. A black and white dog is sitting next to them, attentively watching television, which is positioned above them on the wall.\n\nThere are two remotes visible in the scene, one placed near the bottom right corner of the first couch, and another closer to the bottom left corner of the second couch. The dog appears to be a black and white bulldog."}
{"image_id": 207561, "caption": "The image depicts three surfers riding waves in the ocean on surfboards. They are spread out across the scene, with one surfer located on the left side, another surfer in the middle, and the third surfer on the right side of the image.\n\nTwo surfboards can be seen clearly; one surfboard is positioned near the middle surfer, while the other surfboard is visible near the left surfer. The third surfer has their surfboard hidden behind them, creating a dynamic scene of surfers riding waves together."}
{"image_id": 369470, "caption": "The image depicts a parking lot full of cars parked next to each other along a sidewalk. There are several parking meters along the sidewalk, with one meter prominently visible near the center of the image. The cars parked in this parking lot range from small cars to larger SUVs, occupying most of the space available. The parking lot is located near a building, possibly a business or a residence, given the presence of multiple cars parked outside."}
{"image_id": 482210, "caption": "The image depicts a small bathroom with white walls and a white toilet positioned underneath a white shelf. There is also a sink with a mirror above it, placed next to the toilet. The bathroom has a doorway and two windows above the sink.\n\nThere are several items on the shelf above the toilet, including two bottles and two cups. Additionally, there are two bottles placed near the sink area. A toilet brush can also be seen resting near the bottom right corner of the image."}
{"image_id": 525381, "caption": "The image depicts a baseball game in progress, with the main focus on the batter who is swinging his bat at the ball. Several other players are present on the field, including those positioned in various positions around the batter. Some players are closer to the batter while others are spread out across the field.\n\nThere are two baseball gloves visible in the scene, one near the batter and another on the right side of the field. Additionally, there are two bottles visible near the players, one near the middle of the field and another towards the right side of the field.\n\nSome players are wearing baseball gloves, ready to catch the ball once it's hit by the batter. Overall, the scene captures the action and excitement of a baseball game."}
{"image_id": 156375, "caption": "The image depicts a woman skiing on snowy terrain wearing skis and holding ski poles. She is smiling while skiing down a slope, enjoying the snowy conditions. \n\nThere are several other skiers visible in the background, skiing at different distances away from her. One ski pole can be seen close to her left side, and another ski pole can be seen further away on her right side."}
{"image_id": 334399, "caption": "In this scene, there are three people present: one man is standing next to a clock machine, another woman is behind him, and the third person is on the right side of the image. The clock machine resembles a clockwork mechanism, and it occupies most of the space on the table.\n\nThere are also several books scattered around the table, some of which are near the edge of the table. Additionally, there are two handbags present in the scene, one located near the right side of the table and another near the left side of the table. The overall setting appears to be a display or demonstration of clockwork machinery."}
{"image_id": 322955, "caption": "The image captures a beautiful sunset scene where a white bird, possibly a seagull or a white sea bird, is standing on a beach near the water's edge. The bird is prominently positioned in the center of the scene, adding a sense of serenity to the scene.\n\nThe beach itself is sandy and extends from the left edge of the image to the right edge. There are also several rocks scattered along the beach and waterline, adding texture and depth to the scene. The sunset background provides a warm and picturesque atmosphere, highlighting the beauty of nature and the bird on the beach."}
{"image_id": 312024, "caption": "The image depicts a bird perched on grass in a grassy field. The bird has blue wings and a black body, making it stand out against the grass background. Its wings are spread wide open, showcasing its wingspan. The bird appears to be the focal point of the scene as it stands tall against the grassy background."}
{"image_id": 118715, "caption": "The image depicts a fire hydrant positioned near a wall on a sidewalk. The hydrant is prominently visible, occupying a large portion of the scene. The wall behind the hydrant appears to be made of concrete or similar material, creating an urban setting."}
{"image_id": 237318, "caption": "The image depicts a stop sign located on a roadway surrounded by trees and bushes. The stop sign is positioned at a slight angle, making it difficult to read at first glance. In addition to the main stop sign, there are two other smaller signs behind it, one of which is also angled slightly. \n\nThere are fourteen trees visible in the background, some closer to the stop sign while others are further away. One tree is visible towards the left side of the scene, another tree is near the center, and four trees are situated on the right side of the scene. Overall, it appears to be a rural setting where the stop sign serves as a reminder for drivers to stop before proceeding further."}
{"image_id": 236865, "caption": "In this image, there is a little girl wearing a black dress standing outside near a tree. She is holding a red Frisbee in her hand, ready to play. The girl appears to be playing alone or waiting for others to join her in the game. There are other people visible in the background, but they are not actively engaged with the girl. The scene takes place outside a house, providing a pleasant environment for outdoor activities like playing Frisbee."}
{"image_id": 72096, "caption": "In this image, there is a woman sitting at a table with two white plates full of food, including berries and desserts. She appears to be enjoying her meal in a comfortable setting. There are various utensils such as knives, spoons, and forks laid out on the table alongside the plates.\n\nA cup can be seen placed on one side of the table, possibly containing juice or another drink. There are also two bowls on the table, one located towards the left side and another towards the right side. \n\nAdditionally, there are two chairs visible in the scene, one behind the woman and another on the right side of the table."}
{"image_id": 450762, "caption": "The image depicts a group of teddy bears dressed in uniforms, resembling soldiers, enjoying a boat ride together. They are seated on several rows of seats within the boat, each row accommodating two teddy bears. The teddy bears are positioned in various positions on the boat, some sitting side by side and others facing forward.\n\nThere are a total of nine teddy bears visible in the scene, each donning uniforms, including one teddy bear wearing a hat. The boat itself occupies most of the image, as it extends from left to right and across the entirety of the frame."}
{"image_id": 168974, "caption": "The image features a little girl sitting on the floor, holding a cell phone. She appears to be looking at something on the phone screen. The girl is wearing jeans and a sweater, making her look adorable as she plays with the device. There are two visible cell phones in the scene – one held by the girl and another one placed next to her on the floor."}
{"image_id": 559950, "caption": "In this image, a dog can be seen sticking its head out of the window of a car. The dog appears to be enjoying the ride as it gazes forward with its eyes wide open. The car itself occupies most of the scene, with other vehicles visible in the background, including another car and a truck.\n\nThere are two people present in the scene, one person is located towards the left side of the image, while the other person is closer to the middle. Both individuals appear to be walking or standing near the car, possibly admiring the dog or simply passing by."}
{"image_id": 575776, "caption": "The image depicts two animals in a desert setting: a zebra and a rhino. They appear to be walking past each other, potentially engaging in some sort of interaction or simply passing each other by.\n\nThe zebra is positioned on the left side of the image, while the rhino occupies the right side. Both animals seem to be walking in opposite directions and are situated in an open field in the desert."}
{"image_id": 552352, "caption": "The image features a slice of yellow cake served on a plate. It appears to be a dessert or dessert-like item, possibly cheesecake or custard pie. The slice of cake is placed on a fork, ready to be eaten. The fork itself is silver, and it rests on top of a table. The plate and fork together create a visual focus, emphasizing the deliciousness of the dessert being served."}
{"image_id": 490683, "caption": "The image depicts two people playing frisbee in a grassy field. One person is positioned more towards the left side of the field, while the other person is on the right side. Both are actively engaged in the game and are holding frisbees in their hands.\n\nThere is another frisbee visible in the middle of the field, likely waiting for its turn to be thrown or already in motion during play. The scene captures a fun outdoor activity between two people enjoying themselves in a grassy field."}
{"image_id": 76417, "caption": "In this image, a white dog is sticking its head out of a window of a truck. The dog appears to be enjoying the wind blowing through its hair as it gazes forward. The truck itself occupies most of the scene, extending from the left side to the right side of the image.\n\nThere are traffic lights visible in the background, one towards the left side of the image and another towards the right side. Additionally, there is a person present near the left side of the image, possibly the owner of the truck or another passerby."}
{"image_id": 231153, "caption": "The image captures an exciting moment where a snowboarder is performing a jump in mid-air above trees covered in snow. The snowboarder is suspended in the air, showcasing their skills and control over their snowboard.\n\nThere are trees visible in the background, adding to the wintery atmosphere of the scene. The snowboarder's snowboard can be seen clearly beneath them as they soar through the air. The snowboarder's body positioning and body control are evident as they continue their jumping maneuver."}
{"image_id": 190497, "caption": "The image depicts a herd of cattle grazing near a barn, which is the main focus of the scene. The cattle are spread out around the barn, some closer to it while others are situated further away. There are at least thirteen cows visible in various positions around the barn. Some cows are standing close together while others are spread out individually. The cattle are calmly grazing near the barn and appear to be content in their environment."}
{"image_id": 126065, "caption": "The image features a clock tower adorned with two bell statues on each side of it. The clock itself occupies a large portion of the tower, located towards the middle of the structure. The bell statues are positioned above each side of the clock tower, adding an element of charm to the overall design. These bell statues likely function as bell-ringers, marking time throughout the day."}
{"image_id": 375915, "caption": "The image depicts a homemade pizza sitting on top of a wooden table outside, ready to be eaten. The pizza has a variety of vegetables such as tomatoes, olives, and bell peppers spread across its surface. There are also several pieces of broccoli scattered around the table.\n\nIn addition to the pizza, there are two bottles on the table, one towards the left side and another towards the right side. A wine glass can be seen placed towards the right side of the table, ready to be used. Two knives are also present on the table, one towards the left side and another towards the right side, ready to cut the pizza into pieces. A chair can be seen behind the table, inviting someone to sit down and enjoy their meal."}
{"image_id": 95022, "caption": "The image features a bird perched on a tree branch, surrounded by leaves. The bird is positioned towards the center of the scene, occupying most of the space on the branch. Its position and size give it prominence as the main focus of the image."}
{"image_id": 177935, "caption": "The image features a white kitchen with a large silver oven positioned prominently in the center of the scene. Surrounding the oven are various utensils such as knives and spoons arranged neatly on countertops. There are several knives placed near the oven and others scattered around the kitchen. Spoons can also be found near the oven and on countertops.\n\nThe kitchen also contains two sinks situated on opposite sides of the oven. A clock hangs above the oven, ensuring that cooking time is never forgotten. Additionally, there is a bowl placed near one of the sinks."}
{"image_id": 380117, "caption": "The image features a table filled with various plants, including several potted plants placed on top of it. Among these plants, there is a cat sleeping peacefully on one of the potted plants, occupying most of its space.\n\nThe table itself occupies a large portion of the scene, and it appears to be the central focus of the image. A bowl can be seen placed near the table, possibly containing soil or other plant care essentials. The table's surface showcases the plants' variety and their arrangement, creating a serene and relaxed atmosphere."}
{"image_id": 132373, "caption": "The image depicts a clock tower prominently displayed inside a building, possibly a train station or a large building with a lobby. The clock tower is lit up by lights at night, making it stand out against the dark background.\n\nThere are two clocks visible in the tower: one clock is positioned towards the left side of the tower, while the other clock is positioned towards the right side. Both clocks are lit up by lights, illuminating their respective clock faces. The clock tower itself occupies most of the space in the image, giving it a prominent position within the building."}
{"image_id": 284282, "caption": "The image features a tabletop with two white appliances side by side: a blender and a food processor. Both appliances appear to be old, with one being a blender and the other a food processor. \n\nThe blender occupies most of the space on the tabletop, while the food processor has its own smaller size next to it. Both appliances seem to be functional, ready for use in preparing meals or blending ingredients."}
{"image_id": 276707, "caption": "The image depicts a sign prohibiting motorcycle parking outside of a storefront. The sign is positioned prominently near the storefront window, clearly visible to potential motorcycle parkers. \n\nThe storefront itself features several windows, one of which is displaying a picture of motorcycles, further reinforcing the ban on motorcycle parking outside the store. The ban on motorcycle parking is enforced by a sign placed outside the storefront window, ensuring that motorcycle owners comply with the rules and park their vehicles elsewhere."}
{"image_id": 194704, "caption": "In this image, a young girl wearing snow gear is proudly displaying her snowboarding equipment. She holds two snowboards up in her hands, one positioned above her head and the other below her waist, showcasing their size and design.\n\nThere are other people present in the scene as well. One person is standing behind the girl on her left side, another person is standing behind her right side, and another person is located to her left side as well. They all seem to be either observing or participating in snowboarding activities at this location."}
{"image_id": 430286, "caption": "The image depicts a bedroom scene where three remote controls are placed next to each other on top of a bed mattress. The bed itself occupies most of the space in the room.\n\nAdditionally, there are two remote controls placed farther away from each other on the bed mattress, making the total number of remote controls three. The bedroom seems to be a comfortable place where someone can rest or sleep."}
{"image_id": 361171, "caption": "The image captures a thrilling moment of a skateboarder soaring through the air after jumping off a ledge or platform. The skateboarder is fully visible mid-air, showing off their skills and athleticism. Their skateboard can be seen below them, flying through the air too, adding to the dynamic nature of the scene. The background consists of buildings, creating an urban setting for this exciting action shot."}
{"image_id": 406451, "caption": "The image depicts a horse pulling a carriage on a city street with traffic around them. The horse, located towards the center of the scene, appears to be a cute little horse pulling a carriage for passengers to ride in.\n\nThere are several cars parked along the street, including one on the left side of the scene, another on the right side, and another further back behind the horse and carriage. Additionally, there are two traffic lights visible in the background, one towards the left side of the scene and another towards the right side.\n\nTwo pedestrians can also be seen in the scene, one standing near the left side of the street and another further back on the right side."}
{"image_id": 57286, "caption": "The image captures an exciting moment where a young skateboarder is performing a trick on a skateboard ramp. The skateboarder is suspended mid-air, showcasing their skill and athleticism. In total, there are three people visible in the scene: one skateboarder performing the trick, another person looking on, and another person standing on the edge of the ramp, likely observing the action.\n\nThere are two skateboards visible in the scene, one being used by the skateboarder performing the trick, and another skateboard positioned near the edge of the ramp, possibly belonging to one of the spectators."}
{"image_id": 535952, "caption": "The image features three delicious brownies displayed on a wooden table. They are all placed on cupcake holders or stands, which are placed on top of each other on the table. The brownies are positioned at different angles and heights, adding an appealing visual effect to the arrangement. The table itself occupies most of the background of the image, with the focus being on the brownies and their presentation."}
{"image_id": 455772, "caption": "The image depicts a man jumping high in the air to catch a frisbee on a grassy field. He is wearing jeans, a hat, and shoes as he effortlessly catches the frisbee mid-air. The scene appears to be taking place in a park or similar outdoor setting.\n\nThere are several cars parked around the park, with one car visible behind the jumping man and others parked further away. The cars vary in size and positioning, creating a background that complements the action taking place in the foreground."}
{"image_id": 63617, "caption": "In this image, a young boy wearing glasses is trying to catch a baseball flying through the air using his baseball glove. The boy appears to be making a funny face as he attempts to catch the ball, which is located towards the top left corner of the scene. Another person can be seen in the background, likely watching the boy's attempt to catch the ball.\n\nThe scene also includes two dogs – one dog is located towards the right side of the scene, while the other dog is closer to the bottom left corner of the image."}
{"image_id": 90155, "caption": "The image depicts a train traveling along railroad tracks through a grassy area, possibly near a wooded area or a rural countryside setting. The train is long and composed of several cars, some of which are black in color. The train appears to be moving through the countryside, away from urban areas."}
{"image_id": 158127, "caption": "The image depicts a cat sleeping on its owner's feet, resting its head on their shoes. The cat appears to be quite relaxed and content as it curls up next to its owner's legs. Both the cat and its owner are wearing shoes, indicating they might be indoors or walking outdoors together."}
{"image_id": 248582, "caption": "The image depicts a group of people standing outside a fruit stand in an open marketplace, browsing through various fruits. There are at least three people visible in the scene, one of them reaching for bananas from a display near the stand.\n\nA variety of fruit can be seen throughout the scene, including bananas and apples placed on display for sale. The bananas are distributed throughout the stand, with some bananas found higher up, others lower down, and others still placed closer to the people browsing the marketplace. \n\nAdditionally, there are two backpacks visible in the scene – one near the left side of the image and another towards the right side. These backpacks likely belong to some of the people browsing the fruit stand, possibly carrying their belongings or other items they may need during their visit to the marketplace."}
{"image_id": 206560, "caption": "The image captures a moment of a snowboarder in action, flying through the air after jumping off a hillside. The snowboarder is seen mid-jump, showcasing their skill and control over the snowboard.\n\nThe snowboard itself is visible in the air, creating an impression of the snowboarder soaring through the air. In addition to the main snowboarder, another person can be seen on the left side of the image, likely observing or waiting for their turn to snowboard down the hillside."}
{"image_id": 69009, "caption": "The image features two young boys wearing blue hats and blue jackets, both standing together near a glass window. They appear to be observing something interesting on the other side of the glass, possibly watching a bear or other animals inside an enclosure. Their attention is drawn towards the window, capturing their interest."}
{"image_id": 322122, "caption": "The image depicts a white porcelain toilet bowl with its lid closed and attached to the tank. A cleaning cloth is placed on top of the lid, indicating that it has been recently cleaned. The bathroom features tile walls and floor, giving it a clean and well-maintained appearance. \n\nIn addition to the toilet, there are two other objects in the bathroom: a sink situated on the left side of the room, and a handbag placed on the right side of the room. A remote control can also be seen resting on the floor near the sink."}
{"image_id": 549930, "caption": "The image depicts a wet beach scene where two people are walking together under an umbrella, likely enjoying their time despite the rain. They are the main focus of the scene, with one person slightly behind the other.\n\nThere are several other people in the background, some of them also walking under umbrellas to protect themselves from the rain. There are also several umbrellas scattered around the scene, some covering individuals and others being held by people on the beach. \n\nIn addition to the umbrellas, there are beach umbrellas set up, providing shelter for beachgoers who want to relax under them. Beach chairs can also be seen scattered around the wet sandy beach area, adding to the beach atmosphere."}
{"image_id": 33216, "caption": "The image features a delicious pizza served on a table, placed on a silver plate with a red tablecloth underneath it. The pizza has generous amounts of sauce and cheese, making it look delicious and mouthwatering.\n\nThere are several people present in the scene, one person is located on the left side of the table, another person is seated on the right side, and another person is standing near the center of the room. The people appear to be either enjoying their meal or conversing with each other while the delicious pizza is being served."}
{"image_id": 434581, "caption": "In this image, a person wearing black leather attire is riding a motorcycle on a roadway. They are wearing a helmet for safety while riding. The motorcycle itself is black, and it appears to be a motorcycle with a large motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motorcycle motor"}
{"image_id": 239509, "caption": "The image depicts a street scene where two signs are prominently displayed, one close to the center of the street and another towards the right side of the scene. Both signs are red and white in color, making them stand out against the background.\n\nThere are several people in the scene, one person is positioned near the center of the street, another person is located towards the right side of the scene, and another person can be seen towards the left side of the scene. A motorcycle is parked near the center of the street, adding to the urban atmosphere of the scene."}
{"image_id": 88848, "caption": "The image consists of four separate pictures of different people posing next to fire hydrants. In each picture, there are different people posing with different fire hydrants. In total, there are seven people visible in the four pictures, posing with different fire hydrants.\n\nOne of the fire hydrants is blue, while others are yellow and red. The people are posing for the camera and enjoying themselves in these pictures. Additionally, there are two handbags visible in the images, one in the middle picture and another towards the bottom right corner of the bottom picture."}
{"image_id": 116182, "caption": "The image showcases a delicious meal served in a bowl placed on a table. The bowl contains a variety of cooked chicken pieces and carrots, making it a hearty meal full of protein and vegetables. The chicken pieces are scattered throughout the bowl, some placed closer to the bottom while others are positioned higher up. Carrots can be seen throughout the bowl as well, adding color and texture to the dish.\n\nThe table itself occupies most of the scene, giving prominence to the bowl of food, which occupies a central position on the table."}
{"image_id": 562345, "caption": "The image depicts a woman wearing a yellow rain jacket, jeans, and jeans shoes standing next to a wall. She appears to be texting on her cell phone, which she holds in her hand. Her jeans are worn and torn, adding to her casual style. The woman's posture suggests she might be leaning against the wall while texting. The scene captures her daily life moment, as she engages with her phone while possibly being outside or waiting for something."}
{"image_id": 343410, "caption": "The image features a plate of food with broccoli florets and a yellow pepper, both cut into pieces. There are several broccoli florets scattered around the plate, some cut into pieces while others remain intact. In total, there are at least thirteen broccoli florets visible on the plate. The plate itself occupies most of the image, with a background of white walls behind it."}
{"image_id": 490529, "caption": "The image depicts a woman seated at a table in what appears to be a restaurant or cafe setting. She is using her cell phone, likely texting or browsing, while seated on a chair. There are other people around her, one person seated on her left side and another person seated on her right side. Another person is visible at the far end of the table.\n\nAdditionally, there are several other chairs around the table, some empty and others occupied by other individuals. The table itself is quite large, occupying most of the space in the image."}
{"image_id": 328818, "caption": "The image depicts a woman tying her shoes on a bench near a bike path. She is leaning against a bench with her foot resting on another bench next to her. The woman appears to be preparing herself for cycling or resting after cycling.\n\nThere are two benches visible in the scene: one where the woman is leaning against and another bench further away from her. A bottle can also be seen placed near the benches, possibly containing water or other beverages for the cyclist. A bike is parked close to the benches, ready for use or already used by the woman."}
{"image_id": 218947, "caption": "The image depicts a snowy mountainous landscape where two skiers are skiing downhill together. One skier is skiing ahead of the other skier who is behind him. Both skiers are wearing backpacks, one located near the middle of the scene and the other towards the right side of the scene.\n\nIn addition to the two main skiers, there are two other skiers visible in the background, one on the left side of the scene and another towards the right side. Their skiing positions suggest they are skiing together as well, creating a total of four skiers skiing downhill in this snowy mountainous setting."}
{"image_id": 152281, "caption": "The image depicts a large herd of sheep grazing on grass in an open field. There are sheep spread throughout the field, some grazing closer together while others are spread out more. In total, there are at least thirteen sheep visible in various positions within the field. \n\nIn addition to the sheep, there are two people present in the scene, one towards the left side and another towards the right side of the field. These individuals may be farmers or observers watching over the sheep."}
{"image_id": 41110, "caption": "The image depicts a young child drinking from a bottle using a sippy cup. The child is holding the bottle with both hands, drinking contentedly from it. The bottle itself appears to be purple in color. The scene takes place against a background of white walls, which gives it a clean and uncluttered appearance."}
{"image_id": 512985, "caption": "The image depicts a beach scene where a surfer wearing a black wet suit is standing with his surfboard on the sandy shore. Another surfboard can be seen lying close to him on the ground. The surfer appears to be admiring the waves before surfing them.\n\nThere are two other people present in the background, one towards the left side of the image and another towards the right side. Additionally, there are two birds flying overhead, one higher up in the sky and another lower down near the surfer."}
{"image_id": 414212, "caption": "The image shows a man standing in front of a mirror while holding two items: a toothbrush and a bottle of lotion or lotion stick. He appears to be giving a thumbs up gesture, possibly expressing satisfaction or approval of something related to dental care or grooming.\n\nThe man is wearing glasses, which further emphasizes his attentiveness to detail. In the background, there is a toothbrush holder placed close to the mirror, possibly indicating that this area is used for personal grooming and dental care routines."}
{"image_id": 426578, "caption": "The image depicts a beach scene where a man wearing a black swimsuit is running along the sandy beach. He appears to be jogging and appears to be running away from something or someone, possibly trying to avoid them or simply enjoying a refreshing exercise outdoors.\n\nAside from the main runner, there are other people visible in the background on the beach, likely enjoying their own activities or simply observing the man running. Overall, it seems like a typical beach scene filled with activity and relaxation."}
{"image_id": 291962, "caption": "The image depicts a young boy happily flying a colorful kite in an open field. He is holding onto the string attached to the kite, which soars high above him. The boy appears to be enjoying himself as he controls the kite's movements.\n\nThe field is large, providing ample space for the boy to fly his kite without obstruction. In the background, there are several windows visible, likely part of nearby buildings or homes."}
{"image_id": 460927, "caption": "The image features a bear walking across a grassy field with rocks scattered around the area. The bear is prominently visible in the center of the scene, appearing majestic as it strolls through the grassy field. Its fur is wet, likely due to its recent swim or bathing in water. The bear appears to be alone in this wide open space, as no other animals or objects are visible in the frame."}
{"image_id": 552186, "caption": "The image depicts a man riding a skateboard at a skateboarding park, performing tricks on his skateboard. The skateboarder is dressed casually in jeans and shoes, showcasing his skills on the skateboard as he skates away from the camera. \n\nThere are several other people present in the background of the image, likely fellow skateboarders or spectators enjoying the scene at the park. In total, there are 11 people visible in various positions around the skateboarding area, some closer to the skateboarder and others farther away."}
{"image_id": 553852, "caption": "The image depicts a young boy riding a skateboard down a sidewalk. The boy is wearing jeans and shoes as he skateboards down the pathway. In addition to the boy, there are two other people in the background, one on the left side and another on the right side of the image, probably observing or watching the boy skateboarding.\n\nThere are also two bicycles present in the scene, one positioned towards the top left corner of the image and another towards the top right corner. The bicycles seem to be parked or temporarily left behind by their owners while they watch the boy skateboarding."}
{"image_id": 370337, "caption": "The image depicts two boats docked on a river near a pier. Both boats are red in color, one occupying the left side of the scene, while the other is positioned slightly behind it on the right side. They are docked next to each other, creating an attractive scene with buildings in the background.\n\nThere are several people visible around the boats, some closer to the boats and others further away. A person can be seen near the middle of the scene, another person is towards the right side, and two more people are positioned closer to the rightmost boat. Additionally, there are two clocks visible in the background, one towards the center of the scene and another towards the right side."}
{"image_id": 18491, "caption": "The image depicts a baseball game in progress with players on the field, one of whom is sliding into a base to avoid being tagged out by another player. There are a total of eight players visible in various positions around the field, some closer to the base while others are positioned further away. A baseball glove can be seen in the hands of one player.\n\nIn addition to the players on the field, there are two benches visible on the side of the field. One bench is positioned towards the left side of the field, while the other bench is placed towards the right side. The benches seem to be used by players to rest during breaks in the game."}
{"image_id": 556000, "caption": "The image depicts a family gathered together in their living room, enjoying a game night together. There are four people present: two adults and two children. The adults are standing, one near the left side of the room and another near the right side, while the children are seated on the floor.\n\nIn front of them, there is a television screen displaying a game being played. The family members are holding remotes, likely controllers for the game they are playing. A chair is positioned near the center of the room, while another chair is located towards the right side of the room. There is also a couch located towards the right side of the room, which provides additional seating space for the family members during their game night gathering."}
{"image_id": 443351, "caption": "The image depicts two motorcycles parked side by side on a cement surface, likely a parking lot or road. Both motorcycles are parked next to each other, one occupying most of the space and the other occupying less space. They both seem to be parked securely in their respective positions.\n\nThere is also a motorcycle helmet visible near the first motorcycle on the left side, likely belonging to its owner. The scene captures the essence of motorcycle culture and transportation."}
{"image_id": 63965, "caption": "The image depicts a woman holding a plate containing a delicious slice of cake with icing. She is holding the plate with both hands, showing off the delicious dessert she is about to enjoy. The cake itself is decorated with hearts, making it look even more appealing.\n\nThere are two more cake slices visible in the background, one on the left side of the plate and another on the right side, both with hearts decorating them as well. The woman appears to be savoring the deliciousness of the dessert she is about to enjoy."}
{"image_id": 405660, "caption": "The image depicts a bench sitting on top of a hillside with a panoramic view of mountains in the background. A skyline can be seen in the distance, further emphasizing the impressive viewpoint. The bench itself is made of wood and appears to be the main focus of the scene, inviting viewers to sit down and admire the scenery around them. There is also a tree close to the bench, adding to the natural beauty of the location."}
{"image_id": 419144, "caption": "The image depicts a group of people riding elephants in a field. There are four elephants visible in the scene, each with riders sitting on them. The riders are spread out across the field, some riding closer together while others are spaced apart. The elephants appear to be moving together, creating an exciting atmosphere as they traverse the field."}
{"image_id": 371004, "caption": "In this image, a zebra is standing inside a wire mesh enclosure at a zoo. The zebra is looking outward from behind the mesh fence, possibly observing its surroundings or other animals. The wire mesh fence provides the zebra with a safe enclosure while still allowing visitors to view the animal up close."}
{"image_id": 116861, "caption": "The image depicts a woman sleeping peacefully on a chair, with her head resting on a stuffed teddy bear. The chair she is sleeping on is covered with a blanket, providing warmth and comfort during her nap. The woman appears to be enjoying her restful sleep, and her surroundings are calm and serene."}
{"image_id": 579664, "caption": "The image depicts a wooden bin full of ripe bananas, with some bananas being yellow and others being ripe and ready to eat. The bananas are spread out across the bin, occupying most of its space. There are bananas positioned towards the left side, middle, and right side of the bin, as well as some bananas near the bottom right corner.\n\nThe bin itself occupies most of the background of the image, with trees visible in the background behind it, adding to the outdoor setting."}
{"image_id": 5600, "caption": "The image features a table with two bowls containing different types of food. One bowl contains a mixture of vegetables, including peas and other green vegetables, while the other bowl contains some kind of Asian fruit or desserts, possibly sweet potatoes or other similar items. These bowls are placed next to each other on the table, making them easy to access and enjoy together."}
{"image_id": 199389, "caption": "The image features a colorful fire hydrant placed next to a roadway. This particular fire hydrant has been painted to resemble the character Mickey Mouse, making it unique and eye-catching. Mickey Mouse's face can be seen smiling on the hydrant, making it stand out even more.\n\nThere are also two cars visible in the background, one parked behind the other on the roadway. Additionally, there are two bottles placed on the ground near the hydrant, one towards the left side of the hydrant and another slightly to its right."}
{"image_id": 568131, "caption": "The image depicts a large elephant walking across a grassy field, possibly near a forest. The elephant occupies most of the scene, taking up a large portion of the field. The grassy field appears to be green and full of grass, providing an ideal habitat for the elephant to roam freely."}
{"image_id": 35671, "caption": "The image depicts a rodeo scene where two men are riding horses, one on each horse. They are chasing a cow that is running away from them on a dusty field. In total, there are four horses visible in the scene, one each ridden by two men, one horse chasing the cow, and another horse standing nearby.\n\nThere are also several people present in the scene, including spectators watching the rodeo action unfold. In total, there are nine people in various positions around the scene. Some are standing closer to the action while others are standing further away. This exciting rodeo scene captures the thrilling action between the cow, horses, and riders."}
{"image_id": 76522, "caption": "The image depicts a black and white cat sleeping peacefully on a couch cushion. The cat is lying down next to a remote control, which is placed on top of the cushion near its head. The cat appears to be sleeping soundly, enjoying its cozy resting place on the couch."}
{"image_id": 504167, "caption": "The image features a cat with green eyes sitting on a wooden floor, possibly indoors. The cat appears to be gazing into the camera, capturing attention with its eyes. Its fur is brown and white, making it look furry and adorable. The cat occupies most of the frame, with its positioning in the center of the image."}
{"image_id": 21644, "caption": "The scene depicts a bus terminal where several buses are parked side by side in a parking lot. The buses are parked close together in rows, creating an organized appearance. They are parked next to each other in front of a bus terminal, ready for passengers to board.\n\nThere are buses of different sizes, colors, and styles parked in the parking lot, showcasing a variety of buses in the terminal. The buses vary in size and positioning within the parking lot, some occupying larger spaces while others occupy smaller ones. Overall, it seems like a busy bus terminal where buses are parked and ready for their respective routes."}
{"image_id": 483135, "caption": "The image depicts a group of people gathered together in a room, playing video games using Wii controllers. There are four people visible in the scene: one person on the left side of the room, another person in the middle, and two others on the right side. They appear to be enjoying themselves as they engage in friendly competition.\n\nThere are two couches in the room, one occupying most of the background and another smaller one towards the right side of the room. A chair can also be seen in the background on the left side of the room. A remote control can be seen lying on the floor near one of the players, ready for use during their gameplay session."}
{"image_id": 271063, "caption": "The image depicts a kitchen with various appliances and cabinets. There is a microwave positioned above a black oven on the left side of the room, while another oven is located below the first one. Next to these appliances, there is a sink installed underneath the ovens, providing a convenient cooking area.\n\nThe kitchen also features wooden cabinets with doors on both sides and one door at the top. There is a cabinet above the sink, another cabinet above the ovens, and another cabinet above the microwave. Additionally, there are two more cabinets positioned above each other above the sink area, contributing to the overall layout of the kitchen."}
{"image_id": 36477, "caption": "The image depicts a large bunch of bananas, still attached to their branches, piled together in a box. The bananas are yellow and ripe, ready to be consumed. Some bananas are positioned higher than others, creating a sense of depth in the box. There are bananas occupying most of the space within the box, indicating that there are plenty available for consumption."}
{"image_id": 125375, "caption": "The image depicts a train station where people are gathered around a red train that has come to a stop at the platform. There are several people standing close to the train, likely waiting to board or exit the train once it has come to a complete stop.\n\nAmong the crowd, there are two handbags visible, one near the middle of the platform and another towards the right side of the platform. The train itself occupies a large portion of the image, occupying most of the space from left to right and from top to bottom."}
{"image_id": 362520, "caption": "In this image, a young boy wearing a helmet is skillfully riding a skateboard up a ramp at a skateboarding park. He appears to be enjoying himself as he maneuvers his board upwards, likely preparing for a trick or simply enjoying the thrill of skateboarding. \n\nAnother person can be seen in the background, possibly watching the boy or waiting their turn to skateboard. The scene captures the excitement and fun of skateboarding as the boy showcases his skills on the board."}
{"image_id": 5412, "caption": "The image depicts a bathroom with two white toilets positioned next to each other. They both have white bowl covers, one of which has an odd shape. The bathroom also contains two sink basins, one located near each toilet.\n\nThere are two water faucets visible in the bathroom – one near each sink basin. Additionally, there is a cup placed on one of the sink basins, perhaps used for rinsing purposes. The bathroom appears clean and well-maintained."}
{"image_id": 757, "caption": "The image depicts a group of elephants standing together near water, most likely in their natural habitat or a watering hole. There are four elephants visible in total: one elephant is prominently featured, while three others are positioned behind it. \n\nOne elephant can be seen reaching its trunk into the water, possibly drinking or cooling off in the water. The elephants appear to be interacting with each other, likely engaging in social behavior typical of elephants. They are standing close together, creating a sense of unity and companionship within their group."}
{"image_id": 396496, "caption": "The image depicts a crowd of people standing outside during a snowfall, with some of them using umbrellas to shield themselves from the snow. They are waiting in line or gathered near buses parked at the bus stop. \n\nThere are several buses visible in the scene, one occupying most of the left side of the image, another occupying the middle section, and another bus towards the right side of the image. The crowd consists of people standing close together, some standing under umbrellas while others are without them. Overall, it seems like a cold winter day at a bus station or bus stop."}
{"image_id": 81761, "caption": "The image depicts a woman playing tennis on a court, swinging her tennis racquet to hit a ball in mid-air. She appears focused and poised as she takes aim at her shot. The tennis ball is positioned towards the center of the scene, with the woman standing close to it.\n\nThe court itself is green, and there are two other tennis racquets visible in the background, one closer to the left side of the scene and another towards the right side. The woman's positioning suggests she is actively engaged in a game or practice session."}
{"image_id": 130677, "caption": "The image depicts two tennis players dressed in black attire playing tennis at night. They are both wearing masks, likely due to the COVID-19 pandemic or other reasons. One player is positioned on the left side of the court while the other player is on the right side.\n\nTwo tennis rackets can be seen in action during the game, one near each player. The court itself is illuminated by lights, creating an atmosphere conducive to nighttime tennis play."}
{"image_id": 318825, "caption": "In this image, a tennis player wearing white shorts is standing on a tennis court, swinging his tennis racquet towards the ball. He appears to be preparing to hit a serve or return a volley during a tennis match. The tennis court itself is green and blue.\n\nThere are two other people present in the scene, one located near the top left corner of the image and another person towards the bottom right corner. The tennis racquet is visible in the hands of the main tennis player, ready for action."}
{"image_id": 48014, "caption": "In this scene, a man is walking his black dog on a leash down a sidewalk next to cars parked along the street. They are walking past benches, one towards the left side of the scene and another towards the right side. Another bench can be seen further back on the left side of the scene.\n\nThere are several other people in the scene, some standing or sitting on benches, others walking or standing near cars. Some cars are parked along the street, one on the left side of the scene, another on the right side, and another car in the background on the left side."}
{"image_id": 421028, "caption": "The image depicts a cat laying down on a carpet floor indoors. The cat appears to be sleeping or relaxing on the floor. Beside the cat, there are two toys – one resembling a carrot and another resembling an orange. The cat appears to be holding onto these two objects while sleeping, making it look like they are part of its bedding. \n\nAdditionally, there are several books scattered around the room, some placed near the cat and others scattered around on the floor or walls. A pair of shoes can also be seen near the cat, likely belonging to someone else in the household."}
{"image_id": 479659, "caption": "In this scene, two people are standing next to each other near a table at an outdoor event or gathering. Both individuals are drinking wine from wine glasses, one glass each. They appear to be engaged in conversation or enjoying the company of each other. \n\nThere are several bottles placed around the table, likely containing different types of wine or other beverages. A chair can also be seen near the table, probably meant for additional guests or seating arrangements. The setting appears to be casual, with people socializing and savoring their drinks outdoors."}
{"image_id": 369826, "caption": "The image depicts a large TV screen located inside an airport terminal. The screen displays a picture of someone surfing, capturing the viewer's attention. Surrounding the screen, there are several chairs placed throughout the area, likely meant for passengers to sit and wait for their flights or simply rest. Additionally, there are two benches visible in the scene, one on the left side and another on the right side of the screen."}
{"image_id": 406253, "caption": "The image captures a street scene with two motorcycles parked side by side on the sidewalk next to a red car. The motorcycles are positioned close together and seem to be parked in an orderly manner. There are also several other cars parked along the street, adding to the busy nature of the scene.\n\nThere are several people present in the scene as well, some walking around and others standing or talking near the parked cars and motorcycles. Additionally, there are two traffic lights visible in the background, one towards the left side of the scene and another towards the right side."}
{"image_id": 548267, "caption": "The image depicts a group of sheep grazing peacefully in a green pasture near mountains. There are thirteen sheep spread across the field, some grazing closer to the camera while others are further away. The mountains in the background create a picturesque setting for these animals, emphasizing their natural habitat."}
{"image_id": 335844, "caption": "The image features a silver microwave oven with its door open, placed on top of a white countertop. The microwave is loaded with food, including several pizzas inside it, ready to be cooked. The pizzas are placed at different positions inside the microwave, showcasing a variety of sizes and shapes. The microwave oven occupies most of the space in the image, from left to right and top to bottom, highlighting its size and prominence on the countertop."}
{"image_id": 299640, "caption": "The image displays three different types of remote controls side by side on a table or countertop. These remote controls appear to be broken or old, possibly due to wear and tear or damage. In addition to the remote controls, there are two TV remote control buttons visible in the picture, one on the left side and another on the right side of the table. These buttons seem to be part of another remote control system."}
{"image_id": 121812, "caption": "The image depicts a busy street scene in a town with traffic lights controlling the flow of traffic. Traffic lights can be seen at various points along the street, including one near the center and others towards the right side of the scene. A traffic light is also visible near the top right corner of the image.\n\nNumerous cars are present on the street, some stopped at traffic lights while others are moving forward. In total, there are around thirteen cars visible in various positions along the street. Additionally, there are two trucks visible in the scene, one towards the right side and another towards the center.\n\nIn addition to the traffic lights and vehicles, there are two pedestrians visible on the street, one near the center of the scene and another towards the right side. They seem to be walking along the busy street, probably commuting or going about their daily activities."}
{"image_id": 107234, "caption": "In this image, a man wearing a suit and tie is holding a glass to his mouth, drinking wine. He appears to be drinking wine quite quickly, possibly at a wedding or formal event. The man is in close proximity to the camera, capturing his facial expressions as he drinks. There are also two other people visible in the background, one on the left side of the image and another person on the right side, both seemingly attending the same event."}
{"image_id": 153104, "caption": "The image depicts a crowded stadium full of people enjoying themselves. A man is prominently eating a hot dog, which appears to be the focus of the scene. The stadium seating is full of people watching the event, some of whom are also eating hot dogs.\n\nThere are several other hot dogs visible throughout the stadium, with one near the middle-left of the scene and another towards the right side. People can be seen sitting on chairs scattered around the stadium, some of them eating hot dogs while others are simply spectating the event.\n\nOverall, it seems like a typical stadium experience with people enjoying themselves and indulging in snacks such as hot dogs."}
{"image_id": 216417, "caption": "In this black and white image, a man wearing a hat is skiing across snowy terrain with his dog riding on his backpack. The dog appears to be enjoying the ride as they both ski together through the snowy landscape. \n\nThe man is equipped with ski poles, one in each hand, to help him navigate through the snowy terrain. They both seem to be enjoying their time together in this winter setting."}
{"image_id": 286708, "caption": "The image features a black and white cat wearing a pink knitted hat on its head. The hat appears to be knitted and has a fuzzy texture. The cat is posing for the camera with its eyes open, looking directly at the camera.\n\nThere are several books scattered around the cat, some placed behind it and others placed around its surroundings. Additionally, there is another smaller cat located towards the right side of the image, seemingly observing the main cat wearing the pink hat."}
{"image_id": 547041, "caption": "The image features a table with two containers full of delicious food items, both in plastic containers. One container contains a salad with lettuce and olives, while the other container contains a different salad or dessert item. Both containers are placed next to each other on the table.\n\nThere are also two spoons present in the scene, one positioned near the first container and another next to the second container. Additionally, there are two bowls placed on the table, one near the first container and another near the second container."}
{"image_id": 293802, "caption": "The image depicts a young man skillfully performing tricks on his skateboard in the middle of a street. He appears to be jumping high above his skateboard while performing these tricks. There are several other people around him, some close to him and others further away, likely spectators or fellow skateboarders.\n\nA few objects can be seen in the background, such as an umbrella and a chair. There are also two bicycles parked on the sidewalk, one towards the left side of the scene and another towards the right side. Another skateboard can be seen lying on the ground near the center of the scene."}
{"image_id": 252738, "caption": "The image depicts a man wearing glasses and a leather jacket, talking on his cell phone while standing in a dusty field. He appears to be quite focused on his conversation, with his hands cupped around his phone. \n\nIn the background, there are two other people visible in the distance, one on the left side and another further away on the right side of the field. A car can also be seen parked in the background, slightly behind and to the right of the man talking on his phone."}
{"image_id": 43165, "caption": "The image depicts two zebras standing side by side in a grassy field with patches of hay scattered around them. They appear to be looking downward as they stand together, possibly grazing or seeking food in the grassy area.\n\nThe zebras are positioned near trees, creating a natural setting for them. Their black and white stripes can be seen clearly against the background of grass and hay."}
{"image_id": 218215, "caption": "The image depicts a polar bear swimming in a pool of water with its mouth open, likely breathing air or swimming through water at speed. The bear's mouth is wide open, showcasing its teeth, and its body is in motion as it swims through the water. \n\nThe pool of water appears to be relatively small, confining the polar bear within its boundaries as it swims. The overall scene captures the polar bear's energy and movement in its aquatic environment."}
{"image_id": 299082, "caption": "In this image, two giraffes are seen grazing on grass in a grassy field. They are both leaning forward to eat grass from the ground, one slightly more than the other. Their heads are positioned close together, forming an interesting contrast between their respective sizes. The scene captures their natural habitat where they are feeding on grasses."}
{"image_id": 152360, "caption": "The image depicts a street marketplace where bananas are being hung for sale. There are several bunches of bananas suspended from strings, with some bananas placed higher than others. Some bananas are hung higher than others, creating an eye-catching display.\n\nThere are cars parked along the street, with one car on the left side of the image and another car on the right side. A person can be seen walking past the marketplace, likely browsing the produce available for sale. The scene captures a typical street marketplace atmosphere where bananas are the main item being sold."}
{"image_id": 205601, "caption": "The image depicts a woman cooking food in a pan on a stove top oven in a kitchen. She is actively stirring the contents of the pan with a spoon. The pan contains multiple ingredients, including pieces of meat and vegetables such as carrots and peppers. There are also other utensils present in the scene, such as a fork and another spoon, indicating that she may be preparing multiple dishes or recipes simultaneously.\n\nAnother person can be seen in the background, likely assisting or observing the cooking process. There are two bottles visible in the scene, one on the left side and another on the right side of the kitchen."}
{"image_id": 174004, "caption": "The image depicts an old yellow truck parked in a grassy field. The truck appears to be abandoned and rusty, with its front and rear parts showing signs of wear and tear. The truck is parked in such a way that its front wheels are visible, while its rear wheels are hidden behind grass. \n\nThere are several yellow flowers scattered around the scene, adding a touch of color to the otherwise rustic setting. One of these flowers is placed close to the truck's front wheels, another one is near the middle of the scene, and two others are visible towards the right side of the image."}
{"image_id": 31542, "caption": "The image captures a thrilling moment of a snowboarder jumping high in the air over a snow-covered ski slope. The snowboarder is in mid-air, showcasing their skill and expertise. They are wearing a blue jacket that matches the blue snowboard they are riding.\n\nThe scene is dynamic and action-packed, capturing the snowboarder's entire body as they soar through the air, displaying their athleticism and control over their snowboard."}
{"image_id": 305268, "caption": "In this image, a woman is playing tennis on a court in what appears to be an indoor tennis court. She is holding a tennis racquet and jumping up in the air to hit the ball. The woman appears to be focused on her game and is in motion during this moment.\n\nThere are two tennis balls visible in the scene, one in the middle of the court and another towards the right side of the court. The woman's tennis racquet can be seen held high above her head as she jumps to hit the ball."}
{"image_id": 2867, "caption": "The image depicts a group of skiers wearing backpacks, skiing together down a snowy slope. There are five skiers visible in the scene. Two skiers are skiing side by side, while another skier is skiing behind them. Two additional skiers are skiing further behind them.\n\nEach skier has their own skiing equipment: skis, ski poles, and backpacks. The skiers are spread out along the slope, skiing at different paces and distances from each other. They appear to be enjoying their skiing adventure together, surrounded by snowy terrain."}
{"image_id": 72428, "caption": "The image depicts a white toilet with its lid closed and seat down. It is positioned against a wall with wood paneling. Next to the toilet, there is a small roll of toilet paper on the wall. The scene also includes a mirror above the toilet, likely in a bathroom setting."}
{"image_id": 158494, "caption": "The image depicts two giraffes standing next to each other inside their enclosure at the zoo. One giraffe is tall and towering over the other smaller giraffe, demonstrating their height difference. The smaller giraffe is positioned towards the left side of the image, while the larger one occupies most of the right side of the frame.\n\nBoth giraffes are looking upwards, possibly gazing at something above them or simply observing their surroundings. The scene captures the majestic nature of these animals within their enclosure at the zoo."}
{"image_id": 147629, "caption": "In this image, there is a white cat laying down on a floor next to a stuffed elephant toy. The cat appears to be sleeping or resting next to the stuffed animal, which occupies most of the space in the scene. The cat's positioning indicates that it feels comfortable in its environment."}
{"image_id": 581899, "caption": "The image depicts two blue train cars parked next to each other on tracks. A person can be seen inside one of the trains, likely a conductor or passenger observing their surroundings. The train cars are positioned side by side, occupying a large portion of the image from left to right.\n\nThere are also two other smaller figures visible in the background, one towards the left side of the image and another towards the right side. They appear to be at a distance from the main train cars, possibly engaging in activities or observing something else in the vicinity."}
{"image_id": 369345, "caption": "The image depicts a room with a blue couch occupying most of the space. The couch is positioned against a wall with a table in front of it. On the table, there is a keyboard, mouse, remote control, and a cup. Additionally, there are several books scattered around the room, some placed on the table, others on the floor or the couch. A lamp illuminates the room, highlighting the objects on the table and creating a cozy atmosphere."}
{"image_id": 372246, "caption": "The image depicts a street sign on top of a pole, located near an intersection in a rural setting. The sign displays two street names, Hell Canyon Road and US Highway 395, marking the intersection. The sign is positioned near an empty roadway with a stop sign visible further down the road.\n\nThere are two cars visible in the scene, one located near the left side of the image and another towards the right side. Both cars seem to be driving through or past the intersection."}
{"image_id": 261563, "caption": "The image depicts two dogs playing together in a grassy field. They are both positioned close to each other, one dog being smaller than the other. A yellow frisbee can be seen between them, possibly indicating they are playing fetch or other similar games. \n\nIn addition to the two main dogs, there is another smaller dog visible in the background on the left side of the image. This dog appears to be smaller than the others and is positioned more towards the left side of the scene."}
{"image_id": 461802, "caption": "The image depicts a train station where a train is stationed at the platform. There are two train tracks visible in the scene, one of which is occupied by the train. The other track is empty, running parallel to the train track occupied by the train.\n\nThere is a clock visible above the train station platform, showing the time of 2:10. There are also two clocks in the scene, one positioned higher than the other. At least two people can be seen in the image; one person is standing next to the train, while another person is situated near the middle of the scene.\n\nSome handbags can be seen in the scene as well, one near the bottom left corner and another near the middle right side of the image."}
{"image_id": 138175, "caption": "The image depicts a man wearing glasses talking on his cell phone while standing indoors. He is wearing a suit jacket and tie, giving him a professional appearance. Another person can be seen behind him, likely engaged in conversation or also using their cell phone. \n\nThere are two additional cell phones visible in the scene, one placed near the first man and another one further away. Also present are two backpacks, one positioned close to the first person and another one further away, possibly indicating that these individuals are on their way to or coming back from work or other engagements."}
{"image_id": 103488, "caption": "The image depicts a clean and empty public bathroom with two sink areas positioned next to each other under mirrors. Each sink area is equipped with two hand soap dispensers and two paper towel dispensers. The mirrors above the sinks reflect the cleanliness of the bathroom.\n\nThere are also two individuals present in the bathroom; one person can be seen on the left side of the bathroom, while another person is located near the right side. The bathroom appears to be empty and ready for use by its visitors."}
{"image_id": 215901, "caption": "The image features a tabletop with a bowl placed on it, containing a variety of fruit. Inside the bowl, there are bananas and apples arranged together. The bananas are positioned towards the center of the bowl, while the apples are located towards the left side.\n\nIn addition to the fruit bowl, there are two bananas outside the bowl, one placed above it and another below it. The tabletop also has a chair positioned behind the bowl, completing the scene."}
{"image_id": 514180, "caption": "The image shows a delicious display of pizza on a countertop. There are three different pizzas visible: one is placed towards the left side of the countertop, another is in the middle, and the third one is on the right side. In total, there are fourteen pieces of pizza visible on the countertop, with one piece missing from one of the pizzas, likely already taken by someone else. The pizzas are all different sizes and styles, making for a mouthwatering array of options for everyone to enjoy."}
{"image_id": 396338, "caption": "The image depicts a busy street scene with several people crossing a roadway amidst traffic. There are two men prominently visible near the center of the scene, one wearing white clothes and another wearing white clothes with a hat. They seem to be crossing the street together.\n\nThere are other people scattered throughout the scene, some nearer to the camera and others further away. Multiple vehicles are present, including cars, trucks, and motorcycles. One car is visible near the left side of the scene, another car occupies the middle part of the scene, and two trucks can be seen on the right side of the scene. A motorcycle is also present towards the middle of the scene.\n\nThere are multiple handbags visible in the scene, one near the middle of the scene, another near the right side, and a third one towards the right side of the scene, possibly being carried by pedestrians."}
{"image_id": 579362, "caption": "The image features a man sitting alone on a bench on a sandy beach next to the ocean, gazing out at the water. There are several other people scattered around the beach, some of them closer to the water, others further away.\n\nIn the background, a large ship can be seen sailing past the beach area, adding to the scenery. A few surfboards are also visible on the sandy beach, suggesting that surfing might be a popular activity here. Additionally, there are two umbrellas set up on the beach, providing shade for beachgoers."}
{"image_id": 289512, "caption": "The image depicts a woman riding on top of a brown horse in an open field. She is wearing jeans and a hat as she rides the horse along a pathway. The woman appears to be enjoying her ride as she controls the horse with confidence."}
{"image_id": 306928, "caption": "The image features a large clock tower with a clock prominently displayed on its side. The clock tower is adorned with statues of birds perched around it, creating a unique and eye-catching appearance. Several birds can be seen dispersed around the tower, some close to the clock while others are spread out in different areas of the tower. Overall, the scene captures a fascinating combination of architecture and artistry."}
{"image_id": 453009, "caption": "The image features a bench with two stuffed animals placed on it: a teddy bear and a stuffed duck. The teddy bear is placed closer to the left side of the bench, while the stuffed duck is positioned towards the right side. The bench itself occupies most of the frame, with the stuffed animals occupying the majority of the space left between them. A car can be seen parked in the background behind the bench, adding to the scene's overall composition."}
{"image_id": 112581, "caption": "The image depicts a man wearing a hat and white shirt standing in what appears to be a store or a storefront. He is holding a drink in his hand while laughing or smiling at something. Another person can be seen in the background, but their face is obscured by the first person's actions.\n\nThere are several other people present in the scene as well, some of them standing closer to the background and others nearer to the edges of the frame. A handbag can also be seen near the center of the scene, likely belonging to one of the people present."}
{"image_id": 504977, "caption": "The image depicts an elderly woman sitting alone on a bench outdoors. She appears to be resting or perhaps smoking a cigarette. The bench she is sitting on occupies most of the scene, with her positioned towards the center of it.\n\nA purse can be seen resting next to her on the bench, likely belonging to her. There is also another smaller bench visible towards the right side of the scene."}
{"image_id": 228764, "caption": "The image depicts a sandy beach scene where two dogs and a cat are playing together. The dogs are chasing each other while the cat watches them playfully from the sandy ground. \n\nThere are several other objects scattered around the scene, including a chair placed near the left side of the beach, two umbrellas positioned close together towards the left side, and another umbrella further away towards the right side of the scene. These objects add to the overall beach atmosphere and create a sense of leisure and fun."}
{"image_id": 151528, "caption": "The image shows a man standing on top of a hillside, holding a red kite over his head as he prepares to fly it. Beside him, there is a black dog patiently waiting for him to begin flying the kite. The dog appears to be attentively watching its owner as he prepares to launch the kite into the sky.\n\nThe scene is set against a background of grassy hillsides and a cloudy sky, creating a picturesque setting for kite flying."}
{"image_id": 248919, "caption": "The image depicts a large kitchen with wooden cabinets, a table, and appliances such as a microwave oven mounted above the table. There are two chairs placed around the table, one on the left side and another on the right side of the table. The table itself occupies most of the space between the two chairs.\n\nIn addition to the main table, there are two smaller tables visible in the kitchen area. Various fruit is placed on one of these smaller tables, including apples and oranges. A bowl can also be seen placed on the table near the fruit."}
{"image_id": 580607, "caption": "The scene depicts a riverbank where several boats are docked next to each other along the riverside. There are five boats visible in the image, each occupying different positions along the riverbank.\n\nA row of trees can be seen along the riverbank, adding a natural touch to the scene. There are numerous people present near the riverbank, some standing close to the boats while others are further away. There are two benches positioned along the riverbank, one towards the left side and another towards the right side of the scene, providing seating options for those who wish to sit and enjoy the view of the river and boats."}
{"image_id": 200291, "caption": "The image depicts a table with two platefuls of delicious food arranged on it. The first plate contains a sandwich cut into pieces along with tomatoes and potatoes, creating an appetizing sandwich. The second plate contains another sandwich with tomatoes and potatoes as well, further enhancing the meal. There are also two servings of tater tots placed next to each plate, adding variety to the meal.\n\nOn the table, there is a fork positioned near the second plate, ready for use while enjoying the delicious meal. Overall, the table setup provides a balanced meal that includes both sandwiches and side dishes for a satisfying dining experience."}
{"image_id": 296231, "caption": "The image displays a room filled with various items on display. There is a television placed prominently on a table in front of the wall. Next to the television, there is a clock positioned on the wall above it.\n\nIn addition to these items, there are several books scattered around the room, some placed on shelves or tables. There are also several clocks positioned around the room, one on a wall near the television and others placed in different parts of the room. \n\nAdditionally, there are several figurines or statues scattered around the room, adding to the assortment of items displayed. Among these statues, one resembles Spider-Man, another resembles Batman, and others are placed in different positions around the room."}
{"image_id": 505663, "caption": "The image features a clock mounted on a wall inside a building, likely a stone structure. The clock has Roman numerals on its face, making it look elegant and classic. The clock is positioned near a window, which illuminates the clock with light.\n\nThere are two clocks visible in the image: one clock is prominently displayed in the middle of the wall, while another smaller clock can be seen near the bottom left corner of the wall. This arrangement of clocks adds a sense of depth and visual interest to the space."}
{"image_id": 41572, "caption": "The image depicts a baseball field where two men are practicing their baseball skills. One man is positioned in the center of the field, preparing to hit a ball with his bat. Another player is positioned in the background, ready to catch the ball once it is hit.\n\nThere are several baseball gloves scattered around the field, including one near the center player, another near the background player, and others positioned around the field. Additionally, there are two sports balls visible in the scene – one near the center player and another near the background player. The scene captures the dynamic nature of baseball practice and players' focus on honing their skills."}
{"image_id": 509589, "caption": "The image depicts a group of teenagers gathered together outside, possibly at a skateboarding event or competition. One boy is riding a skateboard while others stand around him, observing or waiting for their turn to skateboard. In total, there are nine people visible in the scene, including the boy riding the skateboard.\n\nAmong them, one person is wearing a blue shirt, another is wearing a blue hat, and another person is carrying a backpack. The atmosphere seems energetic and fun as these teenagers enjoy their time together outdoors."}
{"image_id": 357238, "caption": "The image depicts a person surfing on waves in the ocean, skillfully riding their surfboard amidst the waves. Nearby, another person can be seen, likely watching the surfing action or preparing for their own surfing session. Additionally, there are two birds soaring overhead, adding life to the scene. The sky overhead appears cloudy, creating a picturesque atmosphere for this water sports activity."}
{"image_id": 466575, "caption": "The image features an old brown suitcase that appears worn out and weathered, lying on its side on a pavement surface. It appears to be abandoned or forgotten on the street. The suitcase is large and occupies most of the image."}
{"image_id": 271970, "caption": "The image depicts a rural town scene with a clock tower prominently towering over the town. The clock tower is white and brown in color, standing tall against the sky background. The town itself is characterized by houses and buildings scattered throughout the scene, giving it a charming small town feel.\n\nIn addition to the clock tower, there are two clocks visible in the scene - one on the clock tower itself and another clock on another building. A street sign can also be seen, further emphasizing the town's layout. A person can be seen walking down the street, adding life to the scene."}
{"image_id": 305540, "caption": "The image features a large pair of scissors, likely made of metal, standing upright outside a building. The scissors are positioned in front of a doorway, making them appear like they are ready to cut something. Several people are present in the scene, some walking past the scissors while others stand nearby. \n\nThere are at least five people visible in the image, one person being closer to the left side of the scene, another person towards the middle, and three others spread out towards the right side. They appear to be casually strolling or engaging in conversation as they pass by the large pair of scissors."}
{"image_id": 462928, "caption": "The image depicts a bald man wearing glasses holding up an Apple cell phone to his ear. He appears to be smiling as he talks on the phone. The cell phone is positioned close to his ear, with its screen visible and taking up a large portion of the frame.\n\nIn the background, there is a chair located towards the right side of the scene. Additionally, there are two books visible in the scene, one placed near the bottom left corner and another one towards the bottom right corner of the frame."}
{"image_id": 270544, "caption": "The image depicts a group of people having fun in the water near a shore. There are five people visible in the scene, some swimming and others splashing water at each other, enjoying themselves in a playful manner. The water appears to be murky, and there are boats visible in the background.\n\nOne woman is particularly joyful as she splashes water at others, while another woman can be seen swimming in the water. Two boats can be seen floating in the background, one towards the left side of the scene and another towards the right side."}
{"image_id": 134042, "caption": "The image depicts a blue sky filled with clouds, where a plane can be seen flying overhead. The plane appears to be positioned above the clouds, creating a dynamic scene against the sky background. There are no other objects or people visible in the image, focusing solely on the plane and its surroundings."}
{"image_id": 120340, "caption": "The image depicts a man standing outside next to his blue bike, which is parked next to a bus. He appears to be adjusting or fixing something on his bike using tools such as a wrench and a screwdriver. There are two other people visible in the scene, one positioned behind him on the left side and another person on the right side of the scene. \n\nThere are two bottles placed near the bike, one closer to the left side of the bike and another bottle slightly further away from it. A handbag can also be seen near the bike, likely belonging to the man or another person in the scene."}
{"image_id": 418949, "caption": "The image depicts a baseball game in progress on a field with players wearing uniforms. One player is prominently holding a baseball bat and a glove, preparing to bat during the game. \n\nThere are other players scattered around the field, some closer to the player holding the bat and others positioned further away. Two baseball gloves can be seen in the scene, one near the player holding the bat and another located closer to the center of the field. A sports ball, likely a baseball, is also visible near the center of the field, adding to the action-packed atmosphere of the game."}
{"image_id": 520109, "caption": "The image depicts a grassy field filled with several umbrellas and umbrella bases placed on top of it. The umbrellas come in various colors, including blue, red, orange, and yellow. They are spread out across the field in different positions, creating a visually pleasing arrangement. In addition to the umbrellas, there are benches scattered around the field, likely for people to sit and enjoy the umbrella display or simply rest while admiring the view."}
{"image_id": 50753, "caption": "The image depicts a small kitchen equipped with appliances such as a white oven, a microwave above it, and a sink. The oven is positioned next to the microwave, while the sink is located towards the right side of the kitchen. A clock can also be seen on the wall above the sink area.\n\nIn addition to these appliances, there are several utensils scattered around the kitchen. There are two spoons placed near the sink, two knives positioned near the oven, and three forks distributed around the kitchen space. Additionally, there are two bottles placed near the sink area, one on the left side and another on the right side of the sink."}
{"image_id": 329939, "caption": "The image depicts three giraffes standing together in a grassy field, enjoying their time together. They appear to be gazing around their surroundings, possibly searching for food or simply appreciating their environment. The giraffes are spread out across the field, with one on the left side, another in the middle, and the third one on the right side of the frame. Their tall stature and unique shapes make them stand out against the background of grassy terrain."}
{"image_id": 351345, "caption": "The image depicts a woman wearing a white shirt, standing in front of a wall with pictures hanging on it. She appears to be smiling as she gazes at something close to her. The woman is holding a remote control in her hand, possibly controlling a television or other electronic device.\n\nThere is another person visible in the background on the left side of the image, but their presence is less prominent than the woman in the center of the picture. The scene has a casual and relaxed atmosphere as the woman enjoys herself while holding her remote control."}
{"image_id": 25293, "caption": "The image depicts a woman holding up a blue frisbee above her head, possibly preparing to throw it or already mid-throw. She appears to be enjoying herself outdoors in a natural setting. The woman is wearing a dress, which adds a sense of elegance to her appearance as she engages in this activity. The frisbee itself occupies a large portion of the upper part of the image, making it the central focus of the scene."}
{"image_id": 543041, "caption": "The image showcases a box full of assorted donuts laid out on a countertop, ready to be eaten. There are six donuts in total, each with different flavors and types, placed side by side. The variety includes both glazed and non-glazed donuts, giving an appealing array of options for those who enjoy these delicious treats."}
{"image_id": 568265, "caption": "The image depicts a park where people are enjoying a sunny day flying kites. There are several people dispersed throughout the park, some of them walking around while others stand still, admiring the kites flying overhead. The kites come in various sizes and colors, adding a sense of fun and liveliness to the scene.\n\nThere are two cars parked near the park, one towards the left side of the scene and another towards the right side. Additionally, there are two buses parked in the park area, one towards the middle-left side and another towards the middle-right side of the scene.\n\nNumerous people can be seen scattered around the park, some closer to the buses while others are nearer to the cars or kites flying overhead."}
{"image_id": 467386, "caption": "The image features a cat sitting outside a blue doorway near a building with red walls. The doorway leads to a room with blue shutters, likely a residential space. The cat seems to be relaxing outside the doorway, possibly waiting for someone to let it inside or simply enjoying its surroundings.\n\nOutside the doorway, there are two bottles placed on the ground near each other, possibly discarded or forgotten items. Additionally, there are two bowls positioned close to each other on the ground near the bottles. The scene also includes two knives placed on the ground near the bottles, which might be tools used for cooking or other purposes."}
{"image_id": 242363, "caption": "The image depicts a bathroom with white walls and a white sink in front of a white toilet. Both fixtures are white, completing the clean and white theme of the bathroom. There is also a bathtub positioned next to the sink and toilet.\n\nAn interesting detail of this bathroom is that it appears to be under construction or renovation, as evidenced by the presence of construction scaffolding visible in the background. This could be due to the bathroom being newly built or renovated with new fixtures and finishes being installed."}
{"image_id": 554900, "caption": "The image depicts a white porcelain toilet bowl in a bathroom stall with its lid closed. The toilet is situated next to a wall and features a white lid cover. The bathroom stall itself appears to be empty, with no other objects visible in the scene."}
{"image_id": 115006, "caption": "The image depicts a baseball game in progress on a field. At the center of attention is a baseball player who is swinging his bat over home plate, ready to hit the ball. The catcher is positioned nearby, ready to catch the ball if necessary. \n\nIn addition to the main player and catcher, there are several other people on the field. Some are seated on benches, while others are standing around. In total, there are thirteen people visible in the scene.\n\nThere are also two baseball gloves visible in the scene, one near the center of the field and another towards the right side of the field. Overall, the scene captures an exciting moment during a baseball game."}
{"image_id": 75375, "caption": "The image depicts a group of people enjoying themselves on the water, engaging in various activities such as surfing and sailing. There are several people scattered across the scene, some riding surfboards while others are sailing or windsurfing with kites attached to their sailboards. The kites can be seen soaring above them in different sizes and shapes, adding to the excitement of their activities.\n\nIn total, there are six surfboards visible in the scene, each being ridden by different individuals. Some surfers are in the middle of their ride while others are waiting for their turn or preparing to start their own surfing session. Overall, it's a lively scene full of energy and fun on the water."}
{"image_id": 419223, "caption": "The image depicts a group of children playing soccer on a grass field. There are four children visible in the scene, one on the left side of the field, another on the right side, one near the middle, and another towards the rightmost part of the field.\n\nThe children are chasing after a soccer ball, which is located towards the left side of the field. They are actively engaged in the game, showcasing their determination to score goals or defend their positions on the field."}
{"image_id": 137578, "caption": "The image depicts two identical white porcelain toilets placed next to each other in a bathroom setting. Both toilets are clean and well-maintained, making them appear ready for use. The bathroom itself appears to be empty, save for these two identical fixtures."}
{"image_id": 408808, "caption": "The image displays a tabletop with four dental care products arranged neatly on it. There are two toothbrushes placed next to each other, one towards the left side of the table and the other towards the right side. Both toothbrushes are held inside plastic cases for protection and easy transportation.\n\nAdditionally, two dental care products are present on the table: one tube of toothpaste and one dental floss. These items are placed on top of each other near the center of the table. The table itself occupies most of the scene, emphasizing the arrangement of these dental care items."}
{"image_id": 243773, "caption": "The image depicts a messy kitchen counter filled with various items such as bottles, wine glasses, a cell phone, a cell phone charger, and a bottle of wine. There are multiple bottles scattered around the countertop, some near the center and others towards the sides. Wine glasses can be found both close to the bottles and further away from them. \n\nIn addition to these items, there are several books scattered around the countertop, some close to each other while others are spread out. A cell phone charger can be seen near the center of the countertop, likely charging a cell phone placed on the countertop."}
{"image_id": 436492, "caption": "The image depicts a busy street scene with several traffic signs and objects displayed along the roadside. There are two traffic signs posted in different locations, one towards the left side of the street and another towards the right side. Additionally, there are two pedestrian crossing signs visible – one in the middle of the scene and another towards the right side of the street.\n\nThe street itself is busy with traffic, including cars parked along the sides of the road and others moving through the scene. There are also several pedestrians walking along the sidewalk, possibly passing by the traffic signs and crossings. A fire hydrant can be seen towards the right side of the scene, further adding to the busy nature of the street."}
{"image_id": 556648, "caption": "The image showcases a display of small white smartphones placed on a table in a store. There are several smartphones visible, each varying in size and shape. Some are larger than others, while others are smaller and more compact. They are all neatly arranged and positioned next to each other on the table, ready for potential customers to view and purchase."}
{"image_id": 298924, "caption": "The image features a delicious bowl of soup containing Asian cuisine, including noodles, meat, and vegetables such as green onions. A fork is placed in the bowl, ready to be used to enjoy this delicious meal. \n\nIn addition to the main bowl of soup, there are several bowls placed around it, likely containing other food items or sauces to accompany the main dish. A bottle can also be seen placed near the main bowl, possibly containing sauce or other condiments to enhance the flavors of the meal."}
{"image_id": 562030, "caption": "The image depicts a gardening scene where various plants are being grown on a patio deck. There are several potting soil mixes in different sizes, placed on a wooden deck underneath some plants. Some of these potting soil mixes are being used to grow plants in containers or potting trays, while others are ready for use.\n\nThere are two potted plants visible in the scene: one located towards the left side of the deck and another towards the right side. Additionally, there are two bowls in the scene, one towards the left side and another towards the right side of the deck.\n\nScissors can also be seen on the right side of the deck, likely used for trimming plants or cutting plants when needed."}
{"image_id": 501315, "caption": "The image depicts a green motorcycle rider racing on a track. The motorcycle driver is wearing a helmet and gloves as they navigate the curves of the track. The motorcycle itself is green and white in color, giving it a striking appearance as it speedily moves through the track.\n\nIn addition to the main motorcycle rider, there are other people visible in the background of the image, likely spectators or other racers participating in the event. The scene captures the thrilling atmosphere of a race track competition."}
{"image_id": 436162, "caption": "The image depicts a white bus parked outside a building, likely at a bus stop. The bus occupies most of the scene, covering the entirety of the image from left to right. Its doors are open, inviting passengers to board or exit the bus.\n\nThere are two people visible in the scene: one person is standing near the bus, closer to the left side of the image, while another person is further away on the right side of the bus. Both individuals appear to be waiting or preparing to board the bus."}
{"image_id": 323888, "caption": "The image depicts a nighttime scene outside a large building with clocks on its facade. The building resembles a clock tower, illuminated by lights from inside. A clock is prominently displayed on each side of the building, making it easier for pedestrians and drivers to see the time.\n\nThere are several people walking around outside the building, some close to each other while others are spread out. A car is parked outside the building, occupying a portion of the scene on the right side of the image."}
{"image_id": 211476, "caption": "The image features two bowls filled with delicious food, placed on a table. The first bowl contains a delicious looking chicken dish with broccoli and other vegetables, while the second bowl contains another delicious meal with broccoli, potatoes, and a sauce. Each bowl contains a variety of ingredients that make them look appealing and delicious.\n\nIn addition to the two main bowls, there is a bottle placed next to them on the table, likely a condiment or sauce to accompany the meals. The table itself occupies most of the background of the image, emphasizing the food items in focus."}
{"image_id": 473433, "caption": "The image depicts a suitcase open on a table, containing various items such as books, a bowl, and a bottle. The suitcase contains two books, one occupying the left side of the suitcase and another occupying the right side. A bowl is also present inside the suitcase, placed towards the center. A bottle is placed near the bottom left corner of the suitcase.\n\nIn addition to these items, there is a person visible in the background, possibly standing or posing for a photograph. The suitcase itself occupies most of the space within the image, creating a compact yet packed appearance."}
{"image_id": 165752, "caption": "The image depicts a black dog standing on grassy ground near a fence. The dog appears to be playfully interacting with a yellow frisbee, which is positioned above its head or in its mouth, depending on the moment captured in the photo. The dog appears to be playfully standing on its hind legs, possibly trying to catch or retrieve the frisbee."}
{"image_id": 573756, "caption": "The image depicts two giraffes in their natural habitat, surrounded by tall grass and trees. The first giraffe is positioned to the left side of the frame, while the second giraffe is positioned slightly behind the first one, both standing side by side. They appear to be feeding on leaves from trees, with their long necks reaching upwards to reach the branches. The scene captures the beauty of these animals in their natural environment."}
{"image_id": 187450, "caption": "The image depicts a train station with a train prominently visible on the tracks. The train occupies most of the scene, stretching from the left side to almost the right side of the image. There are two train tracks visible in the scene, one above the other, both of which are occupied by the train.\n\nThere are several people present at the station, scattered around the area near the train tracks. One person is located near the middle of the scene, another person is near the right side of the train, and two others are positioned towards the left side of the train. Additionally, there is a handbag visible near the middle of the scene, likely belonging to one of the passengers at the station."}
{"image_id": 43266, "caption": "The image depicts two giraffes walking together through a grassy field. One giraffe is positioned towards the left side of the field, while the other giraffe is towards the right side. They both seem to be enjoying their time together in this grassy area.\n\nThere are also several rocks scattered throughout the field, adding to the natural environment. Additionally, there are two trees present in the background on the left side of the field. The scene captures the beauty of these animals interacting with their surroundings."}
{"image_id": 150080, "caption": "The image features a delicious pizza with a variety of ingredients such as cheese, bacon, peppers, and shrimp. The pizza is generously topped with these ingredients, making it look mouthwatering and inviting. The pizza occupies most of the image, occupying a large portion of the plate it is served on. There are also several green peppers scattered around the pizza, adding a pop of color to the dish."}
{"image_id": 453757, "caption": "The image depicts a group of men playing soccer on a field. There are three main players visible in the scene: one player is kicking another player who is lying on the ground, another player is running towards them, and another player is chasing them both. \n\nThere are also two additional players visible in the background, one on the left side of the field and another on the right side. A sports ball can be seen in the center of the field, likely the soccer ball being used during the game. The players are positioned in various positions around the field, showcasing their involvement in the match."}
{"image_id": 354460, "caption": "The image depicts a ribbon-cutting ceremony attended by several people. Among them are two women dressed as Miss Illinois County, one of them smiling while others smile too. There are also two men present, one of them wearing a tie, all gathered together for this special occasion. \n\nThe ceremony takes place outside a building, where the ribbon cutting is happening, likely marking the opening or completion of an event or project. Additionally, there are two pairs of scissors present in the scene, one held by each person cutting the ribbon together."}
{"image_id": 221681, "caption": "The image depicts a white bathroom with blue tile walls and floor. The bathroom features a sink, a toilet positioned towards the right side of the room, and a window above the sink area. There are two bottles placed on the sink countertop, one closer to the left side and another towards the middle of the countertop.\n\nIn addition to the bottles, there are two hand towels placed on the countertop near the sink, one on the left side and another on the right side. Additionally, there are two cups positioned on the countertop, one near the middle and another towards the right side of the countertop."}
{"image_id": 349324, "caption": "The image depicts a train with multiple train cars traveling along its tracks. The train cars are arranged in rows, with some cars positioned closer together than others. In total, there are sixteen train cars visible in the scene.\n\nThe train extends from the left side of the image to the right side, occupying most of the frame. Some train cars are positioned close to each other, while others are spaced further apart. The train's journey continues through a cloudy sky, giving a sense of motion and movement."}
{"image_id": 225133, "caption": "The image depicts a tree adorned with a unique collection of Asian umbrella decorations suspended around it. There are 11 umbrellas in total, varying in size and color, creating an eye-catching display. The umbrellas are suspended at different heights around the tree, giving the impression of a tree top balloon display. Some umbrellas are hung higher than others, creating an interesting visual effect. This tree decoration likely takes place outdoors, likely during a festival or special occasion."}
{"image_id": 452566, "caption": "The image depicts a stop sign on a roadway, marking the intersection of two roads. The sign is mounted on a white pole and is positioned prominently on the roadway. The stop sign is located next to a fence, which separates the roadway from a field of grass.\n\nIn the background, mountains can be seen, creating a picturesque scene with the stop sign serving as a focal point amidst the natural beauty."}
{"image_id": 124952, "caption": "The scene depicts a busy city street with a blue bus driving past a silver car parked near a traffic light. Several other cars can be seen parked along the street as well. Pedestrians can also be seen on the sidewalk, one of them carrying a handbag.\n\nThere are two traffic lights visible in the scene, one positioned higher up on the left side and another lower down on the right side of the street. The street also features two traffic signs, one placed higher up on the right side and another lower down on the left side of the street."}
{"image_id": 26697, "caption": "A woman is standing in a bathroom brushing her teeth. She is holding a toothbrush in her hand while brushing her teeth, possibly preparing for bedtime or morning routine. In addition to her, there are two other people in the background, one on the left side and another person on the right side of the bathroom.\n\nThere are two bottles visible in the bathroom, one positioned towards the right side and another one towards the left side. The bottles could be soap dispensers or other bathroom products. The bathroom scene captures the woman's daily routine while brushing her teeth."}
{"image_id": 126064, "caption": "The image captures a surfer riding a wave on top of a surfboard, skillfully navigating through the ocean waves. The surfer appears to be enjoying the thrilling ride as they ride over the waves in their surfboard. The scene depicts the surfer's determination and ability to balance themselves on the surfboard while riding the waves."}
{"image_id": 557190, "caption": "The image depicts two men standing together on top of a hillside near trees. One of them is wearing a suit, while the other one is wearing a suit jacket but without a tie. They both seem to be smiling at the camera. The scene is set against a background of colorful trees, creating a pleasant autumn atmosphere. In the background, there are houses visible in the distance, adding to the scenery of the location."}
{"image_id": 137612, "caption": "The image features a large building with a purple and white color scheme, located next to a bridge. The building's front is adorned with a sign warning against parking cars in certain areas. There are several cars parked outside the building, and some are parked near the bridge as well. \n\nThere are multiple people visible in the scene, some walking along the sidewalk and others likely going about their business near the building. A bicycle is also present near the building, parked off to the side."}
{"image_id": 408480, "caption": "The image depicts a busy harbor scene with a large ship docked next to a red lighthouse. The ship occupies a large portion of the scene and stretches from the middle to the right side of the image. The lighthouse is positioned close to the ship, on the left side of the image.\n\nAdditionally, there are several cars parked along the harbor walkway, with some cars positioned closer to the ship and others farther away from it. The cars are parked at various angles and distances from each other, creating a busy atmosphere around the harbor area."}
{"image_id": 277694, "caption": "In this scene, there is a cow lying down on the ground next to a motorcycle parked on the sidewalk. The cow appears to be resting peacefully, occupying most of the ground space between the motorcycle and a nearby gate. \n\nAdditionally, there is another smaller motorcycle parked further away from the main motorcycle in the background. The scene captures a moment of tranquility between the cow and its surroundings, creating an interesting juxtaposition between rural life and modern city infrastructure."}
{"image_id": 74166, "caption": "The image depicts a young man riding a skateboard in a public space, skillfully performing a trick as he jumps onto a ledge. Another person can be seen sitting on a bench nearby, watching the skateboarder perform his trick.\n\nAround them, there are several other people present in the scene, some closer to the skateboarder and others further away. Additionally, there are two cars parked in the background, one towards the left side of the scene and another towards the right side. One of the cars appears to be blue."}
{"image_id": 102625, "caption": "The image depicts a clean and tidy kitchen with white walls and floors. A white dishwasher is prominently visible in the center of the room, along with a sink and an oven towards the left side of the room. There are two windows, one on each side of the room, providing ample lighting. \n\nVarious items adorn the countertops, including three bottles, three cups, two bowls, two knives, a spoon, and two wine glasses. Additionally, there are two chairs positioned near the left side of the room, one chair slightly behind the other.\n\nThe room also contains several decorative elements such as a clock hanging on the wall and two potted plants placed strategically around the room, one near the center and another towards the right side of the room. Overall, the kitchen has a clean and welcoming atmosphere."}
{"image_id": 540694, "caption": "The image depicts a large giraffe standing near a blue car window with its head poking inside. The car window is open, allowing the giraffe to interact with its surroundings. There are other cars parked around the scene, including one behind the blue car where the giraffe is positioned. \n\nIn addition to the cars, there are several people visible in the background, likely observing the situation or passing by. The scene captures an unusual moment between a wild animal and vehicles in a city setting."}
{"image_id": 518586, "caption": "The image depicts a black and white scene of a train track where a train is passing through. There are two train tracks visible, one nearer to the center of the scene and another towards the left side of the image. A man is walking along one of the tracks, closer to the center of the scene.\n\nThe train itself occupies most of the scene, traveling along the tracks towards the right side of the image. There are also several other smaller trains visible in the background, further away from the main train track where the man is walking."}
{"image_id": 81303, "caption": "The image depicts a man skiing downhill on a snowy slope, showcasing his skills and enjoyment of the sport. He is wearing ski gear, including skiing gloves and a hat, ensuring his comfort and safety while skiing. The man is skiing downhill towards the camera, possibly in mid-turn while skiing down the side of the snowy hill."}
{"image_id": 383065, "caption": "The image depicts a green urinal situated next to a street. The urinal is designed to be handicapped accessible with a wheelchair symbol on its side. \n\nIn addition to the main urinal, there are two other urinals visible in the background, one near the left side of the main urinal and another towards the right side. A person can be seen on the right side of the image, likely passing by or using one of the urinals."}
{"image_id": 169602, "caption": "The image depicts a woman surfing on a blue surfboard in the ocean. She is riding a wave towards the shore while maintaining balance on her surfboard. The woman is wearing a black swimsuit, which complements her surfing attire.\n\nIn addition to the main surfer, there are two other people visible in the background, one towards the left side of the image and another towards the right side. Their presence adds to the dynamic nature of the scene as they enjoy their time in the ocean together."}
{"image_id": 19890, "caption": "The image depicts two zebras eating grass together in their enclosure at the zoo. They are both grazing in a grassy field next to each other, enjoying their time together. A rock wall can be seen in the background, adding a touch of natural scenery to their environment."}
{"image_id": 236604, "caption": "The image depicts a spacious living room with beige furniture, including two couches positioned opposite each other. A coffee table is located between them, adorned with a candle and several books, creating a cozy atmosphere. \n\nThere are also four potted plants scattered around the room, adding greenery and liveliness to space. In addition to the furniture, there are two clocks visible on the wall, one near the middle of the room and another towards the right side. Additionally, two vases can be seen in the room, one placed near the left couch and another near the center of the room."}
{"image_id": 270753, "caption": "The image shows a delicious Chicago deep dish pizza cut into pieces, placed on a white plate on top of a table. The pizza is generously covered with cheese and several pieces of broccoli scattered across its surface. The broccoli pieces are distributed evenly across the entire pizza, making it an appetizing sight. The pizza appears ready to be enjoyed by those who love a delicious combination of cheese and vegetables."}
{"image_id": 457178, "caption": "The image depicts a busy street scene with horse carriages, horseback riders, and pedestrians. Several horse carriages are traveling down the street, including one carriage towards the center of the scene. Horseback riders are also present, one rider towards the center and another towards the right side of the scene. Pedestrians can be seen scattered throughout the scene, some closer to the center and others towards the right side of the street.\n\nIn addition to the activity on the street, there are two umbrellas visible in the scene – one towards the center-left side and another towards the right side. Two horses can also be seen in the background, one towards the left side of the street and another towards the right side."}
{"image_id": 577712, "caption": "The image depicts a group of people standing close to a giraffe enclosure at a zoo, admiring the tall animal as it gazes back at them. There are several people in the scene, including one standing on the left side of the enclosure and others positioned on the right side. \n\nA woman in the middle of the group appears to be feeding the giraffe, drawing attention from the other observers. In total, there are five people visible in the image, including one person who appears to be feeding the giraffe from behind the fence. The scene captures a moment of interaction between humans and wildlife at a zoo setting."}
{"image_id": 414560, "caption": "The image depicts several black and white cows resting inside a hay-filled pen. The cows are laying down and appear to be sleeping or resting comfortably in their hay bed. There are at least five cows visible in the pen, each occupying different positions within the hay bed. The hay bed itself occupies most of the space within the pen, providing ample room for the cows to rest."}
{"image_id": 388983, "caption": "The image features a delicious hot dog served in a bun with an abundance of sauce and condiments. The hot dog itself is placed in the middle of the bun, and it appears to be a sausage dog with sauce drizzled all over it. There are two condiments present: one is placed near the top left corner of the hot dog, while the other is located towards the bottom right corner of the hot dog. The hot dog is served in a stylish manner, making it look appealing to the viewer."}
{"image_id": 245965, "caption": "The image depicts a field with a blue umbrella situated on top of it. The umbrella is large, occupying most of the field's space, and its blue color contrasts against the field's grassy background. \n\nThere are also several small flowers scattered throughout the field, adding a touch of beauty to the scene. Some flowers can be found close to the umbrella, while others are spread across different parts of the field. The combination of the umbrella and flowers creates an interesting and visually appealing scene."}
{"image_id": 147590, "caption": "The image depicts a table filled with various food items and utensils. A glass wine glass is prominently placed on the table, likely filled with wine. Next to the glass, there are two knives and two spoons on the table, ready for use during mealtime. \n\nIn addition to these utensils, there are several bowls scattered around the table. One bowl is placed next to the wine glass, another bowl is towards the right side of the table, and the third bowl is located towards the bottom right corner of the table. There are also two bottles present on the table, one towards the left side and another on the right side."}
{"image_id": 46882, "caption": "The image depicts a group of people playing frisbee in an open field, located in a desert setting. There are four main players visible in the scene, one of them jumping up to catch the frisbee mid-air while others watch the action unfold. Two additional people can be seen near the frisbee player, one closer to the left side of the field and another on the right side.\n\nThere is also a sports ball visible near the center of the field, likely used for other games or practice sessions. A bench can be seen on the left side of the field, likely used by spectators or players resting between games."}
{"image_id": 518719, "caption": "The image features a large white bowl sitting on top of a table. The bowl has a mix of black and white colors on its surface, making it look intriguing and visually appealing. Positioned next to the table is a chair, adding to the overall setting of the scene."}
{"image_id": 176312, "caption": "The image depicts a woman standing near a wall with a green sign reading \"Tour Stop.\" She is checking her cell phone while she stands there, possibly checking directions or looking up information about an event taking place at Kaysers Auditorium. The woman is wearing a black dress and a purse on her shoulder.\n\nThere are several other people present in the background, but they are not the main focus of the scene. The woman's cell phone is visible in her hand as she engages with it."}
{"image_id": 580746, "caption": "The image depicts a group of sheep grazing on a grassy hillside. There are seven sheep visible in total, spread out across the field as they graze on the grass. Some sheep are closer to the center of the field, while others are closer to the edge, creating a lively scene of animals grazing together in a grassy field."}
{"image_id": 541223, "caption": "The image features a large airplane parked outside an indoor hangar or building, possibly a museum or exhibit. The airplane occupies most of the space, filling up the entirety of the background from left to right. \n\nThe hangar itself has a green roof, and there are several windows along its sides. A sign can be seen close to the hangar, likely providing information about the aircraft or the exhibit itself. Additionally, there are two people visible near the bottom left corner of the image, possibly admiring or observing the aircraft."}
{"image_id": 22589, "caption": "The image depicts two sheep standing together in a grassy area with trees and grass all around them. One sheep is prominently visible in the center of the scene, while the other sheep can be seen slightly behind it on the left side. The grassy field extends across the entire scene, covering the ground and providing a suitable environment for the sheep to graze."}
{"image_id": 196815, "caption": "The image depicts a group of teenagers gathered together in a room, playing video games on a Wii console. There are four people visible in the scene: one sitting on a chair towards the left side of the room, another sitting on the right side, and two others standing in the middle of the room. They appear to be enjoying themselves as they play games together.\n\nThe room features two chairs positioned opposite each other, one on the left side and another on the right side of the room. There are also two additional chairs placed further away from the main group of teenagers. \n\nA few books can be seen scattered around the room, likely books the teenagers are reading or browsing through during breaks from playing games."}
