{"image_id": 226988, "caption": "The image features a person with a black camera, taking a picture of a table with two appetizing slices of cheese pizza on it. The person is likely capturing a close-up view of the food to create an enticing image. \n\nThere are also several other objects in this scene. There is a chair that is partially visible at the upper part of the room, a backpack placed on the floor, another chair at the opposite side of the room, and a dining table close to the person taking the picture. A bench is located in the middle of the room, and a fork can be spotted near the pizza slices in the foreground. \n\nAnother, smaller pizza slice is placed on the same plate as the main pizza slice, creating a delicious-looking setup."}
{"image_id": 337443, "caption": "The image shows a city street with several vehicles and street signs. A large orange construction sign stands out on the sidewalk, warning passersby about the upcoming obstruction. The street features multiple cars driving by, including a stop sign positioned further back than the construction sign.\n\nThe scene captures the busy atmosphere of the city, with various types of vehicles navigating the streets and sidewalks. Among the vehicles in the picture, there is a truck visible in the foreground, and traffic lights can be seen along part of the road."}
{"image_id": 112022, "caption": "The image captures a bustling luggage claim area at an airport with several people gathered around various types of luggage, including suitcases, backpacks, and handbags. The passengers are in close proximity, some standing in line or waiting patiently to collect their suitcase.\n\nThere are numerous suitcases of different sizes and colors, scattered around the terminal. Some are close to the people waiting, while others are located further away. A backpack is among the waiting crowd, as well as two handbags – one positioned on the left side and the other towards the bottom right corner of the image.\n\nTravelers can be seen wearing various clothes, such as a tie that rests within the scene. Meanwhile, a bench can be spotted towards the lower part of the image, providing a place for passengers to sit while waiting for their luggage or other travel arrangements."}
{"image_id": 394444, "caption": "A person is standing on a sidewalk, holding a skateboard with pink wheels. The skateboard has a unique multi-color, swirly pattern on it, making it an eye-catching item. The person is near a railing, likely waiting or preparing to ride the skateboard."}
{"image_id": 481635, "caption": "The image captures a woman sitting at a dining table with a slice of deep dish pizza in front of her. She is happily enjoying her meal with a smile on her face. An entire round pizza is also visible on the table, with several more slices spread around the table.\n\nAnother person can be seen sitting on the far right side of the image. The setting also includes a cup for drinking and another cup placed on the table, possibly for another diner. \n\nIn the scene, there is a spoon on the table, a fork, and a knife nearby, indicating that the diners are prepared for a complete meal."}
{"image_id": 285258, "caption": "The image portrays a playful scene in a fenced-in field, with a group of dogs engaged in various activities surrounding another dog, which is sitting down between two other dogs. There are quite a few dogs in the yard, including the sitting dog, the standing dog, and other dogs located towards the edges of the scene.\n\nTwo of the dogs are wearing bells, adding a whimsical touch to the scene. The two dogs sitting down behind the sitting middle dog seem to be sharing a friendly moment, while the standing dog nearby is playfully interacting with them. The scene is full of energy and excitement, showcasing the delightful interactions among these canine companions."}
{"image_id": 479057, "caption": "The image depicts a serene scene featuring a white polar bear standing in a grassy field. The bear is bending down to eat grass, likely foraging for food. The large field of grass stretches out across the entire image, providing a peaceful backdrop for the solitary bear. The grassy environment suggests the polar bear may live in a protected area or at a zoo designed to mimic its natural habitat."}
{"image_id": 66238, "caption": "The image displays a snowboarder wearing a hat in the air while executing a jump. This skilled snowboarder appears to be having fun while showcasing their skills. The surrounding area features a mountainous terrain, providing an ideal landscape for snowboarding activities.\n\nThere are a few other people in the image, but their presence is smaller and less significant compared to the main snowboarder. The ski lift can be seen in the background, suggesting a well-equipped facility for these winter sports."}
{"image_id": 558458, "caption": "In the image, there are two beautiful smiling Asian girls sitting at a dining table, sharing an enjoyable meal. One of the girls is holding up a plate full of food, which includes a sandwich, hot dog, and spaghetti. The table is well-prepared with plates, cups, and carrots.\n\nA person located in the foreground is wearing a white shirt, while another person is behind them. The scene displays a lively and social atmosphere, with both females posing for a photo with their delicious meal in front of them."}
{"image_id": 400596, "caption": "The image displays a bathroom scene with a green, round vanity sink as its centerpiece. The sink is accompanied by an automatic hand dryer and a towel, possibly a bath towel, positioned nearby. \n\nA second sink can be seen next to the large sink, with another bathroom sink placed just above it. This unique bathroom design features a mix of styles and layouts, enhancing the overall aesthetic of the space. Above the counter, there's a cup on display, and closer to the dining area, there's a bowl placed on the table. The image showcases a full view of the bathroom, providing a visual tour of its various elements."}
{"image_id": 373266, "caption": "The image features a workspace with a person in a control room setting, working diligently at a sound mixing board with many different audio equipment components. This individual is wearing headphones and appears to be adjusting the settings of the sound mixing board.\n\nIn this environment, there are two other people visible in the background. One person is near the right side of the scene, and the other person is located closer to the left side. The first person is wearing a suit, which suggests a professional atmosphere. There are a number of items in the room, including a TV placed in the upper part of the scene and another smaller TV in the upper-middle area. Additionally, there are three keyboards scattered across the workspace, one at the center, another towards the right side, and the third on a small table on the left side."}
{"image_id": 38332, "caption": "In the image, a large gray elephant is walking across a grass-covered field. The elephant appears to be in the shade, enjoying the environment as it wanders through the wilderness. Its long trunk is held down, adding a sense of relaxation to the scene. The elephant seems to be looking behind from the sun shine, giving it a thoughtful and curious look."}
{"image_id": 84533, "caption": "The image features a woman sitting on a big black motorcycle. She has black hair and is dressed in a leather outfit, which is a distinctive characteristic of this scene. The motorcycle occupies a significant portion of the scene, stretching from the center to the bottom of the image.\n\nNotably, a car is visible in the background towards the left side of the scene, adding context to where the motorcycle is parked. The motorcycle's woman rider appears to be proud, posing for a photo next to the powerful machine."}
{"image_id": 449963, "caption": "The image features a well-lit classroom, likely a computer lab setting, with row after row of laptop computers placed on a large table, extending from the middle of the room to the edges almost reaching to the walls. There are multiple laptops positioned in various parts of the table, some closer to the front while others are toward the back. The laptops appear to be part of a study session or collaborative work space.\n\nAround the room, several chairs are scattered, providing seating arrangements for the students. Some chairs can be seen in the foreground while others extend further back into the room, near the laptops.\n\nIn addition to the laptops, a TV can be seen, possibly used for presentations or informational purposes during classes. Overall, this room appears to be a multifunctional area for studying, research, and group work."}
{"image_id": 128180, "caption": "The image features a woman wearing shoes standing next to a white plate. She seems to be enjoying her meal, as there is a large slice of pizza on the plate, which appears on her right side. A fork is positioned to the left of the plate, indicating the woman's intention to eat the meal. Additionally, there is a pizza slice on the plate, located more towards the bottom of the scene."}
{"image_id": 204232, "caption": "The image features a skateboarder skillfully executing a stunt, as he is in mid-air after launching off a ramp or set of steps. He is showcasing his impressive talent and balance while jumping off a block. \n\nThe skateboarder's skateboard is positioned just below him, and there is another skateboard on the ground to the left, as if this is the starting point for the stunt or the skateboarder's current position. The person appears focused and confident in their performance, showcasing the thrilling nature of skateboarding."}
{"image_id": 477867, "caption": "The image depicts a group of five men at a beach, each surfing on their respective surfboards. Three of the men are actively riding the waves, with one of them having a distinctive yellow surfboard. The other two are wading behind the first guy, likely resting or preparing to surf next.\n\nTheir surfboards can be seen with one of them in the front-middle area of the water, another in the middle-right, and the third one positioned further back. Another surfboard lies on the right side of the water.\n\nIn the background, there are a few people scattered, some standing, and others seem to be surfing on their boards or watching the other surfers. Overall, the scene captures the excitement and camaraderie of group surfing."}
{"image_id": 308128, "caption": "The image captures a man skating down a set of stone stairs or a street staircase, wearing a white shirt and grey shorts. He is using a skateboard to maneuver skillfully around the stairs. \n\nThe scene is set in a pleasant park area, with a bench located near the staircase. The setting includes several other individuals visible in the background who seem to be enjoying the park atmosphere as well. The image focuses on the skateboarder as the primary action in the scene."}
{"image_id": 222407, "caption": "The image features a black bird perched on top of a thin tree branch. The bird, with its yellow tail feathers, stands prominently against the rain shower surrounding its location. There is a birdhouse nearby, adding some interest to the scene. The black bird looks observant and alert, possibly taking a moment to appreciate the rainy weather and its surroundings."}
{"image_id": 469543, "caption": "The image depicts a large hotel room with two adjoining double beds in the center of it. The two beds are placed neatly next to each other, making the room appear cozy and comfortable. These two twin beds are positioned in front of a dresser, which serves as a desk area, and a wall-mounted telephone can be seen nearby. \n\nA few chairs are included in the room as well, with one placed near the entrance and another situated closer to the right side of the scene. Additionally, another chair can be found further back in the room, away from the beds."}
{"image_id": 421564, "caption": "In the image, there is a young child dressed in a diaper sitting comfortably in their high chair, eagerly reaching out for a large birthday cake placed on the dining table. The cake has floral decorations and is placed right in front of the child. \n\nBesides the baby in the high chair, there are two people visible in the scene - one on the left side and another on the right. Some kitchen implements, such as a knife, spoon, and fork, are also located on the dining table within the baby's reach. A refrigerator is located in the background, and a bottle can be seen resting on the table."}
{"image_id": 177419, "caption": "An old, rusty fire hydrant is painted in various blue colors, including sky blue, blue green, and white. The hydrant has a unique redesign featuring a train on the side, which adds to its distinctive appearance. It sits on the sidewalk next to a wall with a gate and a building in view. There's also a large blue post near the fire hydrant, which further enhances the scene's colorfulness. Although a stop sign is present in the distance, this old blue fire hydrant is the focal point of the image."}
{"image_id": 86432, "caption": "In the image, there is a young baseball player wearing a blue jersey, holding a baseball bat and standing at home plate, getting ready to hit a baseball in an outdoor game. The scene has a total of eight people present, some of them close to the batter and others observing from a distance, likely as teammates or opponents. One of the spectators is carrying a backpack.\n\nThe setting includes a few chairs placed around the area, suggesting a bench seating area where people can relax and enjoy the game. A sports ball, presumably the baseball, is visible in the air near the batter's feet."}
{"image_id": 544590, "caption": "The image features a couch with an orange tabby cat lying on it. The cat is in a relaxed state with its legs tucked under its body. This adorable cat is situated on the left side of the couch, almost filling the entire space. While the cat appears to be resting, it also seems like the cat might be playing or looking down, possibly intrigued by something in the foreground."}
{"image_id": 513060, "caption": "A person is sitting on a cement bench, eating a frosted, hole-filled donut. Another donut can be seen next to the person, both placed on a piece of cloth. The person appears to be enjoying their delicious treat, surrounded by a handbag and a chair on the bench. The scene conveys a moment of leisure and indulgence as the person enjoys their sweet pastry while relaxing on the bench."}
{"image_id": 140921, "caption": "The image features a white surfboard standing upright on a stretch of sand. The surfboard is lined with paintings of various items, such as a surfer in the water and an airplane. In the sand, several other objects are scattered, including a lone chair positioned to one side, and a cup located closer to the side of the surfboard.\n\nThere is also the suggestion of some advertising painted on the surfboard, possibly detailing a beach rental or restaurant, with the phrase \"beach rentals\" in red color on the surfboard. The overall scene resembles a beach-inspired environment with unique and eye-catching artwork."}
{"image_id": 361351, "caption": "The image features a large, uncut pizza sitting on top of a box placed on a wooden surface. The pizza has veggies on top, indicating it is a veggie pizza. There are several slices missing from the pizza, showing that it has been eaten some. A large bottle of beer is placed near the pizza, ready to be enjoyed with the meal. The combination of pizza and beer creates a cozy and appetizing scene."}
{"image_id": 202154, "caption": "In the image, there is a freshly baked pizza sitting on a wooden cutting board on a dining table. The pizza is covered with various toppings, including tomatoes, cheese, and basil. The focus on the pizza appears to be on the close-up, with a person partially visible in the background on the left side.\n\nThe dining table extends both horizontally and vertically, indicating that it could be a home kitchen table. In addition to the pizza, there is a cup placed on the table towards the top right corner. Near the table's top right corner, there is a second, smaller dining table visible outside of the main focus of the scene."}
{"image_id": 94248, "caption": "The image captures a busy city scene with two large clocks on a tall metal pole, possibly in the middle of the street or near a curb. These clocks stand out against their surroundings, displaying the time for passersby. The pole serves as a clock tower, likely situated in front of a building.\n\nOn the street, there are several people engaging in various activities. Two cars are parked nearby, one closer to the left edge of the scene and the other on the far right side. In the background, near the middle of the image, there appears to be a bus, possibly picking up passengers for their daily commute."}
{"image_id": 200681, "caption": "The scene takes place in a grassy field, where a playful dog can be seen jumping in the air to catch a frisbee. The dog is fully focused and catching the frisbee in its mouth midair. Another dog and a person are standing nearby, watching the action unfold.\n\nAdditionally, there are five chairs scattered around the field, with a couple of them positioned closer to the foreground and others placed further back. A backpack is placed on the ground close to one of the chairs, suggesting that this outdoor area could be a common resting spot or playground for passersby or family activities."}
{"image_id": 532989, "caption": "The image features a giraffe sitting alone in a grassy field or savannah. The giraffe is stretched out and relaxed on the grass, with its legs spread apart. \n\nThe scene appears to be a blend of a real giraffe and some wooden planks on the ground, which could potentially be a part of a zoo enclosure or a diorama. The blending of real elements and planks provides an intriguing and playful effect to the image."}
{"image_id": 565989, "caption": "The image features a beautiful brick clock tower next to a treed area or garden. There are various sculptures of animals and clocks on the tower. Two benches are located nearby the clock tower, one to the left of the tower, and another further off to the right. The clock itself has two faces, making the time visible from different angles. \n\nAbove the scene, there are trees adding a touch of nature to the area. In addition to these eye-catching landmarks, there is a fire hydrant situated close to the top of the scene, blending in with the surrounding environment."}
{"image_id": 67315, "caption": "The image features a man dressed in a blue and white tie, wearing a striped shirt. He appears to be sitting in a dark room, possibly in a chair. There is a notable emphasis on the tie as the scene's focal point. \n\nUpon closer examination, it can be inferred that multiple people are present in the background. However, their features and outlines are relatively indistinct, as they are not the primary subject of the scene. The room itself is dimly lit, making it easier to focus on the man dressed in the blue and white tie."}
{"image_id": 157170, "caption": "The image features a beautiful mountain landscape with five woolly white rams, standing prominently in a grassy field, looking towards a town below. The mountain backdrop creates a striking contrast with the animals and their surroundings. The rams are scattered around the field, showing unique positions and orientations on the hilltop. The picturesque view captures the peaceful coexistence of these gentle creatures in their natural habitat, overlooking the town in the valley below."}
{"image_id": 328786, "caption": "The image shows a long row of public benches positioned against a tree-lined walkway. These benches are neatly arranged next to each other along the sidewalk. The benches stretch almost the entire length of the scene and are of varying height and dimensions. They are likely situated in a park or a similar outdoor space where people can take a break and relax."}
{"image_id": 46011, "caption": "The image shows a small airplane parked next to a gate at an airport, with its propellers still spinning. The plane occupies the left-most side of the scene. A gate is attached to the plane, indicating that it's likely preparing for departure or has recently landed.\n\nIn the background, there is a truck situated close to the left edge of the scene. Additionally, a person is visible on the ground, possibly an airport staff or traveler. There is another smaller aircraft further behind, and another plane can be seen at a distance on the right-side of the plane in front.\n\nThe scene captures the busy atmosphere of an airport as planes, trucks, and personnel move around, ensuring that passengers and cargo are safely and efficiently transported."}
{"image_id": 384348, "caption": "The image shows a person skiing on a snow-covered slope, wearing skis and trekking poles. They appear to be making their way through the snow and enjoying the outdoor activity. The skier is likely navigating a small hill under a cloudy sky, adding an atmospheric touch to the scene."}
{"image_id": 451798, "caption": "The image displays a collection of various ties hanging on a wall at the neck of a person, showcasing a wide range of colors, patterns, and styles. There are a total of 12 ties clearly visible, with some placed closer to the top of the wall or in the middle area.\n\nIn addition, several hats are hanging near the ties on the wall, with two appearing in the right side and one on the left side of the ties. The combination of ties and hats create a unique display and arrangement of these accessories."}
{"image_id": 376545, "caption": "The image depicts a young skateboarder performing a spectacular trick, flying through the air above a skate park. In the background, a young man stands watching the skater's impressive stunt, probably amazed by the daring feat.\n\nA bench is visible to the right side of the scene, providing a surface for skaters to rest or watch their friends perform tricks. Furthermore, a cup is present on the left side of the image, likely belonging to one of the skaters."}
{"image_id": 11538, "caption": "The image shows a person wearing a helmet, sitting on a parked motorcycle. The person is positioned towards the center of the frame, with one leg hanging over the motorcycle. Around the motorcycle, there are two handbags placed to the side, and a backpack is located towards the top right above a tire.\n\nThe person's outfit suggests that they might be in camouflage pants, while the motorcycle is likely cruiser-style, as both elements indicate a biker lifestyle."}
{"image_id": 346207, "caption": "The image features a brown and black cat comfortably laying across a desk surface near an array of computer products. There are no fewer than four computer screens, with one large TV positioned above a smaller screen to the left, and two smaller screens placed below it. \n\nA couple of keyboards can be seen, one in the middle-right area and a smaller one on the right side of the first keyboard. There is also a mouse on the right side of the keyboard arrangement. The computer setup is complemented by a laptop on the left side of the desk, and a variety of books are scattered around the area. Some of these books are positioned on the right side of the shelf, while others can be found near the middle.\n\nAn extra item in the scene is a potted plant, located on the left side of the desk, adding a touch of greenery to the workspace."}
{"image_id": 359238, "caption": "The image depicts a man dressed in a brown jacket sitting down during his commute. He is wearing a yellow shirt and is holding a cup, possibly containing tea or coffee, placed on a surface next to him. The man appears to be reclining on a seat, possibly resting or enjoying his cup of tea.\n\nIn addition to the main figure, there are other elements present in the scene: a spoon can be seen on the table, a cell phone is located in the foreground, and there is an extra person visible near the right edge of the image. A bottle is also present in the background, placed somewhat to the right side of the frame."}
{"image_id": 297610, "caption": "The image captures a boy riding a skateboard outside of a building, possibly under a large enclosed space or at a skate park with ramps. He is skillfully balancing and riding his skateboard on top of a cement wall or a stack of square tiles. The scene showcases the young man's skateboarding moves and demonstrates his talent for performing such stunts."}
{"image_id": 428447, "caption": "The scene depicts a city street with a couple of traffic lights set on a pole. There are two traffic lights hanging from the pole, indicating that the street is an area where a school is nearby. \n\nThere are multiple vehicles on the street, including three cars and a bus. One car is located in the middle of the street, with two cars positioned at either side of the street. A bus is seen near the right side of the street.\n\nThere are several pedestrians present on the sidewalks, with one person standing close to the right edge of the scene, and another near the left side of the scene. The tall buildings in the background give a sense of the cityscape."}
{"image_id": 428769, "caption": "In the image, a car with a plate from California is parked, facing away from the street. An additional license plate can be seen in the foreground, adding a unique personal touch. A parking meter is visible to the left of the car, along with a fire hydrant positioned behind it.\n\nThere are several other cars in various sizes in the scene, parked behind and beside the main car. In the distance, some trucks can be seen, contributing to the busy city street atmosphere."}
{"image_id": 452084, "caption": "The image depicts a meal consisting of a sausage, fried egg, bread, and a few slices of tomato. The sausage and egg are placed in a small dish, while the bread and tomato slices can be seen in another dish next to it. A fork and spoon are also present near the dishes, ready for use.\n\nThe dishes are sitting on a dining table, providing ample space for enjoying the meal. The sausage can be seen in different areas of the dishes, possibly indicating a versatile and hearty meal option."}
{"image_id": 545363, "caption": "In the image, there is a bench sitting on its side in muddy waters near the base of a building. It appears to have been dumped into the pond from the building, possibly as a result of some construction or vandalism.\n\nIn addition to the bench, there is another bench sitting further away from the scene, close to the water's edge with a person nearby. Another bench can be spotted, but it is on the opposite side of the pond in the distance. A few more people are scattered throughout the scene, possibly observing or enjoying the waterfront.\n\nOverall, the scene seems to be a somewhat unusual and unusual gathering of people and benches near the building and pond."}
{"image_id": 77963, "caption": "The scene is set inside a room with a prominent green background displaying a fake field of flowers. In the midst of this eye-catching background, there are two large cow heads situated upwards, as if riding the ceiling or floating in the air. These intricately painted cow heads appear to be the central focal points of the room.\n\nAdditionally, there are a few other decorative items in the room, including a chair, a potted plant, a few vases, and a book. These decorations provide a cozy, artistic atmosphere for the space."}
{"image_id": 78093, "caption": "The image showcases a woman trekking through the snow on skis, smiling as she enjoys her skiing experience. She is situated in the center of the frame, with a pair of skis visible in front of her. The woman also has a backpack with her, which is visible as she skiis through the snow.\n\nThe terrain appears to be covered in snow, creating a perfect environment for skiing. A tree can be spotted in the background, adding to the wintry scene. The image captures a joyful moment in the skier's life as she takes a break from skiing to appreciate the beautiful surroundings."}
{"image_id": 346334, "caption": "The image depicts a serene field near a hillside where several brown animals are spotted grazing. These animals include brown bears, which create a contrast against the landscape. There are at least three bears in the scene, with two of them closer to the center and one on the far right side.\n\nAnother pair of animals can be seen grazing close to each other on the right side of the image, but their presence cannot be confirmed without more visual information. The various animals are roaming through the natural environment, enjoying the abundance of sunlight and vegetation."}
{"image_id": 185633, "caption": "The image showcases a bathroom with a beige bathtub situated near the white sink. There are several bottles placed around the tub area. The view is slightly blocked by an open towel rack hanging near the tub, but items such as toiletries and bottles are still visible. Additionally, a toothbrush is found towards the right end of the scene, further emphasizing the bathroom setting."}
{"image_id": 327165, "caption": "The image features a man skilled at cutting little boys' hair in a salon. In this particular scene, he is grooming the head of a young child sitting comfortably on a chair. The man is using a pair of scissors to cut the child's hair, making sure to apply precision and care to the delicate work.\n\nThe salon has a cozy and spacious atmosphere, with a couch placed in the background to the right, and a potted plant standing near its corner. The presence of multiple chairs suggests that it can accommodate more clients comfortably."}
{"image_id": 410632, "caption": "The image depicts a baseball field with three players posing for a shot. There are two of them on the left side and one on the right side of the field. One of the players is holding a baseball, as they appear to be getting ready for the game. The field is surrounded by a crowd, likely spectators of the game, creating a lively atmosphere."}
{"image_id": 468471, "caption": "In the image, two people are in a room with several items. One person appears to be flying through the air near a bed, possibly performing a jump or an acrobatic feat. Another person is holding their arms out, possibly preparing to join or watch the flying individual.\n\nThe room features a large bed towards the center of the room, surrounded by various objects. There is a chair positioned on the left side of the room, along with a dining table located further back. An array of books can be seen on the table, with several hanging at different heights, suggesting they may be on a shelf or being arranged for a reading session. There are also two handbags in the room, one placed closer to the flying person and another further away, near the other person.\n\nThis scene captures the energy of the people participating in the activity, with the flying individual and the holding person possibly engaging in sports or games involving the use of a sheet."}
{"image_id": 241317, "caption": "The scene takes place on the side of a narrow dirt path, where a man is sitting and pulling a three-wheeled cart filled with a variety of fruit, including bananas and apples. There are numerous bananas scattered around the cart in different locations and sizes, and several apples are also visible. In addition to the fruit, there is a bowl present on the cart.\n\nThe man sits on the cart and works as a vendor of fresh fruits in the area, attracting the attention of customers who might be interested in his produce. The cart and its contents make for an eye-catching and inviting display."}
{"image_id": 444982, "caption": "The image captures a lush green field where a curious zebra can be seen near the tree trunks. The zebra is standing in the field and looking at something which may not be easily seen by the camera. A couple of zebras are visible in the background, standing close together amidst the green grass. There's also a giraffe, located far to the left, which is partially hidden by the tree. The scene includes abundant fresh grass in the field, making it an ideal pasture for these animals."}
{"image_id": 117563, "caption": "The image depicts two men in a living room playing a video game using remote controllers. One man is standing and the other is sitting, both of them fully engaged in the game. One of the men is holding a game controller in his hand, while the other has one placed in front of him. \n\nThe living room has a couch and several chairs around, providing seating options for the players and onlookers. An array of objects like bottles and a remote control are also visible in the scene, adding to the casual atmosphere of the players' gaming session."}
{"image_id": 206579, "caption": "In the image, there are two people standing in a room with a dining table. A man is leaning down to blow out candles on a birthday cake placed on the table. Another person is standing near the main focus, possibly observing or participating in the celebration. \n\nIn addition to the main cake, another smaller birthday cake is present on the table. A pair of scissors is also visible on the table, most likely for cutting the cake. A chair is located near the table, suggesting that people may sit for the celebration."}
{"image_id": 221172, "caption": "The scene features a male tennis player on an orange court, fully engaged in a tennis match. He is holding a tennis racket and approaching a tennis ball, preparing to hit it. His position suggests that he is in the follow-through phase after completing a backhand swing.\n\nIn the background, there is a woman sitting on one side of the court, possibly watching the match or waiting for her turn to play. A chair is also visible near the upper left corner of the court, probably for players or spectators to sit on during breaks."}
{"image_id": 317969, "caption": "The image features a large herd of sheep of different sizes, some walking and some laying down, grazing in a grassy field. There are several sheep laying in the field in various positions, while a few others are walking across a dirt road. Some of these sheep have grazed closer to the road, while others are found in the grass more towards the center of the field. The animals are distributed throughout the field, creating a lively and busy appearance."}
{"image_id": 82150, "caption": "The image features a person sitting on a sofa, holding two white video game controllers in their hands. They appear to be smiling while holding the controllers, suggesting that they might be enjoying a gaming session. The controllers are clearly visible in the scene, with both held in front of the person.\n\nAdditionally, there is a cup placed to the right of the person on the sofa, indicating they might be having a drink while gaming. The scene gives a sense of relaxation and enjoyment for the individual engaging in the video game."}
{"image_id": 284064, "caption": "The image depicts a man wearing shorts and a grey and white shirt, standing on a tennis court and hitting a tennis ball with his racket. He is holding the racket in a ready position, waiting for the ball to come his way.\n\nIn the scene, there are other people present, possibly spectators or opponents. On the court, you can also see the sports ball a few times, suggesting the possibility of ongoing play or practice."}
{"image_id": 372203, "caption": "The scene features a bench sitting on a sidewalk outside, possibly at a park with a shaded pavilion. The bench offers a comfortable place for visitors to rest and enjoy the pleasant surroundings. In the image, there are various elements of the pavilion, which has a white canopy structure over part of the bench. A fire hydrant is also visible beside the bench, as well as in the background.\n\nThere are several people in the scene, which suggest that the area may be a popular spot for leisure and relaxation. Some of the people could be visitors at the park, possibly socializing or engaging in different activities such as walking or sitting by the bench."}
{"image_id": 359136, "caption": "The image features a topless woman lying on the floor in front of a bathtub, appearing to be getting out of it. She has her feet placed on the edge of the tub, with a pair of cowboy boots on her feet. The bathroom has a sink nearby, and there is also a toilet in the background. Additionally, there are a couple of books scattered around the room, with one on the floor in front of the bathtub and the other one placed above the sink and toilet. This setting may represent a moment of relaxation or unwinding after a bath."}
{"image_id": 499281, "caption": "The image features a well-organized household kitchen with a gray stove-top oven prominently positioned in the center. Above the stove, dishes and bottles are placed for easy access. In total, there are six bottles around the kitchen.\n\nTo the right of the oven, a microwave is present, as well as a sink which is located towards the left of the kitchen area. The kitchen is equipped with multiple pans, with five pans placed on the countertop in various sizes. A toaster and an apple (on the left side of the counter) are also visible, indicating a user's daily kitchen essentials."}
{"image_id": 192233, "caption": "A man is holding a tennis racket in front of him, and he appears to be running or jumping on a tennis court onto the clay surface. He is about to hit a ball floating above him. Both the man and the tennis ball appear to be the main focus in the image."}
{"image_id": 11987, "caption": "The image shows a bright, airy room with different kinds of furniture that are arranged in a neat and orderly fashion. In one corner of the space, there is a bed with a rug next to it. There are four chairs spread across the room, and two dining tables placed in the area as well.\n\nA coffee table with a pair of books sits on one side of the room. Multiple chairs are also found around the living space, providing ample seating for guests. The room also features a stunning view of tulips, further enhancing the aesthetic appeal of the area.\n\nAdding to the overall decor, the room features multiple lamps and an elaborate fireplace, reflecting a cozy ambiance. On one of the walls, there's a painting that complements the room's beautifully put-together atmosphere."}
{"image_id": 406810, "caption": "The image captures a conference room setting where a person using a laptop can be seen in a chair, surrounded by several other people. The individual is typing on their laptop, likely participating in the ongoing discussion or presentation.\n\nIn total, there are about 14 people in the conference room, some sitting on chairs and others standing. Some chairs are positioned around the room, and there are several handbags placed near their owners. There are three TVs in the room, one occupying the back of the image, one positioned towards the top area, and another smaller TV further back on the right side. A couple of clocks can be found in the scene, one on the upper left hand corner and the other near the top middle area."}
{"image_id": 99965, "caption": "The image features a plate covered with a white cloth, containing a delicious meal of a club sandwich and potato chips. The sandwich is cut in half, with one piece sitting on the left side of the plate and the other piece placed above it. The potato chips are scattered around the plate in various levels of coverage, creating a colorful and tasty presentation. The plate itself is the dominant feature in the scene, filling the majority of the image."}
{"image_id": 17328, "caption": "The image captures a red passenger train traveling down the train tracks. The train takes up a significant portion of the image, running across the majority of the scene. The background shows the train on a track situated underneath a steel awning, possibly an airport structure.\n\nThere is a single person visible in the scene, standing behind the train, possibly observing its activity or waiting for it to pass."}
{"image_id": 393682, "caption": "The image shows a close-up view of a delicious piece of cake on a white plate. The cake has white cream frosting and is topped with red strawberry icing. The plate sits on a dining table, accompanied by a silver fork, which is positioned slightly to the left of the fork's handle end.\n\nApart from the cake and the fork, there is also a spoon on the table, placed to the left of the fork. This arrangement suggests that the person who enjoys this meal is ready to indulge in a delightful dessert time."}
{"image_id": 540093, "caption": "The scene depicts a car covered in a clear plastic tarp, parked along the side of the street. The car appears to be on display and is the main focus of the scene. The car show is happening at an intersection, with people passing by and taking in the exhibition.\n\nThere are also several pedestrians walking at different distances from the car, with some closer to the foreground and others further back. In addition to the people, a potted plant is visible near the center of the scene, enhancing the outdoor display atmosphere.\n\nMoreover, there are several vehicles, including cars and a truck, parked or passing by in the image, indicating a bustling street scene. A few umbrellas can also be observed, contributing to the outdoor-exhibition feel."}
{"image_id": 242400, "caption": "The scene features an older woman posing next to a unique clock on the corner of a sidewalk. The clock appears to resemble a Christmas tree, and it's surrounded by a large bow. The woman is standing close to the clock, giving the impression that she may have taken a picture in front of it, possibly on a date.\n\nVarious vehicles can be seen parked nearby, including a car positioned on the left side of the image and a truck towards the top-left. Another truck and a car can be seen in the background and a lamppost can be seen in the distance. There is also a handbag located beside the woman, possibly belonging to her."}
{"image_id": 409009, "caption": "In the image, a modern commuter train is parked at a train station. The train showcases a distinct arrow shape, which is a characteristic feature of Japanese bullet trains. The train is pulled next to the platform, where there are multiple sets of stairs leading down to platform level. \n\nThere is a person looking downwards near the train, likely curious and waiting to board or passing by as well. Above the station, two large clocks are visible, providing information on train scheduling and the current time to travelers at the station."}
{"image_id": 6091, "caption": "In the image, a female is holding up a paper square in front of a stop sign, likely pasting on the paper as part of an art project or a demonstration. The stop sign is illuminated with a bright light, which emphasizes the presence of the paper square. There is another person in the background, further enhancing the sense of activity and collaboration in the scene."}
{"image_id": 42834, "caption": "In the image, a woman with white hair sits at a dining table, engaged in making sandwiches with ingredients placed in front of her. There is a plate with various cut ham pieces and an orange tube of ham on the table, as she cuts the meat into bite-sized pieces. The table is occupied with several cups, which she may use for holding the ham, sauce, or other ingredients. Another person can be seen at the edge of the scene, possibly assisting the woman in her endeavors or observing from close proximity."}
{"image_id": 433554, "caption": "The scene at the beach is filled with people engaging in water activities, surrounded by beach chairs and a boat. There are four people sitting on a boat, observing the excitement. Meanwhile, a group of people is on water skis or other sports equipment, as they are pulled through the water.\n\nThere are several individuals on the beach, with a couple of them actively water skiing on surfboards. In total, there are about a dozen people in the scene, capturing the lively and social atmosphere of the watersports experience."}
{"image_id": 174987, "caption": "The scene features a train covered in a vibrant graffiti mural that stretches across its exterior in various shades of blue and purple. The train's side is covered with artistic blue and graffiti, making it look like a work of modern street art.\n\nIn the background, there is another train visible at the right side of the scene, but the primary focus is the first train adorned with the eye-catching graffiti."}
{"image_id": 116208, "caption": "The image features a restaurant scene with a dining table filled with various items. There are three pizzas placed on the table – one larger pizza near the center-right and two smaller pizzas on the left side. Along with the pizzas, several bottles, likely containing wine, are scattered around the table, and there are wine glasses in different positions as well. Additionally, there are three cups placed on the table.\n\nThe dining space is furnished with chairs surrounding the table, and a person can be seen sitting in one of them. Cutlery is present, with forks, knives, and a spoon on the table. \n\nA pizza pan can also be seen in front of the table, while a cake appears to be positioned on the far left side of the image. There are various dishes in different areas of the scene, indicating a busy and lively atmosphere."}
{"image_id": 80131, "caption": "The image depicts a man and woman standing in a kitchen, engaged in conversation. They are both wearing glasses. The kitchen is equipped with numerous appliances such as a microwave, oven, and a sink. A refrigerator is also visible in the background. \n\nVarious items can be seen scattered throughout the room, including a book, a wine bottle, a knife, a spoon, and multiple cups. A clock is hanging on the wall above the appliances. There is also a bowl placed on a surface near the woman. Besides these items, a chair is visible in the scene."}
{"image_id": 310663, "caption": "The image depicts a rusty, old train on a long stretch of railroad tracks. The train is mostly orange with some blue windows. The train occupies two-thirds of the photo, stretching from the center towards the right side. \n\nThere is one person standing near the left portion of the train, possibly admiring its old and dirty condition. Additionally, two clocks can be noticed on the train, one closer to the center and the other on the right side, suggesting that this train might be a vintage vehicle with historical significance."}
{"image_id": 100138, "caption": "In the image, there's a motorcycle parked on a street with a gravel driveway leading to it. The parked motorcycle is a prominent and eye-catching element in the scene. It is equipped with two headlights, one above and another on each side of the motorcycle.\n\nAside from the motorcycle, there is a pair of scissors visible in the scene, possibly indicating a gardening or yard maintenance activity being carried out nearby. There are also two clocks placed in the background, possibly to help keep track of time, with one clock closer to the center of the scene and the other further back. The motorcycle dominates the image as it captures the viewer's attention."}
{"image_id": 415613, "caption": "The image depicts a man wearing a sliced football jersey shirt standing in a commercial kitchen, preparing food. He is focused on slicing and dicing an eggplant, which he is holding with a knife in his hand. Multiple knives can be seen on the countertop, indicating that he may be preparing a variety of dishes.\n\nThe kitchen is equipped with various utensils and items such as a spoon, bowl, and a cell phone. There are cars visible outside, possibly delivering or picking up food items for this busy kitchen. The overall scene presents a man skillfully creating a delicious meal in a well-stocked, commercial kitchen."}
{"image_id": 214737, "caption": "The scene is set in an architecturally significant building with a high ceiling, featuring statues on the pillars and intricate arched windows. The ornate building has a large clock hanging on one of its walls, and two lighted globed lights on the columns, which illuminate the area.\n\nThe clock, being the main attraction, is easily noticeable and highlighted as a prominent decorative element in the building. Several people can be observed in various positions around the building's interior, possibly admiring the artwork and architecture. Some of them are closer to the statues, while others are near the clock or in the central part of the room. The overall atmosphere suggests a museum or a tourist attraction showcasing an exquisite architectural setting."}
{"image_id": 172718, "caption": "The image is a vintage black-and-white photograph of a young boy dressed in formal attire. He appears to be sitting and staring at something in the picture, with a serious expression. He is wearing a jacket and a tie, which suggests he may be at an important event or function.\n\nIn the background of the image, there is a tie visible, which suggests the photo may have been taken at an event or location where formal attire was prevalent. However, the main focus is on the young boy dressed in his formal clothing, capturing a moment from a bygone era."}
{"image_id": 99186, "caption": "The image features a red stop sign prominently standing in the middle of an empty, rural countryside during a sunset. The background is characterized by a vast landscape made up of grass and a few distant vehicles. A truck is visible on the far left, while another truck and a car can be seen further down the road further to the right. As the sun goes down, it casts a dramatic backdrop for the stop sign, enhancing its prominence in the scene."}
{"image_id": 3580, "caption": "The image shows a young man sitting comfortably on a black sofa, playing a video game. He is holding a game controller in his hands while engaged with the game. A dining table can be seen in the background, with chairs placed around it. \n\nAdditionally, there are two bottles situated near the edge of the room, and a cell phone can be seen resting on a surface. Besides the sofa and chairs, there is a cup placed on a surface in the room. A stack of books rests on a surface, seemingly part of a library on the side."}
{"image_id": 526044, "caption": "The image features a brown and white cow standing in shallow water at the beach near a grass-covered shore. The cow appears to be enjoying a momentary respite from the ocean waves, staring ahead as it ponders the surroundings. \n\nAdditionally, there are some birds visible in the background, one close to the right side of the cow and another further to the left. The serene setting creates an idyllic atmosphere for the cow as it gazes over the water."}
{"image_id": 105291, "caption": "This image features a white metal pole with two rectangular signs attached to it. One of the signs reads \"Schoolhouse\" and the other displays the word \"Stop\" in big, red letters. The pole is next to a building with a driveway that leads to it. \n\nBelow the pole, there is a white car parked in front of the building, likely suggesting someone has pulled over and parked there. The back of the white car is visible with its rear end extending across a part of the image."}
{"image_id": 577169, "caption": "The image features a group of people standing on a balcony and looking out at the large, magnificent clock tower through glass windows, capturing the reflection of the giant clock. Among them, there are nine people in total who are spread across the scene, some closer to the clock while others are slightly further away. They seem to be admiring the architecture and the view of the town from their vantage point above.\n\nTwo of the people in the group are wearing ties, visible on their upper bodies, adding a touch of formality to the moment. Overall, the scene conveys a sense of wonder and appreciation for the clock tower's stately presence and historical importance."}
{"image_id": 181574, "caption": "In the image, a man is sitting at a dining table in a restaurant, getting ready to eat a slice of pizza with pepperoni. He is using a fork to pick up the pizza slice rather than using his hands. The table features two plates and some more pizza on it, indicating a shared meal with another person.\n\nAnother person can be spotted on the left side of the table, and additional items on the table include a cup, two knives, and two cakes. A chair is also present near the dining table, suggesting that the people gathered around it are sharing the meal together in a casual setting."}
{"image_id": 83441, "caption": "The image is a split-panel view of a cozy living room filled with various furniture and items. There is a couch located on the left side of the room and another couch on the right side, both accompanied by several pieces of furniture as well. On the left side of the room, there is a TV, and on the right side, there are two books placed neatly.\n\nAdditionally, there are some bottles and bowls placed around the room, with bottles near the left side, and bowls on the right side. Also present in the room is a keyboard and a keyboard stand located closer to the right side of the right photo. Overall, the living room is well-equipped for various activities and comfortable for its occupants."}
{"image_id": 130527, "caption": "The image features a grassy hillside with a herd of black and white cows standing on a lush green field. There are ten cows in total, grazing and enjoying the peaceful surroundings. \n\nThe hillside is bordered by a barbed wire fence, indicating that the fenced area is a designated grazing area for the cows. The picture provides a serene environment with the cows spread out, roaming pastureland under a clear blue sky. There is also a chair visible in the distance towards the left side of the frame."}
{"image_id": 86471, "caption": "In this scene, a man in a blue shirt and white shorts is playing tennis on a blue court. He has just swung his tennis racket to hit a tennis ball that was in mid-air. Another sports ball can be seen further away, positioned near one of the edges of the court. The man appears to be fully engaged in the action of the game."}
{"image_id": 105737, "caption": "The image displays a large bookcase filled with a variety of books and a stuffed teddy bear placed amongst them. The variety of books, which are both thick and thin, come in different colors, creating a visually rich scene. The teddy bear, located in the center of the bookcase, appears to be a part of the bookshelf decoration, bringing a touch of warmth and playfulness to space."}
{"image_id": 212842, "caption": "The image showcases a beautiful scene of a large group of zebras standing together in a grassy field. There are eleven zebras in total, with some closer to the foreground and others positioned further back. The zebras are gathered around a tree, possibly searching for shade or finding water nearby.\n\nThe field they are in is vast, extending far into the distance. In the background, a beautiful mountain range can be seen, providing a picturesque backdrop for the zebras gathered in this lush, natural setting."}
{"image_id": 105220, "caption": "In the image, we see two snow skiers standing on a snow-covered slope, wearing skis and posing together under a red canopy. They are standing next to one another, surrounded by a mix of blue and purple signs, as well as two more sets of skis next to them.\n\nThe skiers have smiles on their faces, while one of them is holding a pair of skis upside down to showcase their unique design. The scene appears to be a fun and leisurely atmosphere as the skiers enjoy the snowy surroundings."}
{"image_id": 490701, "caption": "The image depicts a person sitting down, eating ice cream and a chocolate dessert at a dining table. The person is using a fork to take a bite from the dessert, which appears to be a chocolate cake. Nearby, an ice tea is placed on the table, and a chair can be seen close to the dining table as well.\n\nAdditionally, there is a cup placed at the left edge of the table, and a cell phone and a book are present on the table as well, suggesting that the person may be multitasking during the dessert meal."}
{"image_id": 368961, "caption": "The image depicts a zoo setting with several large elephants standing outdoors in a sandy area near a barricade. Two elephants can be seen more prominently, while the third elephant is positioned further back in the pen. A ball is located amidst the elephants, inviting them to play and engage in natural behaviors.\n\nIn the background, another person is present, likely a visitor observing the scene or taking care of the animals. The person appears to be located near the left side of the image, observing the group of elephants."}
{"image_id": 520892, "caption": "A woman is enjoying a hot dog as she poses for the camera, holding it with both hands. She is wearing sunglasses and appears to be smiling in front of a blue sky. The hot dog itself is quite large, making it the main focus of the image.\n\nThe background showcases a park, with the woman positioned in front of it."}
{"image_id": 113354, "caption": "This image captures a group of three zebras in a zoo exhibit grazing on grass. They are eating their food in a pen surrounded by several tropical plants. The first zebra is on the far left, the second is situated towards the center, and the third zebra is farther right in the picture. All of the zebras seem content with their food as they eat together."}
{"image_id": 33652, "caption": "The image showcases a large sliced pizza sitting on a pan, placed on a counter. The pizza is topped with a generous amount of white cheese, making it look delicious and cheesy. \n\nThere are several carrots scattered around the top and the side of the pan, adding a vegetable element to the cheese pizza. Some of the carrots are closer to the pan's edge, while others are positioned slightly more towards the center. Overall, the focal point remains the cheesy and carrot-topped pizza sitting on the counter."}
{"image_id": 511153, "caption": "The image showcases a big freight train moving along the tracks. The train, mostly composed of blue and orange colors, is carrying various vehicles such as boxcars and a passenger car. The train is parked next to another set of tracks, allowing for multiple trains to run simultaneously on the railroad. Among the vehicles, four cars are prominently visible, with two being boxcars and two being open cars. The train provides an efficient means of transportation for the cargo and passengers it carries."}
{"image_id": 328957, "caption": "The image features a cat resting at the top of a multitiered, multi-colored cat tower, occupying a higher level of the structure. The cat appears to be in a relaxed position, enjoying the elevated view and space of the tower.\n\nApart from the cat and the cat tower, there is a teddy bear situated on the bottom right side of the space. Further to the right, a book rests on a surface, indicating a reading area. Overall, the scene displays a cozy environment for both the cat and the teddy bear."}
{"image_id": 190015, "caption": "The image features a pile of hay next to a large pile of straw on a dirt patch. The hay mound rises above the ground, making it the dominant element in the scene.\n\nThere is a truck parked on the right side of the hay pile. The truck appears to be green and is driving near the hay mound. The entire scene has a picturesque setting."}
{"image_id": 244925, "caption": "The image features a person standing outdoors and holding a banana in their pack. The banana is peeking out from the pack, and the person is in possession of a camera. They are standing near a body of water, most likely a beach or lake. The scene appears to be a beautiful summer day with the person enjoying their time outdoors."}
{"image_id": 29406, "caption": "The image features a large wooden park bench situated in the middle of a residential neighborhood. The bench is surrounded by bushes, creating a peaceful and inviting atmosphere for relaxation or conversation. Some small trees can also be seen in the vicinity, adding to the charming ambiance of the park area. \n\nIn the background, there is a brick house situated at the edge of the view, further establishing the residential setting. The vibrant scene includes a person on the far right, possibly enjoying the park or the view. There is also a fire hydrant near the bench, likely located close to an existing driveway or path."}
{"image_id": 32570, "caption": "The image captures a man skillfully riding a surfboard on a large wave in the ocean. He is leaning forward while maintaining control of the surfboard, likely preparing for an upward movement in the powerful wave. The ocean scene depicts the surfer's athleticism and determination to maintain balance and navigate the challenging wave."}
{"image_id": 260608, "caption": "The image captures a group of young girls playing soccer on a field, enjoying a friendly game among themselves. There are several girls in the scene, some of whom are actively chasing the soccer ball while others are standing or walking around the field. Two soccer balls can be seen, one closer to the foreground and the other one toward the middle of the field.\n\nThe girls are dressed appropriately for the game, which takes place on a pleasant day. The kids are engaged and having fun during this outdoor adventure."}
{"image_id": 291286, "caption": "The image depicts a man skateboarding down the center of a narrow, pedestrian-dedicated, city street. He is skillfully leaning on his skateboard while riding through the shopping area surrounded by numerous people on the sidewalks. In total, there are 12 people visible in the scene, likely out for shopping, socializing, or going about their daily routine.\n\nAdditionally, there are a few handbags scattered around the street, suggesting that some visitors may be shopping. Three umbrellas can also be spotted, likely used by shopowners or pedestrians to provide shade from the sun or shelter during occasional light rain. The street seems generally busy and lively with people engaging in various activities."}
{"image_id": 375278, "caption": "The image features a small black dog sitting or standing inside an open suitcase. The dog appears to be curious about the confined space and is likely investigating the luggage. The dog has its head above the suitcase, occupying a significant portion of it.\n\nIn the background, there are two people present, one closer to the top left corner of the suitcase and the other further back, seemingly more obstructed from view. A third person seems to be standing behind the dog at the top of the image."}
{"image_id": 290684, "caption": "A woman in purple is holding a large pink teddy bear against a telephone pole. She appears to be posing for the picture with the pink teddy bear placed on her chest. There is another small pink stuffed animal also present in the scene. The woman's outfit consists of a white shirt and a purple dress. There is another small teddy bear located to the right of the woman, and a chair can be spotted in the far left of the image."}
{"image_id": 29306, "caption": "The image features a beautiful brown dog standing on the sand near the ocean. The dog appears to be a well-trained and content canine, possibly waiting for its owner to return. The dog is wearing a collar and is facing the clouds above the vast expanse of the sky. The image captures the dog's gaze and offers an expansive view of the natural environment surrounding it."}
{"image_id": 173375, "caption": "The image depicts a skier navigating a snow-covered mountain slope, wearing a gray jacket and a helmet for protection. The skier is on their snowboard, skillfully turning their way down the mountain. In the background, more people are skiing and enjoying the scenic landscape. The presence of multiple skiers and snowboards indicates that this area is a popular spot for outdoor winter sports enthusiasts."}
{"image_id": 198590, "caption": "The image features a brown pickup parked next to a silver car, with its window opened slightly. A cardinal is perched outside the car window, making a surprising appearance in the scene. The car appears to be a silver sedan or trunk, and there are a mix of different vehicles in the background, including trucks located on both sides of the car. Apart from that, there are a couple of bottles placed near the pickup, and a few chairs can be seen scattered around the area."}
{"image_id": 25747, "caption": "The image features a rust colored passenger train traveling down the tracks in a forested area. The train is traveling on one of the tracks and appears to be either leaving a red traffic signal or going through it. Two cables can be noticed in the scene, with one following the train tracks and the other running horizontally above them. Additionally, a truck is visible in the background, possibly parked or moving, creating a rural atmosphere."}
{"image_id": 346589, "caption": "The image features two people on a flat hill or snowy area with snow-covered ground. One person is standing with their snowboard on their feet, while the other person, an adult and a kid, is kneeling down with their snowboard. They seem to be enjoying their time or possibly working on a snowboarding trick.\n\nThere are also a couple of snowboards visible in the scene. One snowboard is laying on the snow, and another one is located in the vicinity of the standing person. This outdoor activity provides an opportunity for the two individuals to bond and have fun, taking part in the winter sports of snowboarding."}
{"image_id": 121106, "caption": "The image depicts a busy airport environment with numerous people gathered around the baggage claim area. They are waiting for their luggage to come out of the baggage claim area. Some individuals can be seen standing near the luggage carousel, while others are waiting in various positions throughout the scene.\n\nAirlines have placed their baggage carts both at the luggage carousel and on the ground to assist in moving luggage for the travelers. There are suitcases and handbags in the scene, with multiple suitcases placed around the luggage carousel and other bags scattered across the scene. It appears that people are preparing to leave the airport to continue their travels, as their checked luggage is being unloaded."}
{"image_id": 392850, "caption": "The image showcases a wooden cutting board topped with several fruits, including two apples, a banana, and sliced oranges. One of the apples is larger and positioned near the center, while the other is smaller and situated on the left side of the board. The banana is positioned on the right side of the scene, taking up a significant portion of the space. \n\nAccompanying the fruit are a knife and a spoon, placed further right on the cutting board. The knife appears to be the main tool used for slicing, while the spoon might be there for serving or scooping. Overall, the scene presents a cozy, healthy atmosphere with a focus on enjoying fresh fruit."}
{"image_id": 554241, "caption": "The image shows a large group of people walking on a paved sidewalk, making their way through a park-like setting. Among them, one woman is prominently holding a homemade sign above her head, possibly indicating a protest or awareness event. She stands out from the crowd, capturing attention.\n\nSeveral other people are visible around her, participating in the event or simply walking along the sidewalk. There is also a person holding an umbrella, possibly prepared for rain or shielding themselves from the sun.\n\nIn the scene, there are also a couple of cars nearby, parked along the street. Handbags can be spotted, likely belonging to some of the people in the group."}
{"image_id": 341017, "caption": "The image features a large white van with a blue toolbox on its back filled with a herd of horned animals. There are several cows, including goats with massive horns, occupying the top of the truck. A man wearing earphones can be seen in the back of the truck, possibly tending to the animals or providing care. The other parts of the truck are occupied by these animals, making the scene appear to be quite bustling. The man is likely overseeing the journey and ensuring the safety of the animals during transport."}
{"image_id": 135497, "caption": "The image is a black and white photo of a man sitting at a table in a restaurant or bar. On the table are multiple bottles, likely containing wine, as well as other beverages. The man has his hands out, possibly making gestures or reaching for something.\n\nAround the main man, there are several cars visible in the background, with some being closer to the foreground and others in the background. The cars seem to be the main point of interest outside the focus on the person and the table."}
{"image_id": 159260, "caption": "The image depicts a large blue and orange train driving down a railroad track. The train engine is adorned with various patriotic elements, making it a notable sight. The track is located near a brick building, possibly indicating the presence of a station or a busy area.\n\nApart from the train, a few American flags can be seen near the train tracks. The train is moving swiftly, taking up a significant portion of the image as it travels down the track."}
{"image_id": 417332, "caption": "The image shows a baseball scene on a field, with a player in the role of a pitcher. He is standing on a mound, throwing a sports ball towards the batter. Another player is visible in the background, possibly watching the pitch or preparing to catch the ball if needed. The action and anticipation of a baseball game are reflected in this scene."}
{"image_id": 90520, "caption": "The image features several teddy bears dressed in traditional Japanese attire, sitting on chairs and standing on display. The dresses worn by the teddy bears have floral patterns, adding to their cultural charm. In addition to the teddy bears, there are also other small accessories and trinkets visible, such as a tie and a gold watch. The teddy bears, one of which is positioned more towards the left and another on the right, exude a sense of character and attention to detail, showcasing these delicate creations."}
{"image_id": 318524, "caption": "The image features an old rusty silver rail vehicle, situated next to some grass. This worn-out vehicle seems to have no windows on its sides, with rust taking over many parts of its exterior. There are several rusted square shapes on the train car, indicating its age and exposure to harsh weather conditions.\n\nThe rail car has a large, open area with a view of the sky behind it, showcasing its aged appearance in contrast with the bright blue sky behind it."}
{"image_id": 118406, "caption": "The image captures an exciting moment on a field of a man trying to get a soccer ball. He is wearing colorful red, white, and blue striped uniform, possibly representing different teams like Man United and Ireland. Another player is blocking or kicking him in an attempt to prevent him from taking possession of the ball. \n\nSeveral other people can be seen around the field, possibly fellow soccer players or bystanders, but they do not appear to be actively participating in the ongoing game. The scene is filled with the energy and excitement of a soccer match."}
{"image_id": 25748, "caption": "The image features a large sailboat with a dark wooden background. A rope can be seen in the foreground that is woven through the sailboat's body. The boat has a prominent sail on the top, and the image captures the essence of this majestic vessel. Alongside the main sailboat, there are two additional smaller boats located in the scene."}
{"image_id": 365557, "caption": "The image features a snowboarder riding downhill in the snow, demonstrating impressive skills. The person wearing a blue coat is gliding quickly down the mountain on a snowboard, maintaining control and balance as they carve through the packed snow."}
{"image_id": 320978, "caption": "The image presents a vegetable market featuring a large assortment of fresh items displayed on a table. The table is filled with a diverse selection of veggies, including carrots, broccoli, mushrooms, cauliflower, tomatoes, squash, cucumber, green beans, and zucchini. The vegetables are arranged in various positions across the table, making it visually appealing to customers.\n\nTwo people are present in the scene, with one person located on the left side of the image, and the other person is standing closer to the center. The people are likely browsing or possibly interacting with each other in this lively produce market."}
{"image_id": 315073, "caption": "The image features a light grey cat with its mouth open and eyes wide, sitting on top of a sweater. The cat appears to be either resting or yawning as it lays on the piece of clothing positioned on a window sill.\n\nIn the background, there is a vase near the left edge of the image. A potted plant can also be seen further to the left. Additionally, smaller figures of people are visible at the edge of the scene on both the left and right sides."}
{"image_id": 363927, "caption": "The image features a long and narrow city bus driving down an empty road, most likely along a highway. There are no other vehicles visible in the scene, giving the sense that it is a relatively smooth and empty commute.\n\nThe bus is spacious enough to accommodate a significant number of passengers. The bus, occupying most of the image, is situated in the center of the frame, with a gate-like structure in the foreground and a building in the background. Additionally, there are a few traffic lights located at various points throughout the image, indicating that the road is well-monitored for safety."}
{"image_id": 243355, "caption": "In the image, there is a lone zebra standing in a fenced enclosure. The grassy field within the cage provides a suitable habitat for the zebra, making it feel relaxed. The zebra is positioned towards the center of the image, and it appears a bit smaller than the enclosure, indicating a vast outdoor space for it to wander around. The overall scene depicts the zebra's tranquility as it strolls through its outdoor habitat."}
{"image_id": 373521, "caption": "The scene features an old, abandoned motor home with graffiti decorations on its side. The motor home is parked in a grassy area or forest, with trees and foliage surrounding it. \n\nThe motor home itself is quite noticeable, as it covers most of the image from left to right, stretching across the width of the scene and seemingly taking it over. The abandoned appearance, as well as the graffiti covering its exterior, suggest that the vehicle has been neglected for some time."}
{"image_id": 76409, "caption": "The image depicts a brightly lit room with a red bed located in the corner of the space. The bed is covered in a cozy red blanket, giving it a warm and inviting appearance. A tall window fills the room with natural sunlight, which adds to the overall cheerful ambiance. \n\nIn addition to the bed, there are a few other elements within the room. A bird cage with a bird inside can be seen on the left side of the bed, providing a touch of nature to the space. Another bird appears closer to the foreground, positioned just to the right of the bed. A chair is present in the middle of the room, while another bed is visible in the background, situated near a smaller window."}
{"image_id": 485985, "caption": "The image features a young baby with blond hair sitting on their stomach with a toothbrush in their mouth. The toddler appears to be in the midst of brushing their teeth. The scene captures a candid moment of the child taking care of their dental hygiene."}
{"image_id": 27564, "caption": "The image features two young girls, a little girl and a younger girl, sitting together on a brown couch, playing a video game on a Nintendo Wii console. Each girl is holding a controller, engaging in the activity with enjoyment.\n\nThe couch spans from the left to the right side of the scene, providing ample seating space for the girls. In addition, there is a smaller couch located at the far left edge of the image, but it does not seem to be part of the main scene."}
{"image_id": 92749, "caption": "The image features a large group of giraffes inside an enclosure at a zoo. There are three giraffes in total, including two larger ones, likely mother and child, standing together while one giraffe appears to be smaller and closer to the right side of the enclosure. The giraffes seem to be in the process of eating from a nearby tree. \n\nIn addition to the giraffes, there is also a couple of birds located on a grassy area close to the giraffes, perhaps indicating a peaceful and diverse environment within the zoo enclosure."}
{"image_id": 554958, "caption": "The image features a calico cat, with one eye open or squinting, sitting between some shrubbery, vines, and other plants. The cat is resting on a branch, surrounded by a green environment. It appears to be an urban setting, with the cat taking refuge and resting in nature.\n\nThere are a few more cat heads visible in the scene, with one situated further in the background and another towards the left side."}
{"image_id": 439971, "caption": "The image features a woman in a bathroom, standing and looking into a mirror. She is wearing a brownish dress with stripes and a brown scarf, and she appears to be smiling as they take a picture into the mirror using a digital camera. There is also a bottle located at the left side of the bathroom, near the top part of the mirror. The scene suggests a fun and casual moment shared between friends or family."}
{"image_id": 559006, "caption": "The image features a large brown bear walking around a body of water, which could be a river or a stream. The bear is the main focus of the scene, and it seems to be enjoying its wade through the water. \n\nThere are a few other people in the scene, likely observing the bear or enjoying the outdoor setting. Four people can be seen at various positions within the frame near the bear, observing the animal as it interacts with the water."}
{"image_id": 457262, "caption": "The image displays a table setup with a small banana lying on top of a wooden counter, alongside some coins. The coins are placed in various sizes and can be seen to be the focus of the arrangement alongside the banana. These coins are scattered close to the banana, creating a visually interesting setting for showing the different shades of the banana."}
{"image_id": 263881, "caption": "The image captures a tall giraffe standing in the middle of a grassy area. It is a beautiful day, and the giraffe appears to be walking across a barren field with trees on the background. The giraffe's long neck extends in the forefront, while its legs are planted, ready to follow the lead.\n\nFrom the giraffe's perspective, it appears that trees are behind the barren field, which lends additional depth to the landscape of the scene. The giraffe's unique features and posture make it an interesting sight in this natural setting."}
{"image_id": 322594, "caption": "The image is a split scene of a bathroom featuring the before and after renovations. In the before state, the bathroom seems untidy with various toiletries scattered around, the window open, and a white toilet with a roll of toilet paper. \n\nIn the after state, the bathroom has recently been renovated, and the window is now closed. A white toilet bowl has been added, and it appears to be cleaner and better organized than the previous state. Several bottles of shampoo are neatly positioned on a bathroom counter, and a sink has been installed as well. Overall, a significant transformation has taken place, giving the bathroom a fresh and polished appearance."}
{"image_id": 22423, "caption": "The image features two men and an elephant walking together in a jungle. One man is providing food or a treat to the elephant, holding it in his hand while the elephant eagerly reaches out to take it. The other man appears to be observing and appreciating the interaction. \n\nSeveral bottles are scattered around the scene, possibly indicating human presence or a recent gathering. The overall scene presents a sense of camaraderie between a man and an elephant in a natural, wild setting."}
{"image_id": 59000, "caption": "The image showcases a cozy living room setting with a couch adorned with Christmas tree ornaments and a chair. Both seating options are positioned in the middle of the space, providing a comfortable atmosphere for relaxation and conversation.\n\nThe living room is filled with numerous books scattered around, ranging in size and color. A television is placed at the beginning of the scene, completing the setup. Various decorative items, such as a clock, can also be spotted within the room. A remote sits atop a coffee table, ready for use by anyone in the room.\n\nA potted plant is visible along the edge of the room with a chair and couch, adding a touch of greenery and homey charm to the living area."}
{"image_id": 119547, "caption": "The image features a group of men and women standing outdoors next to tents, likely a part of a public speaking event or a political gathering. Within this group, there are three men wearing ties, with one of them having his tie straightened. A man is speaking into a microphone, and three women can be seen in the background, appearing engaged in the event.\n\nAmong the men, there is a man with a tie that is visibly crooked. Additionally, two other men are also using microphones during this event, speaking and engaging with the audience. Two other people in the scene are wearing glasses, possibly emphasizing their expertise or involvement in the event."}
{"image_id": 432763, "caption": "The image captures a picturesque scene on the beach close to the ocean, with a large flock of seagulls gathered by the water. There are dozens of birds in various sizes and positions, some of them flying close to the ground and others soaring in the sky.\n\nThe seagulls are scattered throughout the beach, including those near the shoreline, farther out onto the land, and some closer to the water. Some of the birds can be seen flying towards the left side of the image, while others are spread across the scene, with a few closer to the sand. It is a beautiful sight showing the essence of a typical ocean beach environment, bustling with life."}
{"image_id": 125635, "caption": "The image features a black and white cat standing on a window sill, peering out of an open window. The cat is situated close to the window, as it appears to be looking outside. The house's surroundings are visible from the cat's vantage point. \n\nThere are a few people in the scene, one person standing nearby or slightly behind the cat and two others placed further away. The windows themselves are covered with blinds, providing the cat a place to comfortably observe its surroundings."}
{"image_id": 542549, "caption": "The image features a black and white photo showcasing a messy bed in a room. On the bed, multiple books are scattered about, adding to the disorganized appearance. There are also several notebooks and papers scattered across the bed. \n\nApart from the bed, there are two people visible in the scene; one person is on the left side of the bed, and the other is located near the center. They are probably in the process of sorting through the items in the room - the books, notebooks, and papers."}
{"image_id": 494759, "caption": "The image features a sandy beach where two people are standing, flying a large, colorful kite high into the sky. One person is on the left side of the frame, while the other stands a bit further to the right. The kite soars above, capturing their attention as they control it together.\n\nIn addition to the individuals and the large kite, there are several smaller kites flying in the distance, some closer and some farther away. It is a delightful scene of family spending time together and enjoying their time by the shore."}
{"image_id": 5617, "caption": "The image depicts two cats comfortably laying on two pillows on a bed, displaying a relaxed posture. The first cat lies on a green pillow occupying a larger portion of it, while the second cat occupies the remaining portion.\n\nThe entire bed is situated within the frame, including the top right corner, where additional pillows are noticeable. These pillows come in various shapes, sizes, and shades of green, making a cozy and inviting setting for the cats to relax in."}
{"image_id": 279774, "caption": "The image displays a lively little league baseball game taking place on a field. A boy at bat is holding a baseball bat, ready to hit the ball. Several other players are scattered around the field, waiting for their turns or playing defensively. \n\nIn addition to the players, there are a couple of chairs placed on the field, probably for the parents and spectators to sit on during the game. A baseball glove can be noticed in the middle of the field, presumably belonging to one of the players. Two benches are also located near the field, providing additional seating for the teams and spectators. The atmosphere seems energetic, with the little league players enjoying a game of baseball."}
{"image_id": 323442, "caption": "The image features a man and a woman sitting at a dinner table outdoors under a large umbrella, sharing a moment of enjoyment. They both have glasses of wine arranged in front of them, with several additional cups placed on the table. The dining table is filled with various silverware, including forks and knives.\n\nTwo chairs are placed in front of the table, one for each person. Another table and chair can be seen further away, indicating that this dining area is part of a larger outdoor facility. A handbag is situated nearby, possibly belonging to the man or the woman."}
{"image_id": 109454, "caption": "The image is a close-up of a man wearing a suit and tie, standing at a table with a green bottle in his hand. He appears to be drinking from a soda bottle using the lid to prevent spills. The man is also wearing a watch, adding to the formality of his attire.\n\nAnother person can be seen in the background, but they serve as a secondary character, not the main focus of the scene. Additionally, there are two clocks visible in the room, one of which is at the top left corner and the other at the top right corner of the image. A table is situated further back in the scene, and some other items can be spotted, such as a wine glass, cell phone, and a dining chair."}
{"image_id": 370677, "caption": "The image depicts three women in red, orange, and blue tops standing behind a display case of doughnuts, possibly in a bakery or donut shop. The women are smiling for the camera, showcasing a lively atmosphere in the establishment. They are each wearing name tags, which signifies they may have specific identities or roles within the shop. \n\nThe display case contains a large variety of doughnuts, each coming in different shapes, sizes, and flavors. The doughnuts are neatly arranged and organized, likely contributing to the attractive presentation for potential customers."}
{"image_id": 521509, "caption": "The image portrays a young woman sitting on a bed near a camera on a tripod. The setting appears to be a hotel room, with a large window providing plenty of natural light for the photo shoot. The woman is sitting in a relaxed position, facing the camera.\n\nVarious potted plants can be seen in the room, one near the window and a few others spread around the room. There are also multiple vases of different sizes scattered around, as well as a bowl in the scene. A bed can be spotted near the bottom of the image."}
{"image_id": 236461, "caption": "An athlete can be seen skillfully maneuvering on a wave, riding a surfboard towards the ocean shore. The surfer is performing impressive jumps amidst the waves, showcasing their control and balance. The scene is set on a sandy beach, providing a serene and captivating backdrop for the surfing action.\n\nIn addition to the main surfer, there are several birds scattered throughout the sky, flying about the area, bringing life to the environment. The birds can be observed in various positions and heights, creating a lively and dynamic atmosphere."}
{"image_id": 534845, "caption": "The image features a black and white teddy bear hanging on a clothesline outside a brick building. It seems that the teddy bear's owner has hung it up to dry after being washed.\n\nSeveral other stuffed animals, likely dolls, can also be spotted hanging along the clothesline. They are scattered throughout the scene, adding more charm to the composition. Furthermore, numerous colored towels are draped in various shapes and sizes around the teddy bear and the stuffed animals. The clothesline stretched across the image emphasizes the clothes-drying theme of the scene."}
{"image_id": 180580, "caption": "The image features a dining table with a large blue plate filled with a variety of vegetables, including several carrots, asparagus, broccoli, and pieces of potato. The vegetables are spread out on the plate, showcasing their delicious health benefits. The table is accompanied by a fork and a bottle close to the top right corner of the plate. The colorful arrangement of vegetables on the plate makes the entire display visually appealing and inviting."}
{"image_id": 484551, "caption": "The image shows a woman with red hair sitting on a dock near a body of water. She is dressed in a bright orange shirt, wearing sunglasses, and looking toward the ocean. The woman appears to be a photographer, posing for the camera. The boat she is sitting on has red trim, accentuating the colors within the scene. The background features calm waters, indicating a relaxing environment."}
{"image_id": 456146, "caption": "The image depicts a beautiful, grassy field filled with flocks of sheep spread across a large area. In total, there are twelve sheep visible, all of them standing or walking on the grass. The field is dotted with patches of grass, providing an ideal environment for the sheep to roam freely. Some sheep are closer to the foreground, while others can be seen further in the distance. One large pack of sheep is standing in the background, occupying a significant portion of the scene. The overall scene conveys a serene, peaceful atmosphere characteristic of a countryside location."}
{"image_id": 283131, "caption": "The image shows a small bathroom with a white toilet placed near a white bathtub. The toilet is located in the middle of the bathroom, while the bathtub is situated in the corner at the far end of the room. A sink is positioned towards the left of the bathroom.\n\nSeveral items are scattered around the bathroom, including a handbag on the left side and a couple of bottles nearby. A pair of scissors can also be seen in the scene, probably used for personal grooming or maintaining the bathroom. The overall appearance of the bathroom is quite small and basic, suitable for daily use."}
{"image_id": 23309, "caption": "The image shows a healthy and appetizing meal full of colorful vegetables, particularly a large quantity of broccoli and onions. The meal primarily consists of spaghetti with various ingredients, making for a visually appealing and nutritious pasta salad.\n\nThe pasta and vegetables are mixed together, with the bright, vibrant colors of the cooked broccoli and onions contrasted beautifully with the yellow and orange hues of the spaghetti. Moreover, there are other vegetables mixed among the broccoli and onions, including carrots, which can be seen throughout the dish."}
{"image_id": 547487, "caption": "The image shows a young boy performing a skateboard trick in the air, surrounded by a group of people who appear to be watching him. There are a total of fourteen spectators observing the boy's actions, including fourteen people standing around the action area and others positioned further away.\n\nIn the scene, the skateboarder is prominently visible in action, with his red and black skateboard beneath him. One spectator can be seen holding a skateboard positioned close to the skateboarder but away from his actions, as if he or she is also ready to participate in the trick or wait for their turn."}
{"image_id": 34830, "caption": "The image shows a men's restroom with a white urinal mounted to the tiled wall. The urinal has metal hardware and is surrounded by orange and black tiles on the walls. There's also a bright blue sticker in the bottom right corner of the wall where the urinal is mounted. The urinal is situated next to a black and red tiled wall that appears to be a design choice for the restroom's decor."}
{"image_id": 125997, "caption": "The image features a large painted wall on which the words \"U + ARE + A + L + I V E\" are written, creating an eye-catching display. The colorful sign is prominently displayed, covering a significant portion of the side of the wall. \n\nIn addition to the main sign, there is a smaller sign further down on the same wall. Two people can also be seen in the vicinity of the wall, one of them near the center of the image and the other person towards the right edge. This outdoor scene highlights the impact of the brightly-painted and eye-catching wall sign."}
{"image_id": 19916, "caption": "The image shows a wooden dining table with a fork, knife, and a white bowl filled with chopped apples. The bowl and apples are prominently placed on the table, creating a visually appealing and well-presented meal for breakfast. A laptop is also positioned near the edge of the table, possibly for work or leisure activities during the meal.\n\nThe chairs surrounding the wooden table appear sparse, suggesting an ideal space for conversation or relaxation without being overcrowded. These chairs show off both the simplicity and functionality of the dining area."}
{"image_id": 145019, "caption": "In the image, a woman is walking near a crashed airplane that has a backhoe, also known as a digger or bulldozer, hauling away the wreckage. The airplane appears to have crashed on top of the excavator. Several people are observed in the scene, including a person standing near the front of the excavator, a lady walking by, and a man on a cell phone, all of whom seem to be observing the accident.\n\nThere are two other people further back in the scene, also standing near the crashed plane. Interestingly, a yellow cell phone can be spotted in this scene, possibly belonging to one of the people present."}
{"image_id": 127161, "caption": "The image features a plate with two pizza slices, each cut in half. The pizza slices contain assorted, unrecognizable pizza toppings. The pizza slices are placed on a dining table with white linen-covered surface.\n\nAdditionally, a pair of cutlery can be seen on the table alongside the pizza pieces - a fork on the left side of the plate and a knife positioned between the two slices. There is also a cup placed slightly further away from the plate on the right side, just behind the top edge of the plate."}
{"image_id": 543660, "caption": "The image features a public toilet stall with two toilets placed side by side. One toilet is prominently visible to the side, while the other is not as easily noticeable due to the way it is situated in the stall. The walls have a black and white checkered pattern that creates a distinct atmosphere in the room.\n\nIn the scene, a trash can is also present towards the right side of the toilet stall."}
{"image_id": 8333, "caption": "In the image, a Virgin Blue passenger train is traveling along tracks next to a wall. The train, occupying a significant portion of the scene, can be seen both on the left and right sides across the picture. The wall to the left of the train is likely a part of a building with many windows, while the wall to the right of the train appears barren and features multiple square windows.\n\nA few people can be spotted in the image, one in the upper left corner and another near the bottom right. The presence of a truck and a car in the lower half of the picture suggest that the area might be a mix of transportation types, or perhaps a train depot where vehicles are present for maintenance purposes."}
{"image_id": 482907, "caption": "The image features a gray, red-and-white checkered airplane flying high up in the blue, cloudless sky. The aircraft appears to be a smaller propeller-driven plane rather than a jet fighter. The wings of the plane are large and extend across a significant portion of the image.\n\nThe airplane is in the middle of the scene, with clouds visible in the distance on the right side. Additionally, a few birds are flying in the sky, scattered at varying heights and positions, creating a sense of depth and atmosphere to the scene."}
{"image_id": 290130, "caption": "The scene takes place in a body of water where a person is skillfully riding a surfboard on a large wave. The surfer is the center of attention, with powerful waves in front of them, adding to the thrilling nature of the ride.\n\nThere's another surfer slightly further into the image to the right, partially covered by the wave they are riding. This surfer seems to be following the main surfer as they navigate the wave. The water's surface appears choppy, indicating the intensity of the waves. It's a perfect representation of a surfer's adrenaline-pumping activity in the ocean."}
{"image_id": 58225, "caption": "In the image, a person holds up a hot dog from a hot dog place at a stadium. The person is standing close to the center of the scene and showcasing the hot dog from an overhead angle. The stadium has a significant amount of grass around them. In addition to the main hot dog, there is an additional hot dog in the image as well. The scene conveys a fun, casual atmosphere common at sporting events."}
{"image_id": 249550, "caption": "The image features a bedroom scene with a bed positioned towards the left side of the room. The bed is adorned with a colorful bedspread and is well-made. Next to the bed, there is a nightstand with a vase of grass and a potted plant sitting on it. \n\nAbove the bed, there's a light fixture that accentuates the cozy atmosphere of the room, providing ample lighting for comfort. Additionally, there are two more smaller vases of plants in the room, one placed towards the right side and another near the center. The bedroom appears to be inviting and comfortable for the occupant."}
{"image_id": 448765, "caption": "The image depicts a modern white bathroom featuring key components such as a sink, toilet, and bathtub/shower combination. The sink area is decorated with brushed metal spigots, adding a touch of sophistication to the design. Adjacent to the sink, there is a toilet sitting next to a trash can. Additionally, a brown wooden box is placed close to the trash can, suggesting that it may be used for storage or as a lid for the toilet seat. The placement of the items and the minimalistic design of this bathroom make it appear clean and functional."}
{"image_id": 498439, "caption": "The image depicts a baseball game, with multiple baseball players on the field. There are players holding baseball gloves, standing in distinct groups on the field. One person can be seen wearing white clothing with the number three on their chest, ready to take their place.\n\nTwo baseball gloves are discernible, one slightly behind an outfielder and another closer to the pitcher. Some players have their bats in hand, and they are likely in the midst of warming up. A football can be spotted near the players, possibly used for practice drills.\n\nIn the background, a water bottle is placed on the ground, supporting the players during the game. The overall atmosphere appears to be engaged and exciting, as the baseball players prepare for action."}
{"image_id": 252403, "caption": "The image features a woman with long, wavy hair holding a blue toothbrush up to the side of her mouth. She seems to be posing and smiling slightly. The toothbrush extends from the lower part of the image almost to the top, making the focus clear on the bristles. Apart from the woman's prominent figure, the image contains very little other detail, showcasing the simplicity and directness of the scene."}
{"image_id": 347995, "caption": "In the image, a beautiful blonde woman is lying in a bed with her two babies. She is surrounded by a large black dog that is comfortably laying on the bed beside her, showing its brown ears hanging off the bed. There are a total of three people in the image, adding to the warm and cozy atmosphere.\n\nThe bed occupies a significant portion of the frame, and the scene includes a few items, such as a book on the bed, a clock on the wall, and a cellphone resting on a nearby surface. The scene is reminiscent of a mother's and child's sleeping area, emphasizing the bond between the mother, her children, and her beloved pet."}
{"image_id": 544216, "caption": "The image features a dining table with a plate containing two huge sandwiches and a generous portion of crinkle-cut french fries. The sandwiches are cut in half, revealing their delicious contents. Surrounding the plate are multiple cups, one on the top right corner and another on the bottom right side. There is also a person present in the background, partially visible on the left side. A knife is placed on the table near the top left corner. The entire dining setup creates an inviting scene for a flavorful meal."}
{"image_id": 205729, "caption": "The image captures a group of six people skiing and standing near each other on a snow-covered slope, with a mountainous background in view. They are enjoying their skiing adventure together, forming a small group or family skiing activity. Each person is wearing a backpack, adding to the outdoor, winter thrill of their skiing trip."}
{"image_id": 350988, "caption": "The image features a wooden stairwell that leads down to a basement with a \"no children\" sign written in chalk. The stairs are wooden with several steps, each placed closely to one another. The staircase appears to be empty and is situated under a wall.\n\nThis unusual request is displayed prominently on the wall, along with a \"no food or drink\" notice, emphasizing the areas where children and food and drink are not allowed. The stairwell leads into another room which contrasts the stairs' usage. This space might have multiple benches installed around it, but they are currently positioned against the wall, contributing to the quiet and orderly appearance."}
{"image_id": 288673, "caption": "The image features a group of people on a beautiful beach near the ocean. One of the individuals, a blonde-haired woman, is walking while holding onto a kite, enjoying a fun day outdoors. The kite is visible in the sky, close to the center of the scene.\n\nThere are other people watching the kite-flyer or engaging in other activities, with some positioned near the left side of the scene and others spread out across the frame. A car is parked nearby, suggesting that the people have traveled by car to enjoy the day at the beach. Additionally, there is a boat visible in the water at the left side of the image."}
{"image_id": 568690, "caption": "A small brown and white cat is sitting on top of a toilet, standing on the tank. The cat appears determined and unbothered by its unusual elevated position. The toilet is situated in front of a bathroom wall, and behind the cat, there is a shower curtain. The overall look gives a sense of curiosity as to why a cat chose this particular spot to take a stand."}
{"image_id": 504194, "caption": "In the image, a brown dog sits calmly next to a wooden bench, possibly tied up to keep it in place. The bench is located on a brick sidewalk surrounded by some plants and bushes. Additionally, there are multiple bicycles parked in the area: one to the left, another one behind the bench, and still another in the background, far to the right. A truck is parked near the right side of the scene."}
{"image_id": 35368, "caption": "The image features a table with two plates on top of it, both holding various fruits and vegetables, including bananas and lemons. There are several bananas displayed on one of the plates, while an avocado can be seen on the other plate. Additionally, there are apples present in both containers. The table is adorned with decorative vases as well to enhance the aesthetic of the displayed fruits and vegetables. The vases are placed in different positions."}
{"image_id": 307332, "caption": "The image depicts a joyful scene with a person walking their dog near a bench on a lovely day at the park. There is another dog in the background, playing on the grass. Three women are sitting on the bench, enjoying each other's company as they watch the dogs. \n\nThere are two benches in the scene. One of them is placed closer to the center of the image, while the other one is situated towards the right side. The person walking their dog is located towards the right side of the image, close to the second dog. The women on the bench are seated in a line along the left side of the image."}
{"image_id": 490878, "caption": "The image depicts a solo skier wearing a red jacket, skiing through deep snow in a large, snow-covered valley. He is using his ski poles to maintain balance and propel himself across the snow-covered terrain. The skier takes up most of the foreground of the image, with the background displaying a breathtaking mountain range. The scene captures the adventurer's experience and perseverance in this challenging environment."}
{"image_id": 507187, "caption": "In the image, there is a crowd of people gathered around different showcased exhibits. Two old motorcycles are prominently displayed with one being green and the other having a darker tone. These motorcycles seem to be the main attraction of the gathering.\n\nSeveral people, including men and women of various sizes, are standing around the motorcycles and engaging with each other. In addition to the motorcycles, there is a handbag positioned to the side of the scene, and a clock can be seen on the wall. \n\nThe crowd surrounds the area, with some people standing closer to the motorcycles and others positioned around them. The overall atmosphere suggests that it could be an indoor event where people are admiring and discussing the exhibits."}
{"image_id": 254644, "caption": "The image features a wooden kitchen with several appliances and cabinets. A refrigerator is located on the left side of the scene, with another refrigerator further down the kitchen. A microwave lies above the oven, which is positioned on the far right of the scene. A dishwasher is situated next to the microwave. \n\nVarious kitchen tools are visible, such as knives placed on the countertop on the right side and various spoons occupying both the middle and right sections of the scene. Multiple bowls are spread across the area, with one near the top left, another on the right side, and one in the center of the space. A bottle can also be spotted on the countertop closer to the middle of the kitchen. Overall, the kitchen is well-equipped and organized."}
{"image_id": 400803, "caption": "The image shows a bright orange boat full of people riding on top of the waves in a vast expanse of blue ocean, seemingly flying or surfing along with the waves. There are several individuals on board the boat, enjoying the wild ride. \n\nTwo men can be spotted in the foreground, standing on the side of the boat and holding onto the edge of the deck. The boat appears to be a fast speed boat and might be used for thrilling coastal activities, like wave riding or watersports."}
{"image_id": 574928, "caption": "The image showcases a lush green field with a herd of sheep grazing on the land. There are at least 16 sheep in the pasture, varying in size and position. Some are closer to the foreground while others are more distant, making the picture look busy and lively. The sheep are spread out at different angles and spots in the field, which provides a sense of depth and natural movement. Overall, the scene depicts a peaceful and serene countryside setting with a thriving flock of sheep."}
{"image_id": 559247, "caption": "The image depicts a lively gathering of people at a dining table filled with different types of sandwiches and an assortment of food items. The group of people, primarily consisting of boys and young men, are enjoying each other's company as they share sandwiches in a friendly setting.\n\nThere are at least five sandwiches displayed on the table, each with varying sizes and colors, presenting a delicious spread for the attendees. Buns are spread across the table, with some near the sandwiches and others placed separately, catering to the diners' preferences. \n\nIn addition to the sandwiches, the table features a bowl and several cups scattered around the table, further indicating the variety of food items and drinks available. A chair is placed near the table's head, providing a surface for the guests to eat or place their finished sandwiches. The overall atmosphere is warm, inviting, and social."}
{"image_id": 254625, "caption": "In the image, a baseball batter is preparing to hit the ball during a baseball game. He is focused and poised, holding his baseball bat and waiting for the incoming pitch. The young man is the main subject of the image, and he is positioned in the center. \n\nBehind him, there is a bench or bleacher which could be used by the teammates to sit while he is at bat. The entire scene is set against a dark background, emphasizing the batter and his focus on the game."}
{"image_id": 374966, "caption": "In the image, a group of teenagers in pink shirts are gathered in a skate park, enjoying their time riding skateboards and playing in the area. There are five skateboards visible in the park, including one that a boy is riding down a ramp. A few people are standing around, likely observing the skaters or waiting for their turn.\n\nA bench can be seen in the background, providing seating for those who are not skateboarding. Additionally, several backpacks are spread across the scene, perhaps containing personal belongings of the individuals.\n\nIn total, there are fifteen people in the skate park, either participating in activities or watching from the sidelines."}
{"image_id": 351967, "caption": "The image captures a busy street corner bustling with activity, featuring a yellow taxi driving by a massive clock attached to the side of the high-rise skyscraper outside. There are several other people on the sidewalks surrounding the clock, going about their daily routines.\n\nIn addition to the taxi, there are a few other cars in the scene, with one parked further down the street and another positioned at a different location on the right edge of the frame. A traffic light is visible at the center of the image to help regulate the flow of traffic in the area."}
{"image_id": 172877, "caption": "In the image, a young man is sitting in a chair in a room, holding his hands together in such a way that his fingers are crossed. He is wearing a blue collared shirt with a pink and black tie placed around his neck, and his glasses are resting on his nose. The man appears to be looking into the camera, giving a close-up view of his focused expression.\n\nThe room seems to be relatively small and empty, leaving the man as the primary focus. Additionally, there is a light in the background, which could be a small reading lamp or a decorative light fixture."}
{"image_id": 309237, "caption": "The image features a unique cat with a colorful fur pattern, sitting on a blue flowered couch. The cat has its paws curled underneath it, and it appears to be staring at its owner off-camera. The couch occupies most of the image, showcasing the blue color pattern on its chair cushion.\n\nOn the side of the couch near the cat, there is a television remote control placed, indicating that the cat and the owner both enjoy watching TV together."}
{"image_id": 565877, "caption": "In the image, a young lady wearing a denim cap is sitting on a red couch smiling and posing for a picture. She appears to be happy and dressed up to attend a social event. She is holding an open laptop, which seems to be the main focus of the scene. \n\nThere is another person situated towards the right side of the image, also seemingly engaging in the same social occasion. A book can be spotted on the couch, positioned next to the smiling woman and the laptop, suggesting a variety of reading material available for leisure.\n\nA couch takes up much of the room and surrounds the woman, giving her a comfortable and cozy environment."}
{"image_id": 489924, "caption": "In the image, a woman is enjoying her time skateboarding in a street. She is wearing blue denim shorts and a blue top, making an outfit of denim. She is on her skateboard, moving down the street while balancing elegantly.\n\nThe street appears to be designed for pedestrians, with no signs of heavy traffic, but the woman seems to be taking advantage of the available space. Another person can be seen further along the street but is too distant to interact with. The scene conveys a sense of relaxation and active lifestyle."}
{"image_id": 125472, "caption": "In the image, a young man is skillfully performing a jump along a snowboarding rail, showcasing his talent for extreme sports. He is in the air, holding onto the snowboard with one hand, while the other hand appears to be lowered close to it. This action-packed moment encapsulates the excitement and challenges of engaging in snowboarding."}
{"image_id": 422706, "caption": "The image features a large boat or cruise ship floating on top of vast blue ocean waters. There are several people onboard the cruise ship, some of them standing near the windows, taking in the view. They appear to be enjoying the experience and observing the surroundings.\n\nIn addition to the boat and people, there are two handbags visible in the scene, likely belonging to the passengers. One handbag is placed near the boat's edge, and the other handbag is situated on the cruise ship, closer to the center. A second boat can also be seen in the background, further enhancing the oceanic atmosphere."}
{"image_id": 290700, "caption": "The image depicts a man skillfully riding a wave on a surfboard in the ocean. He can be seen skillfully surfing a wave, catching its crest with great enthusiasm. This energetic scene captures the thrill of the sport of surfing. The man appears to be enjoying his time in the water, fully immersed in the moment."}
{"image_id": 365177, "caption": "The image features a large white tour bus parked on a city street under a blue building. The bus spans across most of the scene, with a length and width making it appear as a dominant element. It appears to be part of a tour group, likely taking tourists to the various attractions of the city.\n\nThere is another, smaller vehicle closer to the right edge of the image, but its details are not as clear as the main tour bus, which occupies the majority of the street space. Overall, the scene portrays the cityscape with a tour bus prominently serving as the focal point."}
{"image_id": 398661, "caption": "The image depicts a spacious, well-equipped kitchen featuring a white countertop. On the counter, there is a microwave, oven, and microwaveable casserole dish, showcasing a blend of modern and standard appliances. The kitchen is adorned with various cooking utensils, including several knives and spoons that are placed throughout the counter. \n\nIn addition to the appliances, there is a clock mounted on the wall near the center, and a cup can be seen on the counter as well. A bowl and a baking dish are also visible, further highlighting the kitchen's functionality for cooking various dishes."}
{"image_id": 175611, "caption": "The image features a person wearing an orange shirt, attentively working with their fingernails and cutting tobacco into small pieces using a pair of scissors. The person appears to be in a work environment, possibly a factory or a dedicated workspace.\n\nThe room is filled with various books scattered around, both leaned against the walls and placed in stacks, indicating the nature of this workspace as possibly an office, library, or a workplace concerned with tobacco products."}
{"image_id": 477673, "caption": "The image features a calico cat sitting inside of a black and gray backpack, taking up the majority of the upper-left corner of the bag. The cat appears to be comfortably resting in the bag, possibly enjoying the snug and cozy space. The black and white cat has a striped pattern, which is distinct and makes it unique."}
{"image_id": 1270, "caption": "The image depicts a baseball game in action, with a boy at home plate holding a baseball bat and preparing to hit the ball. There are various other young players on the field, with some standing closer to the spectators and others spread out across the field. Some players can be seen on the left side of the field, while others are scattered in the middle and at the right side.\n\nThere is a baseball glove visible among the players on the left side, perhaps belonging to one of them. Some of the players are standing close to a fence, while others are further away. Interestingly, the young player holding the bat appears older than the other ones, suggesting he could be a leader or a more experienced player. The scene suggests a competitive yet fun youth league baseball game taking place."}
{"image_id": 224012, "caption": "The image features a white plate covered with a delicious spread of grilled meat, likely pork, and some vegetables. The meat is cut into several slices and laying on the dish. Surrounding the meat are several pieces of chopped broccoli, adding a fresh and crunchy element to the dish.\n\nIn addition to the meal, there are a few potatoes on the plate, providing a starchy component to the meal. As a whole, the dish is organized and visually appealing, making an excellent and filling dinner option."}
{"image_id": 552510, "caption": "The image showcases a group of young children playing a game of soccer on a field. There are nine kids actively engaged in the game, spread across the field, with one of them positioned to kick the sports ball. They are wearing soccer uniforms, showcasing their involvement in the sport.\n\nThere is a bench in the backdrop, possibly to provide seating for spectators or resting areas for the players. Two cars can also be spotted in the background, likely belonging to the parents who brought their children to the games."}
{"image_id": 272880, "caption": "The image captures a dining table with a large pizza sitting on top of a pan. There are several slices missing from the pizza, and a couple of pizza boxes can be seen nearby. In addition to the pizza, the table also has a cup on the tabletop, closer to the side of the food. Beside the pizza, there is a person holding a sign in their hand as if they are promoting the pizza place or just simply sharing their excitement for the meal. The overall scene creates a warm and inviting atmosphere, perfect for enjoying a delicious pizza."}
{"image_id": 580540, "caption": "The scene features a cute, black dog sitting eagerly in front of a television set on a stand. It appears that the dog is watching its reflection on the screen, seemingly interested in the content displayed.\n\nThe room is furnished with a couch situated to the side of the dog, and a dining table located closer to the center. There is also a remote placed on the floor near the couch, likely for controlling the television. In addition, a computer mouse can be spotted on the floor nearby."}
{"image_id": 242934, "caption": "The image showcases a well-kept and cozy living room that has been given a nice makeover. The main feature of the room is a couch, situated against a wall, accompanied by a chair on the other side of the room. A coffee table can be found in the middle of the space, adding to the overall organization.\n\nSeveral books are scattered around the room, adding an intellectual flair to the living area. There is a clock mounted on the wall, allowing the occupants to keep track of time while relaxing in the comfort of their space. Interestingly, there is a vase placed close to the couch, and a bowl rests on a surface in the room. Finally, the presence of a person in the scene suggests someone being in residence, which adds a touch of warmth and life to the room."}
{"image_id": 178807, "caption": "The image captures an outdoor scene where two young boys are playing on a cement path with their skateboards. One of the kids has two skates in hand while standing over a small toy car, showcasing his fun activities. Another boy is riding a skateboard just behind the first kid.\n\nA truck is parked nearby in the background, and there are some cars parked further in the distance. These vehicles likely belong to the people living or working in the area. The scene depicts a lively outdoor setting where the boys are enjoying their time."}
{"image_id": 135748, "caption": "The image features a small, brown Shih-Tzu dog lying in a cozy bed, taking up most of the space within the frame. This bed appears to be a small blue and white blanket, placed near several objects. There is a cup situated close to the bed, and an orange Fusion bottle, possibly water, is located nearby. Additionally, the dog seems to have access to a toothbrush, possibly indicating that the dog's owner takes care of their pet's dental hygiene as well. The scene portrays a comfortable and dedicated space for the dog's daily needs and grooming routines."}
{"image_id": 255036, "caption": "This scene depicts a four-way intersection in the middle of a town, with a large, blue, steel fence stretching across the street. A flock of pigeons is walking around the street intersection, and a metal street light pole is visible at the left side of the road. Nearby, there are two cars parked on the side of the road.\n\nAt the intersection, the traffic light is currently displaying a red light, with a truck visible in the background on another street. A fire hydrant can be seen on the far side of the street, adding to the urban setting. The image captures a typical scene of city life and transportation."}
{"image_id": 3926, "caption": "The image features an open field covered in fresh, fluffy snow, providing a perfect environment for two sheep walking around with thick coats of wool. Both sheep are facing right in the image.\n\nOne sheep is positioned in the middle of the field with its back exposed, while the other sheep is slightly further back towards the right side of the field. Their coats are white, and each sheep has a set of horns, adding to their woolly appearance. The overall atmosphere suggests a peaceful and snow-filled day, perfect for these animals."}
{"image_id": 236762, "caption": "The image shows a large group of people gathered around a large dining table. The table is filled with plates and several cups, as well as various eating utensils like forks and knives. \n\nSome of the guests are sitting on chairs that surround the dining table, while another person stands nearby. Near the guests, there are three potted plants placed around the dining area, giving the scene an ambiance of a dining experience in a restaurant or a cozy home gathering.\n\nIn total, there are seven people in the room, including a few people in the background, who might have yet to be seated or are waiting to be served. The atmosphere of the gathering is warm and friendly as they share a meal together."}
{"image_id": 248314, "caption": "The image presents a cluttered wooden dining table with various items on top of it. There are two bowls prominently displayed, one on the left side and the other towards the bottom right of the table. \n\nBesides the bowls, there's also a spoon resting near the center of the table. A laptop computer occupies a significant portion of the table, positioned both horizontally and vertically, and a cell phone can also be spotted at the edge of the table. \n\nA bottle is also visible towards the right side of the table, adding to the cluttered appearance of the scene. Additionally, there are two keyboards in the middle and a pair of scissors located at the top right corner of the table."}
{"image_id": 559773, "caption": "The image captures a thrilling scene of a person flying through the air on skis, performing a skillful jump high in the air. The skier is in motion while they maintain their balance and control as they suspended in the air on their skis.\n\nIn the background, there is a clock visible in the top left of the image, perhaps indicating the skier's performance during an event or competition. It stands against a blue sky, and the overall atmosphere appears to be exhilarating and energetic."}
{"image_id": 340665, "caption": "The image captures a woman dressed in blue, standing in front of a building and holding a tan color PostBill umbrella. She has her back and head covered by the umbrella, providing her some shade and protection from rain or sunlight. In addition to the main subject, another person can be seen in the background near the left edge of the image. A book can also be spotted in the scene close to the person in the background."}
{"image_id": 388599, "caption": "In the image, a dog is playing with a frisbee in an open field on a sunny day. The dog takes a break from playing, and its paw is raised as it grabs the frisbee in its mouth. A person is positioned towards the right side of the scene, likely supervising or participating in the frisbee game. The area appears well-maintained and grassy, with the sunlight illuminating the surroundings."}
{"image_id": 163528, "caption": "The image features a meze platter piled up with various ingredients, forming a fresh vegetarian pizza. The pizza has a lot of toppings, including onions, cucumbers, and lettuce. There are also pieces of sausage on the platter, adding more variety to the dish. The entire meze platter appears to be on a white plate, which helps to showcase the rich and colorful vegetables. A fork can be seen at one edge of the plate, ready to be used to enjoy this delicious meal."}
{"image_id": 481212, "caption": "The image showcases a cozy setting with a man sitting on a sofa that has pillows on it. He's holding a mug, enjoying his coffee while a white cat and a black and white dog curl up next to him. The man appears to be sitting backwards on the couch, with the two animals sitting on his lap and beside his legs.\n\nAdditionally, there are two remote controls nearby, possibly on the sofa cushions, suggesting that the man is either relaxing and looking at a screen or taking a break from watching television. The scene gives off a comforting and peaceful aura."}
{"image_id": 277533, "caption": "A man is sitting comfortably on a red couch in his living room, holding a Wii remote in his hands. He is wearing a gray long-sleeve shirt, likely playing video games on the television. Another remote can be seen nearby, possibly for a secondary controller to assist in the gaming experience. The setting seems like a cozy space for gaming and leisure activities."}
{"image_id": 173383, "caption": "The image showcases the front of a large three-tiered cake sitting atop a dining table. The cake is ornately and tastefully decorated for a wedding celebration, with gold foil on the white cake and several flowers adorn the table. In addition to the cake, there are two candles placed nearby in the right corner of the table, further enhancing the celebration atmosphere.\n\nA knife is carefully placed next to the cake, ready for cutting and serving the sweet treats. Overall, the scene showcases a lovely arrangement for a special event, with the cake as the focal point of the setup."}
{"image_id": 419624, "caption": "The image features a long white high-speed passenger train traveling down the track in an open setting with trees and a hill nearby. The train is painted red and gold, making it stand out against the backdrop.\n\nThere are two other smaller trains in the distance, one on the far left side of the image and the second one further inside the image. The scene showcases a busy railroad with multiple trains in motion, illustrating the importance of train transportation in such a setting."}
{"image_id": 130291, "caption": "The image depicts a woman wearing glasses and helping a man with his necktie. They are both standing and dressing up, likely preparing for a formal event. A cell phone can be seen on the man's belt, and a chair is placed nearby in the background.\n\nAnother person is present in the scene, standing towards the right side of the image. A dining table is observed in the middle area of the scene, and a book rests on the table. The presence of these objects, along with the interaction between the individuals, indicates they might be preparing themselves for a special occasion or an important event."}
{"image_id": 193369, "caption": "The image features an old, worn wooden bench with a black wrought iron frame, situated on a patch of grass. The bench's worn appearance and missing parts indicate its age and make it evident that it has been exposed to the elements for quite some time. The bench extends throughout most of the frame, displaying rust and age due to the elements. The entire bench is positioned in a grassy space, giving the impression of an outdoor location."}
{"image_id": 367804, "caption": "The image features a little girl standing on a sandy beach, flying a kite high in the blue sky. She seems to be enjoying her time at the beach, with the kite soaring above her. \n\nIn addition to the girl, there are several other individuals scattered around the scene, giving the beach an active atmosphere. Some are closer to the water or near the edge of the shore, while others can be seen further away. There are also two umbrellas present in the scene, providing shade for people on the beach."}
{"image_id": 84735, "caption": "In this image, a baseball player at the center of attention is swinging his bat over the home plate while a crowd looks on. The scene is filled with excitement as the sports fans watch intently. The player is in the baseball uniform typical for American baseball and is captured in the precise moment the bat makes contact with the ball. \n\nIn addition to the baseball player at bat, there are numerous people in the scene, including teammates, opponents, and other spectators. Some people are standing close to the batter, while others are located in the background. The crowd appears to be a mix of age groups and individuals, showcasing the diverse appeal of baseball as a sport."}
{"image_id": 247285, "caption": "In the image, a man and a woman, both holding an umbrella, are standing over a baby. They are both cradling a little kid under the open umbrella, providing shelter and protection from the elements. There is a close-up view of the person near the baby, allowing us to see the details of their faces near the child.\n\nThe man behind the woman is also holding an umbrella, seemingly extending his hand or arm to offer additional support. The three individuals appear to be enjoying a shared experience, with the man seemingly being the baby's father or a close relative. There is a watch on the woman's wrist, and a bench can be seen in the background. Additionally, a chair is located on the right side of the scene."}
{"image_id": 438432, "caption": "The image is an old black and white photograph of a girls' cricket team posing outside in their uniforms. The team consists of several women, all dressed alike and sitting and standing in various positions. Some of them are playing cricket roles, while others are more focused on the cameras, seemingly capturing this memorable moment.\n\nThe girls appear to be enthusiastic and proud of their uniforms and their team. A sports ball, likely a cricket ball, is visible in the scene towards the center of the photograph. The scene may represent a moment of unity and camaraderie between the girls and their coaches or teammates."}
{"image_id": 185479, "caption": "The image portrays a man in a beige suit, wearing glasses, and sitting on the floor while working on his Apple laptop computer. An additional Apple device, such as a laptop or iPad, can be spotted closer to the center of the image. \n\nThe floor and background are decorated with blue dye, creating a visually appealing atmosphere. In front of the man, there is a backpack lying on the ground, possibly carrying his belongings or essentials. The overall scene captures the everyday life of a man working and using technology in a creative and unique environment."}
{"image_id": 570826, "caption": "The image features a blue and yellow train traveling down steel tracks in a busy urban environment. The train car bears Asian characters on its side, perhaps in a foreign language, indicating it's in another country. The train seems to be a public transit vehicle, providing transport services to the region.\n\nIn addition to the main train, there are a couple of other vehicles visible in the image, making it a lively scene. A truck can be seen in the background on an intersecting road, and a smaller train further down the tracks creates a sense of movement and bustle. Overall, it is a scene full of activity and transportation hubs."}
{"image_id": 127394, "caption": "The image features a group of people sitting at a large dining table that is filled with a variety of delicious homemade dishes. Different kinds of food can be seen on the table, including an assortment of desserts, finger foods, and cakes. The table is also set with plates, knives, and beverages. \n\nBeverages, including multiple cups, can be found scattered across the table. A fork is also visible next to the array of food items on the table. The people in the group are seated on surrounding chairs, enjoying their time together while partaking in the mouth-watering spread."}
{"image_id": 311081, "caption": "The image displays a long white bathrobe hanging from an open shower in a well-lit bathroom. The shower area features a bathtub and a stand-up shower with a door. The bathtub appears to be a small jetted tub, providing a comfortable bathing experience. \n\nTo enhance the room's ambiance, there are two vases placed beside the bathtub. Additionally, a toilet is visible in the background, closer to the edge of the image. The combination of the white bathrobe, shower, and surrounding fixtures creates a clean and inviting bathroom environment."}
{"image_id": 376677, "caption": "The image shows a busy highway with a large truck driving under an overpass with a rusty old overpass structure. The truck, possibly a crane truck, is designed to load and unload materials and is driving under the elevated highway. On the road, there are also several cars and a motorcycle, with a total of 5 cars and 1 motorcycle visible in the scene.\n\nIn addition to the moving vehicles, there are some road users waiting at the traffic stop. Two traffic lights can be seen at different positions in the scene. A person is standing by the right side of the truck, likely responsible for managing or observing the unloading process. \n\nThere are also two backpacks in the image, one near the middle of the scene close to the truck, and another towards the bottom left side of the frame."}
{"image_id": 269419, "caption": "The image features a large, elegant tower with a clock sitting tall within the brick structure. The clock tower appears old and unique, situated in a city setting. There is a street lamp standing nearby the clock tower, providing adequate lighting for the area.\n\nA nearby tree can be seen, lending a sense of natural presence to the scene. In the background, the tower dominates the scene and serves as the focal point for the image."}
{"image_id": 210708, "caption": "The image showcases a group of elephants standing in a river amidst a lush green environment. Two large elephants are visible, with one on the left and another on the right side of the frame. A smaller elephant, likely a baby, is seen playfully splashing in the water with others nearby, which creates a sense of bonding and camaraderie between the elephant herd. The elephants are spread out across the river, enjoying the streamy water on a warm day."}
{"image_id": 472246, "caption": "The image features a white surface on which three different types of fruits are arranged: an orange, an apple, and a banana. The orange is placed on the left-middle area, with a light spot on it, giving the impression that it has an oil spot. The apple, with an apple-core, takes up a central position in the middle, while the banana is located along the far-right edge. These fruits are presented close to each other as a simple still-life composition."}
{"image_id": 187475, "caption": "The image portrays a large toasted hot dog served in a baguette, which is placed on a plate. Surrounding the hot dog, there are several onions and a slice of cheese, adding to its indulgent appeal. The hot dog and toppings create an inviting scene, likely enjoyed during a night out or social gathering.\n\nIn the background, there are two people present, one on the upper right side of the image and the other in the lower right corner. Both appear to be attendees of the event, possibly enjoying their meal or engaging in conversation."}
{"image_id": 299457, "caption": "The image features a young man with black hair, wearing glasses and sitting comfortably in a chair. He is holding a lollipop up to his mouth, taking a bite. There is also a toothbrush next to him on the chair.\n\nIn the scene, there are two other people visible in the background, one of them standing and the second sitting on the left side of the picture. The room seems to have an open living area with a chair placed next to a board containing some images."}
{"image_id": 2894, "caption": "The image features a small train located at a platform in a suburban area. A colorful stationary train can be seen as it sits on the tracks, likely waiting for passengers to board. Near the train, there are multiple people scattered around the platform at various distances.\n\nIn addition to the train, there is a car situated not far from the platform, further suggesting that this location may be near a suburb or in a rural area where different modes of transportation coexist."}
{"image_id": 209733, "caption": "The image depicts a beautiful park setting where a group of people is enjoying flying a brightly colored kite near some trees. The kite is soaring high in the sky, catching attention as it rises above the group. The people appear to be engaged in the activity, with two of them on the playing field.\n\nThere are several cars parked around and close to the park area, some in the foreground and others further away. One car can be seen further to the right, and another one near the center of the image. The park itself has a mix of short and taller grass, with a few individuals present in the middle of the field, most likely observing and enjoying the kite-flying event."}
{"image_id": 428231, "caption": "The image features a well-furnished living room in an apartment, characterized by bright white walls that give the space a clean and modern look. The living room is filled with furniture, including two couches and several chairs surrounding the area. The seating arrangements provide ample space for relaxation and conversation. A potted plant and vase are also present in the room, adding a touch of greenery and aesthetic appeal. \n\nThe setting is further enhanced by modern décor, showcasing a stylish glass lamp that serves as a centerpiece, surrounded by various decorative items such as a bowl and a book. The combination of furniture, accessories, and overall design creates a comfortable atmosphere for any resident or visitor."}
{"image_id": 250619, "caption": "The image captures a woman sitting on her stomach on a beach towel, enjoying a sunny day. She is under the shade of an umbrella, presumably to protect herself from the sun. In addition to the beach towel, there is a handbag by her side and a couple of smaller handbags nearby. Another handbag is placed further away from her.\n\nThere is a backpack situated on the right side of the scene, potentially belonging to the woman or a friend. The overall ambiance suggests a pleasant beach day for relaxation and leisure."}
{"image_id": 434693, "caption": "The scene features a fire hydrant sitting on a sidewalk, positioned next to a red-trimmed building. The white fire hydrant is attached to a long silver chain which extends towards it, possibly for safety measures during its construction or maintenance.\n\nThere are two vehicles in the vicinity. On the left side of the image, a car is parked along the sidewalk, while slightly further to the right and towards the edge of the street, another car can be seen."}
{"image_id": 15596, "caption": "The scene features two people riding motorcycles on a race track, racing together at high speed. One motorcycle is positioned towards the left side of the track, and the other is on the right side of the track.\n\nThere are a few other people in the image, possibly spectators, or more participants in the racing event. A chair is also visible on the left side of the image."}
{"image_id": 569415, "caption": "The image features a large elephant standing alone in a grassy field. The elephant is facing left and appears to be walking through the field. Although it's unclear if the elephant is walking towards something or just exploring the prairie, the scene presents a captivating moment as the elephant navigates the grassy terrain."}
{"image_id": 305004, "caption": "The image captures a man skillfully balancing and riding a surfboard over a large wave in the ocean. He appears to be in the process of falling off or doing a trick over the surfboard. His wetsuit can be seen as he dives, highlighting the professional nature of his display. The water surrounding the surfer presents a dynamic, sporting atmosphere with its blue hue and rough waves."}
{"image_id": 510527, "caption": "The image depicts a bearded man with a neat and formal appearance, sitting inside a car with his hands clasped together. He is adjusting the loosened tie to give it a neat appearance. The car interior features various chairs, and a cup can be seen placed within reach of the man.\n\nIn the background, other cars are visible outside the window, suggesting that the man is in traffic or waiting at a stoplight. The man seems to be concentrating on his image while driving, ensuring that he is presentable to others sharing the road."}
{"image_id": 581317, "caption": "The image features a woman standing in a lush green hillside, engaging with her cell phone. She is looking up at the sky, possibly admiring the view or sharing her appreciation for the natural surroundings.\n\nIn the background, you can see mountains on the horizon, creating a picturesque setting. Several trees are scattered throughout the landscape, adding to the depth and beauty of the scene. The woman's hands are holding the cell phone, making it the focal point of the image as she focuses on using it."}
{"image_id": 532071, "caption": "The image showcases a large, full-grown brown bear sleeping peacefully in the woods, near a large white branch. The scene captures the bear lying comfortably on the grass under the fallen branch, with its head resting to the right side of the scene. This remarkable bear is the center of attention in the image."}
{"image_id": 467978, "caption": "The scene displays a beautiful mix of sheep and a dog in an open grassy field. The dog is running ahead of the flock, with two more sheep chasing behind it, all trying to keep up with the leader. In total, there are nine sheep in the scene, with some positioned closer to the foreground, while others are further in the distance. The dog is positioned relatively in the center of the scene, displaying a sense of being in the direction of the sheep."}
{"image_id": 184972, "caption": "The image features a lively dining area with several people seated at dining tables. They are all focusing on an older man who stands in front of them and has a bad tie on. The man appears to be delivering a speech or performing at the family gathering. \n\nA variety of people can be seen throughout the room, some sitting and others standing. There are multiple dining tables with tables laid out with wine glasses, suggesting a celebratory atmosphere. A chair is also visible on the right side of the scene. The room has a cozy and friendly ambiance evident in the people's interactions."}
{"image_id": 525568, "caption": "The image features two zebras standing in a grassy field, both near a small tree. One zebra is positioned slightly to the left of the other, appearing to be the main subject of the scene. The zebras are situated in the foreground of the image, creating a picturesque scene of wildlife in nature."}
{"image_id": 165056, "caption": "The image features two giraffes standing on opposite sides of each other, next to a wooden fence. The first giraffe is closer to the left side of the image, reaching almost the entire height of the picture, while the second giraffe occupies more than half the height of the scene from the right side.\n\nA person is standing in the background, almost at the center of the image. They are likely observing the giraffes from behind the fence. The person appears to be partially visible, making the scene seem dynamic and engaging."}
{"image_id": 362240, "caption": "The image shows a garage with several motorbikes and a stuffed deer on the wall. In addition to the collection of motorcycles, there is a dining table in the middle of the room. One motorcycle is prominently positioned on the right side of the image, drawing attention due to its presence amid the other vehicles. \n\nFurther in the scene, there are multiple books scattered around the area, likely indicating the owner's interest in reading or some other related hobbies. The garage also contains a sink, suggesting that this is a versatile space for various activities outside of motorcycle or vintage toy storage."}
{"image_id": 179558, "caption": "The image features two giraffes enjoying a meal together. They are eating from a tree branch that is suspended between them, displaying their long necks as they graze. The giraffes are positioned close to one another, showcasing their social nature, as animals often gather to eat together in the wild. Each giraffe has its own distinct mouth, and their necks and tails are visible in the background. The setting appears to be natural and grassy, providing the perfect environment for the giraffes to enjoy their meal."}
{"image_id": 120792, "caption": "The image showcases a group of people playing a video game on a large TV in a room. There are four individuals in total, with one standing near the TV taking a shot using a Wii remote, while others are actively participating in the gameplay. A man in a green shirt is focused on hitting something, possibly a sports ball. Another man on the right is also intensely watching the game.\n\nThe room contains a chair near the middle and a couch on the far right side of the scene. There is a sports ball located closer to the foreground, indicating that the game could be a motion-controlled sports game. A total of eight Wii remotes are visible in the room, which were likely used by the players during the game."}
{"image_id": 294865, "caption": "The image shows a crowd of people on the windshield of a very long, curved passenger train traveling on train tracks. There are at least 11 people visible in the scene. Some of them raise their hands in excitement, while others simply take in the view from the train's position at the highest angle. The passengers appear to be enjoying their train ride and taking in the sights around them."}
{"image_id": 159662, "caption": "The image shows a professional female tennis player wearing a pink dress on a tennis court, holding a racket in her hand. She appears focused and prepared, probably getting ready for a game.\n\nThere is a crowd of spectators surrounding the court, watching the tennis player's performance. In total, at least 13 people can be seen standing around the court, some closer to the foreground while others are in the background. One of the spectators appears to be using a camera to capture the moment.\n\nAdditionally, several people around the court appear to be wearing ties, possibly coaches, referees, or officials. A chair is also visible near the court's edge, possibly for the players to rest or for a referee to sit."}
{"image_id": 176906, "caption": "The image depicts an enclosed area, possibly a pen or a coop, where several sheep and goats are gathered around. The sheep appear to be eating from a feeder placed close to them. People are standing behind a fence observing the animals, with three individuals noticeable in the background. \n\nIn addition to the sheep and goats, two cars can be seen on one of the corners of the pen, and there are two benches placed near the pens as well. The scene seems to be related to an outdoor gathering or event where visitors can enjoy the presence of these animals."}
{"image_id": 250608, "caption": "The image portrays a quiet street with a public transit bus parked beside a tree and a road walkway lamppost. There is a yellow direction sign close to the bus, probably indicating the bus route or direction. The street appears to be relatively empty with only a few cars in the vicinity of the bus - one further back and another close to the tree. A person can be seen standing near the bus, likely waiting to board or disembark."}
{"image_id": 33561, "caption": "The image depicts a pastoral scene with multiple cows grazing on green grass in a big field surrounded by trees. There are at least fifteen cows spread out across the field, some of which are standing while others are lying down or walking around. The cows are of various sizes, indicating that they belong to different breeds.\n\nIn the distance, a farmhouse can be seen, adding to the countryside atmosphere. Additionally, there is a car parked near the edge of the field, possibly belonging to someone visiting the farm.\n\nThough the image lacks the distinct presence of clouds, the pastoral setting still invokes a serene and peaceful ambiance."}
{"image_id": 274612, "caption": "The image features a row of bicycles parked in front of an older-style building. Some of the bicycles are locked up with locks for security. In addition, umbrellas are seen sitting atop both a red and a yellow bicycle. \n\nThe scene also includes several pieces of folding furniture outside the building, with a cup placed on one of the tables. The presence of various items on the sidewalk suggests the area might be a social gathering spot or an urban scene with people passing by."}
{"image_id": 288714, "caption": "The image is of a cooked pizza on a counter, featuring an assortment of toppings such as olives and peppers. The pizza is cut and ready to be eaten, with the various toppings spread across the surface. There are sliced olives visible in multiple locations, along with whole olives in different areas on the pie. Additionally, a couple of chopped vegetables, possibly peppers, can be spotted mixed in among the toppings. The scene is a delicious and inviting representation of a freshly prepared pizza."}
{"image_id": 284379, "caption": "The image captures a young boy riding a yellow surfboard on top of a wave in a large, clear pool. He is skillfully balancing on the side of the board as he enjoys the waves. The surfboard stretches across the lower portion of the image.\n\nAround the main subject, there are a few other people in the pool, with one towards the left and two more on the right side. They seem to be enjoying the pool and the waves, making it a lively scene for them."}
{"image_id": 205247, "caption": "The scene features a white public transit bus parked on a street next to a building. The bus is covered with advertising, particularly featuring basketball and Cincinnati State advertisements. An open airport shuttle bus can be spotted near the center of the street. \n\nThere are two people located near the bus – one person is standing at the end of the street, and another is near the edge of the image, closer to the right side. A truck can be seen further down the street near the left side. The area appears to be parked, possibly for public transportation purposes or waiting for passengers."}
{"image_id": 200267, "caption": "The image features a person skillfully playing tennis, reaching to hit a ball with their tennis racket. The tennis player can be seen on the court, and there are multiple people gathered around the court, watching the game. Some of the onlookers are standing near the fences, while others are positioned closer to the tennis match. There are also numerous sports balls and tennis rackets present in the scene, indicating intense gameplay and enjoyment."}
{"image_id": 296775, "caption": "The image features a large blue and yellow public bus driving down a city street, with its doors open, likely waiting for passengers to get on. It is traveling in front of a building, possibly a parking garage, considering the presence of two bicycles placed near the entrance. On the street, there is also another smaller bicycle towards the right side of the image.\n\nSeveral pedestrians are walking in the area – two people can be seen closer to the bus, while others are scattered throughout the scene. The scene captures a typical urban setting with people commuting and bikes being used as a mode of transportation."}
{"image_id": 4265, "caption": "The scene displays flowers inside vases placed on a windowsill, possibly positioned on the dining or kitchen table. There are three vases, with one next to the window and the other two close to each other. The vases hold various potted plants, creating a beautiful floral arrangement. \n\nAside from the vases holding flowers, there are some bottles surrounding them – one near the leftmost vase, another next to the center vase, and the third one located toward the right. The setting seems cozy and inviting, enhancing the ambiance of the room."}
{"image_id": 104392, "caption": "The image showcases a renovated kitchen featuring wooden cabinets and countertops. The kitchen is equipped with a variety of appliances, including a microwave on the left side, a refrigerator occupying the right side of the space, and a sink near the center. Additionally, a dishwasher can be seen underneath the countertop, adjacent to the sink. \n\nOn display is a multitude of cups placed on several surfaces throughout the kitchen for convenience or easy access. Various knives, spoons, and a bottle can also be found in the area, with the bottle located in the middle upper part of the scene. A wooden dining table can be seen towards the right side of the image, completing the inviting and modern kitchen setting."}
{"image_id": 316658, "caption": "The image shows a serene scene of a couple of ducks resting next to a tree by a lake. The ducks seem to be enjoying their time by the edge of a park near a park bench. A person is also visible in the scene, likely observing the tranquil moment. \n\nIn the surrounding area, there are a couple of boats visible on the water. One boat is larger, occupying a significant portion of the lake, while the other appears smaller, closer to the ducks. The overall setting suggests a peaceful and quiet day spent by the large body of water."}
{"image_id": 230993, "caption": "The image depicts three women walking on a city street during a rainy day, all shielding themselves from the rain with umbrellas. The umbrellas have a checkered pattern and a solid red color, which adds vibrancy to the scene.\n\nThe women are holding handbags while they walk, with each individual holding a separate umbrella protecting them, and their handbags, from the rain. The presence of multiple umbrellas and handbags indicates the scene takes place in an urban environment, likely in a busy area of the city."}
{"image_id": 321035, "caption": "The image features a beautifully decorated cake on a counter top, covered in white icing and red frosting. The red frosting spells out \"welcome Malachi,\" indicating that the cake is celebrating the arrival of a newborn Malachi or perhaps a special event related to the name. The cake is well-presented and a delightful centerpiece for the gathering or celebration it represents."}
{"image_id": 571038, "caption": "A woman is standing in a kitchen, holding a large tray filled with a cooked pizza. The pizza is adorned with an array of vegetables, including slices of cheese, possibly basil or other herbs. She seems to be proudly showing off her delicious creation. In the background, a sink can be seen, as well as an oven and some additional bowls of various sizes. Another person seems to be barely visible in the scene, likely in the right portion of the room. There are a couple of bottles placed on a countertop, and a knife can also be spotted in the room."}
{"image_id": 395978, "caption": "The image depicts airport workers wearing hard hats as they dig up holes in the snow-covered area. There are two people, one relatively close to the left side of the frame and the other one between the left and right sides. The two workers together are busy working on creating slots in the snow for an airplane's landing gear.\n\nIn the background, a large passenger jet is parked on the runway, likely waiting for its next flight. This airplane fills the majority of the scene, occupying the space from the left edge to almost the whole width of the image."}
{"image_id": 482917, "caption": "The image features a man lying on a couch, comfortably watching TV with a small dog lying nearby. A small black and white dog is sitting comfortably on the man's feet, likely enjoying the warmth and company. The scene is cozy and relaxed, displaying a close bond between the man and his pet.\n\nIn addition to the couch, there are two TVs in the room, one situated in front of the man and the other at the top right corner of the scene."}
{"image_id": 207561, "caption": "The scene captures several people enjoying their time at the beach, where they are riding waves on surfboards. The surfboards are positioned in various waves, with some people closer to the ocean shore while others are in the middle of a wave. \n\nThere are 12 individuals spread across the beach, with some standing or waiting for their turn to catch the waves. The beach is a lively and active place as people make the most of the sunny day and the good surfing conditions."}
{"image_id": 369470, "caption": "The image shows a long row of cars parked along a street in an urban setting. There are several vehicles occupying the space, including a total of nine cars. One of the cars, located near the left side of the line of parked cars, has a parking meter in front of it. \n\nA few people can be spotted walking near the row of cars parked on the side of the road, while another person is standing further back. Additionally, there are two traffic lights visible, one near the center of the scene and another towards the left.\n\nThe combination of the parking meter and presence of people suggests that this is an area where parking spots are limited and regulated."}
{"image_id": 482210, "caption": "The image shows a small bathroom from the corner view, showing a white toilet with a blue base, a sink with a white counter, and a mirror above the sink. Above the toilet, there is a white stand with shelves. Additionally, there is a bottle on the counter and a toilet brush located close to the toilet for easy access.\n\nThe white and blue bathroom has a unique and refreshing color scheme, making it a pleasant space for daily use."}
{"image_id": 525381, "caption": "The scene showcases a group of baseball players in a dugout, one batter swinging a baseball bat with focus and determination. The players are sitting and standing around him, watching the game closely. \n\nThe batter is equipped with a baseball glove, ready for the ball to come his way. Aside from the batter, there are multiple baseball gloves scattered around in the dugout, some being worn by the players on the bench, and others placed at different positions. The dugout looks crowded with several players occupying the space, all eager for the next play in the game."}
{"image_id": 156375, "caption": "The image features a woman standing on top of the snow in ski gear, wearing a bright purple jacket. She is posing as if she is ready to ski, as she is holding her skis and poles in the pose.\n\nBehind her, there is a building and another person partially visible on the left side. A few chairs can be seen on the ground as well. The scene gives a sense of a ski area or resort, where people may enjoy winter sports and relaxation."}
{"image_id": 334399, "caption": "In the image, there is a man standing in front of a vintage clock with Roman numerals. He is dressed in colonial attire and holds an object resembling a clock. The man appears to be the center of attention in the scene.\n\nAnother person is standing nearby, also dressed in colonial attire. In the foreground, there is a large pile of books scattered around. Additionally, a bowl can be seen on a surface near the center of the image."}
{"image_id": 322955, "caption": "The image showcases a serene beach during sunset. A lone seagull is the focal point, sitting on the sand with its wings spread and looking out to the ocean. The coastal setting with the water at sunset highlights the beauty of this natural scene. The bird's placement on the shore, near the water, creates a peaceful and reflective ambiance, perfectly capturing the essence of a beach moment."}
{"image_id": 312024, "caption": "The image features a small blue bird perched on the ground, posing beside some foliage. The bird is prominently visible and captures the viewer's attention. There is a grassy field with patches of dried grass, indicating the location may be a savanna or a similar setting where the bird resides. The grass provides a natural and serene backdrop for the bird."}
{"image_id": 118715, "caption": "The image features a red fire hydrant situated in front of a building on a city street. The fire hydrant is quite large, dominating the scene. It is situated on the corner of the sidewalk, next to a cobblestone building.\n\nAside from the fire hydrant, there are two chains placed near the bottom part of the hydrant. These chains likely serve as supports or as a symbolic gesture for the hydrant's functionality. There are no other significant elements in the scene aside from the hydrant and building as the main focus."}
{"image_id": 237318, "caption": "The image features a red and white stop sign placed at the bottom of a tree-covered slope, next to a dirt road. The stop sign is standing on a pile of rocks and has fallen over due to exposure to the elements. The scene gives off a somewhat abandoned vibe, possibly resembling a neglected logging trail. There are a couple of people positioned at the top left corner of the image."}
{"image_id": 236865, "caption": "The scene features a small girl standing on the road, holding a large red frisbee in her right hand. She appears to be enjoying her time outdoors, possibly engaged in a game of frisbee.\n\nIn the background, there are houses and trees lining the street. A chair is also placed on the left side of the scene, possibly indicating that the area is a resting place or a yard.\n\nFurthermore, another person can be spotted standing behind the girl, but they are not the main focus of the image. The little girl is the central figure in the picture, showcasing her playful activity in her surroundings."}
{"image_id": 72096, "caption": "The scene is depicted in a restaurant or dining area, where a woman is seated at a round table filled with various food items and utensils. She is the main subject of the image. A plate with a delicious-looking muffin is sitting in front of her, while multiple forks and knives are set both on the table and surrounding her.\n\nOther tables are visible in the area, showing that the dining area is a common gathering spot. In addition to the main subject, there are two more people in the scene, one situated towards the right side of the image and another near the left side. A refrigerator can be seen in the background, indicating the presence of a kitchen or break room in the space. \n\nVarious chairs are placed around the dining tables, and there are various bottles and other tableware elements to complete the diner ambiance."}
{"image_id": 450762, "caption": "The image features an army of teddy bears and small dolls lined up on various boats, appearing as if they are either on a boat trip or a war. These teddy bears are spread across several boats, each holding their own equipment such as guns or cannons. Some even have backpacks and ties on, giving them a more authentic and playful warrior vibe. Altogether, these life-sized stuffed animals create an amusing and unique scene."}
{"image_id": 168974, "caption": "The image features a young child sitting on a wooden floor, holding a cell phone gripped firmly in their hands. The child seems to be focused on using the phone, which appears to be a smartphone. The child is surrounded by various objects such as a dining table nearby and a clock hanging on the wall above them. A keyboard can also be seen close to the dining table, likely indicating a home office or workspace set up in this room."}
{"image_id": 559950, "caption": "The image features a small dog sticking its head out of the window of a moving car or a passenger van. The small shaggy dog appears to be enjoying the ride outside, looking at something off to the left.\n\nAside from the driver or passenger in control of the vehicle, there are two other people partially visible in the scene, with one standing on the left side and another on the right. A few cars can be seen ahead of the vehicle, driving in the same direction.\n\nThere is a traffic light visible on the left side of the image, further indicating that the photo captures an urban setting, possibly a city street."}
{"image_id": 575776, "caption": "The image showcases a pair of unique animals in an open field: a rhinoceros and a zebra. They are standing next to each other, intrigued by each other's presence. A baby zebra can also be spotted in the foreground, interacting with the rhinoceros adult or seemingly being a part of the scene.\n\nThe field has a backdrop of mountains, creating a picturesque and natural setting for these animals. The animals are close together, but the distance between them is not too close, giving them some space to roam freely and interact. The combination of the rhinoceros and zebra in this image indicates a captivating moment between two different species."}
{"image_id": 552352, "caption": "In the image, there is a delicious piece of cheesecake sitting on a dining table. The cake is sliced and ready to be eaten. It sits on a plate, accompanied by a metal fork. The fork is positioned horizontally on the dining table, making it easy for the person to enjoy their piece of cake. The scene is set to show that it is a perfect moment to enjoy dessert, as evident by the inviting display of cheesecake and fork."}
{"image_id": 490683, "caption": "The image shows a man and a woman standing on a green grass field in various positions, possibly in motion. The man is holding a frisbee, getting ready to throw it either to the woman or someone on the opposing team. The woman, wearing a sports jersey and black shorts, appears focused on the game.\n\nIn the scene, there are two other people present, watching and possibly waiting for their turn to participate. One of them is carrying a smaller frisbee. Additionally, there's a row of orange traffic cones to provide a clear layout of the playing area."}
{"image_id": 76417, "caption": "A bulldog is sitting in the back of a truck, peering over the side with a curious look on its face. The truck is stationed at a traffic light, but the dog appears unaware of its surroundings as it watches beyond the bumper, waiting patiently for its turn. The truck takes up the majority of the scene, and the traffic light stands above it, with the bulldog near the frame's middle."}
{"image_id": 231153, "caption": "The image depicts a person snowboarding high in the air, performing a jump outside in the snow. They are fully focused on keeping their balance during this impressive aerial display. The snowboard is clearly visible beneath the jumper as they soar above the ground, showcasing their skill and expertise in the sport."}
{"image_id": 190497, "caption": "The image features a large group of cows gathered outside of a dairy, with some of the cows inside the barn as well. There are two large herds of black and white cows visible, resting and occupying the space outside of the building. The cows are positioned all around the area, with some closer to the barn and others spread out in front of it. Some of them can be seen near the back of the scene while others are closer to the middle or the foreground. The overall scene displays a typical setting for a dairy farm."}
{"image_id": 126065, "caption": "The image features the front of a building with a beautiful clock tower on display. At the top of the clock tower, there are two gold bell-like figurines, each with one on the left side and the other on the right. The clock itself is positioned below these bell figures, making it the focal point of the scene.\n\nThe building is constructed with bricks and appears to have been built long ago. The presence of the clock tower and bell figurines suggests that it might be an ancient structure, reflecting the architectural style of that time. It adds a certain charm and historic significance to the building."}
{"image_id": 375915, "caption": "The image features a wooden table with a delicious pizza prominently placed on a pizza stone serving board, drawing attention to its appetizing toppings like vegetables. A knife is placed near the pizza, ready for someone to cut and enjoy the meal.\n\nSeveral items are scattered around the table, including a wine glass positioned towards the back right of the scene, two bowls on the left side of the table, and four carrots scattered in various locations. The table also has several cups, with three placed near the middle and another near the right edge. In addition, there is a fork resting towards the right side of the table."}
{"image_id": 95022, "caption": "The image portrays a green and brown bird sitting on top of a thin tree branch. The bird has a unique look, possibly resembling a parrot due to its large red eye and its positioned eyes. The bird seems to be looking back, possibly at a camera or another object.\n\nIt appears to be sunny outside, adding brightness to the scene. The small bird is the main focus of the image, occupying a significant portion of the frame. There is an interesting detail in the background, with a cat in the background on the right side of the picture, likely looking at the bird from a nearby window or terrace."}
{"image_id": 177935, "caption": "The image features a large metallic kitchen stove sitting under a yellow light fixture. The stove is positioned near the center of the room and is prominently displaying four burners, which are likely gas burners. \n\nVarious utensils, including knives and spoons, are placed around the stove, indicating ongoing cooking or recent activity. There are three spoons, one at the far left, another closer to the center, and the third towards the far right. Seven knives are visible, with some placed around the outer perimeter of the stove and others closer to its burners, suggesting a well-stocked kitchen. Additionally, there is a bowl near the left side of the room, likely used for food preparation or serving."}
{"image_id": 380117, "caption": "The image features a brown and white Siamese cat sleeping on a table filled with several potted plants. The cat is curled up and appears to be resting comfortably on the table, making the scene cozy. The plants surrounding the cat seem to provide a sense of a garden atmosphere with various small and large potted plants of different types located throughout the table. The focus is mainly on the cat as it takes up most of the table space, and the collection of potted plants adds a touch of greenery and flora to the scene."}
{"image_id": 132373, "caption": "The image showcases a clock, which appears to be quite old, hanging in a building. It is a prominent feature, positioned under an American flag that is flying above the clock. The clock's display is black and white, giving it a classic and elegant appearance. \n\nBeside the clock, there is a light fixture mounted on the wall, providing proper illumination for the area. Additional windows can be seen both above and below the clock, indicating that the building may be large or multifloor."}
{"image_id": 284282, "caption": "The image features a green countertop with two appliances sitting upon it. The first appliance appears to be a blender, which is positioned towards the left side of the countertop. The second appliance is a toaster, taking up the majority of the right side, and appears to be located at the edge of the countertop. Both appliances are turned off, creating a sense of inactivity in the scene."}
{"image_id": 276707, "caption": "The image showcases a colorful and playful \"No Motorcycles\" street sign in front of a building, sitting next to the building's door. The sign also displays a car, a bicycle, and some motorcycles. \n\nBeyond the building, there is a parking area featuring several cars parked along the street. Two people are visible in the image, with one on the left side and the other on the right side of the scene. Additionally, there is a backpack placed close to the door, possibly belonging to one of the people in the vicinity."}
{"image_id": 194704, "caption": "The image shows a smiling girl wearing ski gear and holding up her snow skis on a snow-filled ground. She seems excited and poses proudly with her skis in hand. There are several people in the scene, both in the foreground and background, possibly engaged in skiing activities. \n\nIn addition, one person is wearing a backpack, which may indicate they are on a long skiing trip or carrying other essentials for their excursion. The skis and people in the image create a cheerful and engaging atmosphere, reflecting the fun and excitement of skiing."}
{"image_id": 430286, "caption": "The image depicts a double mattress placed on a bed frame. Next to the mattress, three remote controllers are neatly laid out, indicating that these may be used for controlling multiple electronic devices within a sleeping or living environment. One remote is located at the left side, another in the center, and the third at the top right of the mattress. The setting provides a comfortable and convenient setup for the use of remote controls without disturbing the sleeping position."}
{"image_id": 361171, "caption": "The image shows a snowboarder skillfully leaping into the air, doing a trick mid-way through the jump. It appears that the person is in mid-air, getting ready to land after performing the impressive maneuver. \n\nThe snowboarder can be seen using a snow-covered ramp to gain enough airtime to showcase their skill. The scene provides an up-close view of the snowboarder, showing off their talent and expertise in the sport."}
{"image_id": 406451, "caption": "The image features a unique scene where a horse is pulling a red carriage down a city street. There are multiple cars parked on the side of the street, as well as a truck a bit further back. A few traffic lights can be seen in different areas, ensuring proper regulation of traffic flow.\n\nInterestingly, there are two people visible in the scene - one standing relatively closer to the horse and the carriage, while the other is located nearer to the middle of the scene. The horse and carriage combination provides an interesting contrast to the more modern transport seen in the background."}
{"image_id": 57286, "caption": "The image features a skate park scene with young skateboarders skillfully executing their tricks. A young man is in the middle of a stunt, holding his board up in the air while airborne after coming off a ramp. Another person is seen jumping down an enclosed ramp and catching air. \n\nThere are multiple skateboards and backpacks in the scene, with a few belonging to the kids performing tricks. One of the backpacks is positioned near the skateboarding area, while the other is seen closer to the edge of the image. The atmosphere appears lively and action-packed, exemplifying the popularity and excitement of skateboarding as a sport and recreational activity."}
{"image_id": 535952, "caption": "The image features a wooden table displaying three delectable chocolate cupcakes, each with a different frosting style. Two of the cupcakes are sitting closer to the front with their frosting visible, while the third cupcake is positioned a bit further back. A spoon is placed near the right side of the table, ready for serving the delicious treat. The arrangement of the cupcakes highlights their mouthwatering appeal and makes them the centerpiece of the scene."}
{"image_id": 455772, "caption": "The image shows a man wearing a cap and blue jeans, jumping high in the air to catch a white frisbee. He's actively engaging in a playful moment, reaching for the frisbee with the intention of successfully bringing it down.\n\nIn the background, there are two cars visible, one located near the middle of the image and the other on the left side of the scene. The outdoor setting also features a ladder standing near the man, suggesting that the space might have a multi-story apartment or a similar structure nearby."}
{"image_id": 63617, "caption": "In the picture, there are two children playing catch with a baseball using their gloves. A young boy wearing glasses is holding a baseball mitt, ready to catch a thrown ball. The other child, a slightly overweight young boy, is also extending his baseball glove, trying to catch the ball as well.\n\nThe image is set in a backyard filled with potted plants and a bench. An adult is also present in the scene, likely supervising or watching the children play baseball."}
{"image_id": 90155, "caption": "The image captures a large yellow and black train with several cars on the tracks, resembling a freight train. It is traveling on the railroad near a water tower. The train stretches across most of the visible part of the image, showcasing the sheer size of the locomotive. With its impressive size, the train seems to dominate the scene as it continues along its journey."}
{"image_id": 158127, "caption": "The image features an orange tabby cat comfortably lying on the feet of a person, snuggled between their legs. The cat occupies the majority of the scene, spread out across the person's feet.\n\nThe person appears to be wearing denim pants, and a handbag is placed on the ground close to the scene. The setting appears to be outside, considering the presence of a pile of rocks in the background."}
{"image_id": 248582, "caption": "In this scene, a group of three people gather outside of an outdoor farmers market where vendors display their fresh produce. One of the individuals is inspecting bananas while standing next to the market tent. The other two people can be seen in the background, likely browsing through the available fruits.\n\nThe market is filled with various fruits, including piles of bananas, apples, and oranges. In total, there are at least 12 bunches of bananas, 4 bowls of assorted fruits like apples and oranges, and a backpack on the ground close to the people. Overall, the market exhibits a lively atmosphere, inviting visitors to explore and purchase fresh fruits."}
{"image_id": 206560, "caption": "In the image, a snowboarder is high in the air, having just finished a jump. The snowboarder is surrounded by spectators, with two onlookers underneath the rider, and two more situated to the left. It appears that the snowboarder is performing on a half-pipe or a ramp, providing an exciting and challenging atmosphere for the event.\n\nAt the outset of the frame, there is a truck and a car, likely parked along the snowy street adjacent to the location of the jump, possibly for the spectators and event setup to access the ramp."}
{"image_id": 69009, "caption": "The image features two young children standing on the platform outside a glass enclosure, observing a large brown bear inside the facility. Both kids seem to be enthralled by the sight of the bear. One child is on the left side of the enclosure, while the other is on its right. \n\nAs the kids look into the exhibit, a second individual is partially visible on the left side, possibly accompanying the kids while they observe the bear. It seems like the children and their friends are enjoying the view of the majestic animal from behind the glass."}
{"image_id": 322122, "caption": "The image features an open toilet seat with a white toilet bowl on a tiled floor. The toilet is located in a bathroom, and the seat cover is held in place with two straps, one near the top and one near the middle of the seat.\n\nNext to the toilet, there is a small bottle positioned near the side of the bathroom, possibly containing soap or hand lotion. The overall scene suggests a typical bathroom setup."}
{"image_id": 549930, "caption": "In the image, a young man and woman are walking down a street, sharing an umbrella for protection against the rain. They are walking together under the umbrella, with the young man on the left side of the woman. This scene captures a moment of their affection on this rainy day.\n\nIn the surrounding area, there are several other people walking in the rain. Some have umbrellas as well while others choose to walk without them. There are also more people visible further away, likely enjoying a rainy day at the beach."}
{"image_id": 33216, "caption": "The image features a large, partially eaten veggie pizza placed on a hot dog bun on a table. The pizza has lots of toppings, making it a flavorful and delicious meal. The pizza has not been cut, and it takes up a considerable portion of the table space.\n\nA person is sitting behind the pizza, and there are two chairs nearby. In addition, there are other people present in the scene, possibly enjoying a meal or socializing, making the setting a lively gathering."}
{"image_id": 434581, "caption": "The image captures a motorcyclist riding down a street on a black bullet motorcycle. The cyclist appears to be wearing a leather jacket, and they have a helmet on to enhance their safety while riding. In front of the motorcyclist, there are some chairs arranged at the side of the road, possibly suggesting a temporary event or gathering that recently ended."}
{"image_id": 239509, "caption": "The image depicts a city street with two different road signs mounted on a steel post. One of the road signs is an upside-down, stencil street light symbol, which possibly indicates a blocked or prohibited area. \n\nA man is walking past the two street signs beside a sidewalk. There is a bicycle parked a short distance from the man, leaning against a nearby surface. In the scene, one can also spot a car parked further down the road."}
{"image_id": 88848, "caption": "The image is a collage of four pictures featuring people at an outdoor event. In the first collage, a young woman poses in front of a park with a red and yellow fire hydrant in front of her. The fire hydrant appears to be yellow with a cherry on top.\n\nIn the second collage, three people are holding their cell phones at an event in a park, capturing the moment. The woman posing with the fire hydrant is in the middle of the picture while another woman is posing on the left, and a man is standing on the right side of the image.\n\nThe last collage showcases different types of colorful fire hydrants in a park setting. Two fire hydrants with distinct colors, one blue and the other red, are visible in this collage.\n\nThe photographs are carefully composed and edited, capturing the essence of the outdoor event with people enjoying their surroundings and the presence of colorful fire hydrants."}
{"image_id": 116182, "caption": "The image features a large portion of food displayed in a large ceramic bowl placed on a dining table. The bowl hosts a delicious assortment of meat, likely cooked chicken, and various pieces of meat arranged within the bowl. In addition to the meat, the bowl is also full of vegetables, including several carrots, sprinkled among the delicious chicken dish. The appealing arrangement of food creates an inviting presentation for those looking to enjoy a hearty and flavorful meal."}
{"image_id": 562345, "caption": "The image features a woman dressed in a yellow coat, seemingly getting out of her car. She is standing in a parking lot, looking at her cell phone, which she holds in her hand. The woman has a green and blue outfit on, and she appears to be a pretty young lady.\n\nHer jean pants and the jacket create a bright, yellowish appearance. She is standing alone without any other visible people in the scene, giving an impression of being focused on her cellphone. Additionally, the woman is wearing a watch on her left wrist as she looks at her phone."}
{"image_id": 343410, "caption": "The image features a dining table set with a plate of broccoli and several onions. There are at least five pieces of broccoli, placed in a somewhat random order, with some overlapping or partially covering the onions. Some of the broccoli pieces are situated closer to each other in a line, while others are more isolated on the plate. The onions are placed beneath the broccoli, sharing the plate's space and creating a healthy, colorful vegetable display."}
{"image_id": 490529, "caption": "In the image, a black woman sits with a pink sweater and glasses on, looking down at her cell phone. She is in a public space, which suggests a restaurant setting. Another person with glasses can be seen in the background, likely enjoying a meal.\n\nSurrounding the woman, there is a dining table and a few chairs. A large dining table can be seen in the middle of the scene, accompanied by a chair on the side. Additional chairs are placed in various locations around the room.\n\nAlso in the scene, there are two cups, one situated closer to the dining table, and the other at the top of the room. A backpack can be spotted, likely left by one of the diners. There are several other people in the background, indicating that it is a popular dining spot."}
{"image_id": 328818, "caption": "The image captures a woman wearing a pink shirt, fixing the straps of her helmet on her bicycle while sitting outside of a bench. The scene appears to be taking place in a park, given the presence of benches and the surrounding environment. Additionally, there are other people in the background of the image, possibly enjoying a walk on a path along the same trail as the woman and her bicycle."}
{"image_id": 218947, "caption": "In the image, there is a person on skis skiing down the side of a mountain in a blurry setting. The skier is focused on navigating the slope, and no other people are visible in the picture. There is another, smaller person on skis following the skier from behind. The scene depicts a snowy mountain environment.\n\nThe skier has a backpack on, likely containing essential equipment or supplies needed for their journey. There's also a suitcase in the image, which might be used for extra storage or transporting belongings while skiing."}
{"image_id": 152281, "caption": "The image shows a large group of small sheep with blue numbers on them, grazing in a grass-covered field. The sheep are positioned all over the field, moving around and feeding on the grass. There is an assortment of sheep in different locations within the field.\n\nTall evergreen trees can be seen behind the sheep, adding a touch of scenery to the rural setting. Some small figures are also visible in the background, possibly indicating shepherds or onlookers observing the grazing herd. The overall scene is a peaceful, pastoral landscape filled with a multitude of curious sheep."}
{"image_id": 41110, "caption": "The image captures a young child drinking a bottle or cup, with the focus being on the child's actions. They appear to be making the most of the moment, actively participating in the process of sipping from the container. The child's attention is fully directed on the drink, giving a sense of engagement while consuming the beverage."}
{"image_id": 512985, "caption": "The image features a person standing on a beach, holding a surfboard and looking out at the ocean. The surfer is positioned towards the center of the scene, with their surfboard parallel to the shoreline. The beach seems to be a relatively calm and serene environment.\n\nThe ocean in the background stretches to the edge of the frame, creating a sense of vastness. The surfer seems to be enjoying a moment of contemplation or observation, perhaps taking in the beauty of the water and surroundings."}
{"image_id": 414212, "caption": "In the image, a man with a wild haircut is standing in a bathroom holding up two products, possibly toothbrushes or grooming items. He is giving a thumbs-up sign, indicating his approval or positive attitude towards the products. The toothbrushes in the man's hand and the bathroom setting are reminiscent of a scene from a reality show or an advertisement for dental care products."}
{"image_id": 426578, "caption": "The image features a person wearing a wetsuit, standing on a sandy beach near the water. They have a surfboard with them, likely preparing to surf. Several other people are scattered around the beach, some closer and some farther away, likely enjoying their time near the ocean.\n\nA car can be seen on the far side of the beach, likely belonging to one of the beachgoers. There is also a bird visible in the sky, adding to the beach's serene and natural atmosphere."}
{"image_id": 291962, "caption": "The image depicts a young boy standing in the middle of a grass-covered field, flying a multi-colored kite with great enthusiasm. The kite is high in the air, soaring near a tree in the top right corner of the field. \n\nAnother person stands in the distance on the left side of the field, possibly watching the boy fly the kite or participating in the activity. The lush green field provides a beautiful and open area for both the boy and the observer to enjoy their outdoor activity."}
{"image_id": 460927, "caption": "The image features a large bear standing upright on top of a grassy hill, looking as if it is posing for the camera. The bear is standing near a rock on the hill and appears to be facing the viewer, possibly towards the left-hand side. The scene captures the beauty and majesty of the wild wilderness landscape, depicting the bear as an integral part of nature's biodiversity."}
{"image_id": 552186, "caption": "The scene is set on a bustling sidewalk near a street, where several people can be seen at various positions, engaged in different activities. Some are walking around, while others are standing or sitting down. Two people are notably skateboarding in the area. One skateboarder has his board on the ground, indicating he might be performing a trick, while another skateboarder is actively riding their skateboard, navigating through the pedestrian traffic.\n\nAnother notable aspect of the scene is the presence of two potted plants on the sidewalk, one located closer to the left side and the other further back on the left-center area. A truck and a person with a backpack can also be seen among the pedestrians, adding to the busy atmosphere of the street."}
{"image_id": 553852, "caption": "The image features a child riding a skateboard across a wood floor. The young boy is skillfully navigating the board, seemingly performing a trick. In the surrounding area, there appears to be a park with a bench and a parked bicycle. Multiple chairs are scattered and placed around the park, likely for visitors to sit and enjoy the area."}
{"image_id": 370337, "caption": "The image features a marina with two boats moored at the dock. The first boat is a red one, while the second boat is smaller and white. They are docked on a concrete pier next to some buildings, likely a city skyline. The presence of buildings and the waterfront establish an urban environment. \n\nA third boat can be seen in the background, further down the water. This scene suggests a harbor or riverfront location where people can access their boats and appreciate the surrounding scenery."}
{"image_id": 18491, "caption": "The image features a group of young baseball players on a field, playing a game. In the foreground, an exciting play is taking place, where the catcher and the baseman are both diving for the baseball. The boy catcher appears to be sliding into the base, while the baseman is attempting to tag him out.\n\nOther baseball players can be seen in the background, with some positioned closer to the edge of the field and others standing further away. Several boys are crouching or kneeling down as they observe the action unfolding in front of them. Baseball gloves and a sports ball are visible near the center of the playing area, completing the scene of a lively baseball game."}
{"image_id": 556000, "caption": "The image features a room with people of all ages. A boy in the center is playing a Wii game, holding a remote control, while a little boy plays nearby. Other people are present, enjoying the gathering and watching the activities.\n\nThere is a couch in the room, and a chair nearby, and some other chairs placed apart from the furniture. A bottle can be seen on a surface in the room, perhaps indicating a beverage or snack moment. The room also has a potted plant and a bed, suggesting a home setting."}
{"image_id": 443351, "caption": "Both motorcycles are parked in a parking lot, occupying different parking spaces. There is a white motorcycle parked on the left side of the image, while the green motorbike is on the right side. In addition to the motorcycles, there is a scooter parked between them, occupying the middle parking space.\n\nThe parked motorcycles and scooter are the main focus of the image, showcasing these vehicles prominently in the parking lot."}
{"image_id": 63965, "caption": "In the image, a woman is sitting with a piece of cake with red frosting and a cherry on it. The slice of cake looks quite appetizing, and she is holding the delicious dessert in her hand. The cake is placed on a piece of white wax paper, adding to the presentation. Nearby, there is another larger piece of cake with red icing and a cherry on it, suggesting there are more treats to be indulged in. A knife is also visible in the scene, likely used for cutting the cake or serving it."}
{"image_id": 405660, "caption": "The image depicts a park with a lonely wooden bench resting peacefully near the tall trees. This overlooks a beautiful and vast valley, offering a captivating view of the mountain range spread in front. The bench is situated to take full advantage of the scenic vantage point, inviting visitors to relax and enjoy the serene surroundings."}
{"image_id": 419144, "caption": "The image captures a lively scene where several men are standing next to two elephants. The elephants are standing beside each other, with one slightly behind the other. Each elephant holds a person, showcasing their majestic nature. In total, there are four people visibly sitting on the elephants, with one in the middle, one on the left, and two on the right side of the elephants. One person can be partially seen at the far left of the image, but they are not clearly present as they are too small and out of focus."}
{"image_id": 371004, "caption": "In the image, a zebra is standing in a fenced enclosed area, possibly a zoo exhibit, with its face sticking out of the fence. The zebra appears to be reaching out towards the camera, possibly enticing visitors to get a close-up view. \n\nThere are a few other people in the vicinity, some of which are closer to the zebra, while others are farther away. One person can be seen standing in front of the zebra, while others are positioned around it, possibly observing and admiring the beautiful animal."}
{"image_id": 116861, "caption": "The image features a woman wearing a wedding ring, lying down on a couch holding a stuffed teddy bear in her left arm. She appears to be relaxed and possibly resting. On her right arm, she's holding a wine glass, suggesting she might have been drinking earlier. The room appears comfortable and inviting, with the woman resting in a cozy spot."}
{"image_id": 579664, "caption": "The image displays an outdoors fruit stand with a large group of ripe bananas and plantains. There are numerous bunches of bananas, some of which have green and yellow coloration, and others are bright yellow. The banana bunches are placed at different positions on the stand, from the middle to the back, and cover parts of the stand from front to back. Additionally, some plantains are visible along with the bananas, adding variety to the stand."}
{"image_id": 5600, "caption": "The image features a dining table with three small metal bowls containing a variety of food items. The first bowl, on the left side of the table, holds green peppers along with some peeled fruit. The second bowl, positioned closer to the right side of the table, contains a mixture of meat and a spoonful of sauce. The third small bowl, on the far right side, is filled with sliced fruit, including pink and orange slices. These diverse dishes create a pleasant variety for a meal."}
{"image_id": 199389, "caption": "The image features a whimsical fire hydrant decorated to look like a train conductor. It is painted in red, white, and black colors, making it the center of attention on the side of a road. The hydrant stands amongst some rocks and debris, appearing to be part of a junkyard.\n\nIn the background, there are a few cars and a truck parked along the street. One car is positioned close to the left edge of the image, while two other cars are visible at the top right corner, and a truck is parked near the top left corner. A bottle can also be seen lying on the left side of the image, amidst the debris."}
{"image_id": 568131, "caption": "The image features a large elephant walking through a grass-covered field. The elephant is prominently visible in the foreground, extending from the center of the frame to the lower right corner. The surrounding landscape consists of lush green grass and shrubbery, creating a natural and vibrant environment for the elephant. There are no other elephants or animals in the scene, concentrating the viewer's attention on this solitary figure of a majestic creature."}
{"image_id": 35671, "caption": "The scene depicts an exciting rodeo event taking place outdoors in a dirt arena. Two men are riding horseback, skillfully attempting to dismount a bull that is charging towards a banner. One boy on horseback is closer to the bull, while the other is positioned further away. \n\nThere are multiple onlookers observing the action in the background. Some individuals are positioned closer to the bull and horse riders, while others are scattered around the arena. In the stands, people are sitting and holding cell phones, capturing the moment in anticipation.\n\nAnother notable detail in the scene is the presence of a motorcycle parked towards the left side of the image."}
{"image_id": 76522, "caption": "The image depicts a cute scene of a cat lounging on top of a couch, comfortably sleeping and curled up. Next to the cat, on the couch, there is a remote control, suggesting that the cat's owner was either watching TV or relaxing with a game system.\n\nThe overall atmosphere of the image is one of coziness and relaxation, likely taken in someone's living room, with a cushion and a couch as the main furniture. The remote control, lying beside the cat, creates a relatable and heartwarming moment for any cat lover."}
{"image_id": 504167, "caption": "The image showcases a black and white cat on display. The cat is sitting down, and its face is prominently featured in the scene, capturing the viewer's attention. The cat's eyes have an odd appearance, giving it a mysterious look. The cat's long whiskers extend almost to the edges of the frame, giving it a majestic appearance.\n\nThe cat appears to be sitting on a flat surface, possibly the floor, as it stares straight ahead with great focus and confidence. The image evokes a sense of curiosity as the cat's gaze seems to pierce through the viewer's eyes."}
{"image_id": 21644, "caption": "In the image, a city street is filled with several types of buses and busses lined in the parking lot. The buses are parked in a large parking area, including several single-decker transit buses occupying the road. \n\nClose to the left side, a large double-decker bus dominates the scene, possibly indicating a mass transit hub. A few taxis are also scattered around the parking lot, offering various transportation options in the city. \n\nThe bustling street conveys a busy and lively urban environment."}
{"image_id": 483135, "caption": "The scene is a family gathering in a living room, with multiple people sitting around and playing games on the Nintendo Wii console. A young woman is standing, actively playing a game, while the others hold Wii remotes, enjoying the fun moment together. Some of them are located on a round green bean bag, while others are seated on chairs placed throughout the room.\n\nThere is a bottle placed in the living area, possibly containing a refreshing drink to keep the family relaxed and enjoy their gaming session. Overall, the image captures a joyful family bonding moment, centered around Wii gaming."}
{"image_id": 271063, "caption": "The image showcases a kitchen scene featuring an empty stove and an oven, both of brown wood. A microwave sits above the oven, adding convenience to the kitchen area. The kitchen cabinets are brown, and the oven itself is made of wood with a front drawer.\n\nAdditionally, a counter and sink are present in the room, and an appliance is located on top of the counter, likely an ice machine or a water dispenser. The overall atmosphere of the kitchen is bright and well-lit, creating a welcoming and comfortable environment for cooking and meal preparation."}
{"image_id": 36477, "caption": "The image features a large bunch of unopened bananas, mostly bunches of green fruit and a few ripe ones, piled up together. The bananas are placed in or near a carton, as if being newly sold. There are ripe and unripe bananas found throughout the scene, adding a variety of appearances to the image. The banana bunches are situated on top of the carton, with some overlapping one another. They appear to be ready to be sold as ripe bananas, waiting for a buyer in a store or market."}
{"image_id": 125375, "caption": "The image captures a bustling transit station with several people waiting for the train. They are packed around some of the railcars parked on the tracks, and they are lining up at the open door. The train is an extended red and blue train with a black roof, indicating that it may belong to London. \n\nThere is a bench alongside the platform for passengers to sit and wait comfortably. People are scattered throughout the scene, with some standing near the train and others further back. The overall atmosphere suggests that this is a busy location, possibly with daily commuters relying on this train service to move around the city."}
{"image_id": 362520, "caption": "In a skate park, a young boy is skillfully riding a skateboard, performing a flip with his board. His hands and feet are visible as he jumps into the air. The scene captures the excitement and movement of the child as he expertly maneuvers his board. Next to him, there is another person, perhaps watching or waiting to start trying their own skateboard stunts."}
{"image_id": 5412, "caption": "The image shows a small, clean bathroom that features a white toilet and bidet. The toilet and bidet are positioned close to each other and situated under a small shelf or wall hanging that provides storage space. \n\nIn addition, there is a sink situated above the shelf, and a shower is visible towards the right side of the bathroom, enclosed in a white bathroom shower enclosure, which offers a comfortable and stylish design. The bathroom has a spacious and unoccupied look, indicating it may be ready for use."}
{"image_id": 757, "caption": "The image depicts a group of elephants and a giraffe walking through water and dry grass, with muddy surroundings. There are at least four elephants in the scene, each with different positions relative to the water source. One of the elephants is visible in the foreground while the others are scattered throughout the image.\n\nIn addition to the elephants, there is a giraffe located towards the left side of the image. The scene captures the beauty of these majestic animals as they wander across the water and grassy terrain, potentially in search of food or simply following their natural instincts in the wild."}
{"image_id": 396496, "caption": "The image depicts a dark scene with snow falling and people gathered near a train, perhaps waiting to board or simply standing around during a snowstorm. There are two trains in the scene, with one covered mostly in snow. Two umbrellas can be seen in the hands of people, providing shelter from the falling snow. \n\nA small group of individuals huddle close, braving the stormy weather. At least eleven people are visible, most of them near the middle of the scene, while one person can be seen closer to the sides and another further back towards the center.\n\nAlongside the people and trains, there is a car on the left side of the image, contributing to the winter atmosphere."}
{"image_id": 81761, "caption": "The image features a girl playing tennis on a tennis court, skillfully swinging a tennis racket with both hands at a sports ball coming her way. She is positioned toward the center of the court, ready to hit the ball. Another sports ball can be seen resting on the right side of the court. The tennis racket in the girl's hands is in a position to make contact with the ball, and she appears to be maintaining the proper stance for the shot."}
{"image_id": 130677, "caption": "The image features two people on a tennis court, playing a lively game of tennis. One person is positioned near the right side of the court while the other stands closer to the left side. Both players have tennis rackets in their hands, fully focused on their game.\n\nBesides the players, there is a man in a suit and tie standing to the left of the court, observing the game. A chair is situated near the bottom left corner of the frame, likely for resting between games."}
{"image_id": 318825, "caption": "The image features a male tennis player, dressed in white attire, walking on a tennis court. He is wearing a white baseball cap and carrying a tennis racquet in his hand. His outfit appears to be from a tennis tournament, as he is posing on a hard surface court. He's likely just finished playing or preparing to play the game.\n\nThe tennis court stretches across the majority of the scene, providing a clear picture of the competitive environment. There are also a pair of additional shoes visible in the image, located towards the left side of the court. These shoes could belong to an opponent or another player waiting to join the game."}
{"image_id": 48014, "caption": "In this image, a man is strolling through a park with his dog on a leash. Another man can be seen nearby, sitting on a park bench, possibly enjoying the pleasant ambiance of the scene. The street in front of the park appears quite active, with multiple cars parked or moving along the road. There are a few people walking around, adding to the lively atmosphere. \n\nInterestingly, there's a small bird flying close to the people, possibly enjoying the park as well. The combination of the man, his dog, and the park's bustling environment create a nice, dynamic image of a regular day in the area."}
{"image_id": 421028, "caption": "The image features a gray cat laying on the floor in front of a black rug, appearing relaxed and comfortable. The room also includes two bookshelves, which are likely filled with books. There is a vase placed nearby, adding an element of decoration to the space. Interestingly, the cat seems to be chewing on one of the books, possibly entertaining itself while it rests."}
{"image_id": 479659, "caption": "In the image, a man and woman are standing on the sidewalk outside, likely chatting together. The woman is holding a purse, while a handbag is placed on the table beside them. The man has a tumbler in his hand, seemingly drinking from it. Another tumbler, possibly identical, is on the table nearby the handbags. \n\nIn addition to the main subjects, there are four carrots on the table, and two bottles, one slightly closer to the left side and another near the right side of the table. Overall, the scene depicts a casual social gathering or conversation between the two individuals."}
{"image_id": 369826, "caption": "The image features a large flat screen display that showcases desert landscapes, possibly of the Arizona desert. In front of the display, there are several chairs and dining tables available. It seems like a seating area or a lounge area where people can sit and enjoy the image showcased on the large TV screen. The scene also includes a few other chairs around the dining tables, which further enhance the cozy and inviting atmosphere."}
{"image_id": 406253, "caption": "The scene shows a row of parked vehicles on a street, with a blue and white motorcycle in the center, surrounded by other bikes. Specifically, there are four bicycles lined up close to each other, including the blue and yellow motorcycle, suggesting that they are parked on the sidewalk, waiting for their owners. Other vehicles like a car, and an additional scooter can be seen parked behind the line of bikes. \n\nA few pedestrians are scattered throughout the area, likely walking on the sidewalk or in the distance. The area appears to be lively, with people going about their daily activities."}
{"image_id": 548267, "caption": "The image features a large pastoral scene with a lush green field filled with numerous white sheep. The sheep are grazing and walking around the field, enjoying their time in the grass. The pastures are accompanied by large mountains in the background, providing a picturesque and serene setting. The scene creates an idyllic landscape, showcasing the beauty of rural life and vast landscapes."}
{"image_id": 335844, "caption": "The image features a kitchen with a stainless steel microwave situated on top of a counter. The microwave is open and appears to be in use, as the interior light is on. There is also a second microwave positioned nearby, and both these microwaves have multiple knobs on the front, giving off a futuristic aesthetic. Additionally, there is a remote control placed alongside the microwaves on the counter, perhaps misplaced or accidentally left there."}
{"image_id": 299640, "caption": "The image displays three electronic devices lying on a table, including a remote control, a TV remote, and a remote control in various stages of disassembly. The TV remote is arranged on the left side of the table, while the other remote is placed in the center. The remote control in various stages of disassembly can be seen spread across the right part of the table, showcasing the different components of the device."}
{"image_id": 121812, "caption": "The image showcases a city street scene through a windshield. The view is of a hilly area surrounding the town, with the buildings located at the bottom of the hill. Several cars and a truck can be observed on the road, as they travel along or stop at the traffic lights. \n\nThere are multiple traffic lights in this scene, positioned at various intersections, helping to control flow in the area. Overall, the image depicts a typical city street with a mix of vehicles and traffic infrastructure. All objects in the scene appear to be blurry, possibly due to the rain or other weather conditions."}
{"image_id": 107234, "caption": "The image depicts a close-up of a man with a short brown beard, wearing a suit and tie, and having his mouth slightly open. As he stares through the camera, his intense facial expression appears almost frightening. There are two wine glasses visible in the scene, one situated in the central part and the other towards the upper right corner.\n\nThe overall atmosphere of the image is intriguing and dramatic, as if the man is making a bold statement or capturing everyone's attention with his facial expression."}
{"image_id": 153104, "caption": "The image shows a baseball game in progress, with a man enjoying a hot dog. He is sitting in the stands, focusing on the game. There are other people nearby, watching and participating in the event. A total of 14 individuals can be seen in various positions around the image, both close to and further away from the main focus. There are 12 chairs in the scene, with one being held by the man enjoying his hot dog and others placed around the area. A bowl can be seen in the middle of the group, and a bottle is present on the left."}
{"image_id": 216417, "caption": "In the black and white photograph, a person is standing on a snow-covered terrain carrying a dog on his back, possibly in a tent or a shelter. The man and his dog don't seem to be going anywhere at the moment, possibly waiting for a moment to set off or resting in their snowy surroundings. A backpack is placed on the ground beside them. \n\nThere are two canes positioned, one on the left side and another near the center of the image. The surrounding snow is well-trampled, revealing that both the man and his canine companion have indeed ventured out in the colder environment."}
{"image_id": 286708, "caption": "In the image, a black and white cat is wearing a bright pink knitted winter hat on its head. The cat is sitting comfortably on some fur fabric, possibly a blanket or a piece of furniture like a couch. Its eyes are partially visible from beneath the hat, adding a playful and charming touch to the scene."}
{"image_id": 547041, "caption": "The image features a table with two plastic containers. Inside one of the containers is a lime green salad with lemon wedges, black olives, broccoli, and greens. The other container is a side of salmon or chicken with a lemon wedge included. There is also a fork on the table, which could be used to pick up food from the containers. The plastic containers have a pink lining inside, adding a pop of color to the food items."}
{"image_id": 293802, "caption": "The scene depicts a city street with a man skillfully performing a trick on his red skateboard while people watch. He is up in the air, and in addition to the onlookers, there are at least 13 other individuals scattered throughout the scene in various positions. Some can be seen in the background, others standing closer to the street action.\n\nThe street is full of seating options, with three chairs and three dining tables placed at different spots. A handbag can also be seen nearby, possibly belonging to one of the bystanders. A bicycle is present at the left edge of the image, parked among the crowd of people watching the skateboard trick. Overall, the atmosphere suggests an urban setting with a diverse mix of people and objects."}
{"image_id": 252738, "caption": "In the image, there is a middle-aged man sitting outdoors on a cell phone, surrounded by open terrain. He is wearing sunglasses and a leather jacket, and he appears to be engaged in an important conversation on his mobile phone. \n\nThere are also a few other people in the distance situated at various points on the horizon. Additionally, a truck can be seen parked nearby, seemingly not related to the man on the phone."}
{"image_id": 43165, "caption": "The image shows two zebras standing between dry grass and a forest near a road. They appear to be looking around as if searching for something. One zebra is positioned closer to the left edge of the image, while the other is on the right side, with both zebras standing together in the field. \n\nIn the background, there is a car parked alongside the road, indicating that this scene could be happening in a conservation area or a wildlife park where people can observe the zebras in their natural habitat."}
{"image_id": 218215, "caption": "The image captures a polar bear in an aquatic environment, swimming in the water and breathing. The bear appears to be enjoying its time in the ocean, surrounded by the refreshing water. There are bubbles visible in the image, which suggests the polar bear is in a shallow area of the water.\n\nThe image emphasizes the polar bear's impressive size and its proximity to the camera, displaying its natural habitat and powerful presence. The water shows evidence of the bear's movement throughout the scene, making it a vibrant and lively representation of the species in their natural habitat."}
{"image_id": 299082, "caption": "The image features a close-up view of a pair of giraffes grazing on a grassy hill or rock. The first giraffe is stretching its head far down to reach and eat the grass, while the second giraffe is nearby, extending its long neck to graze on more grass.\n\nThe setting appears to be a rocky slope, as the giraffes are enjoying a field with a rocky underlay. The two giraffes, positioned closely together, appear to share the natural landscape as their grazing area."}
{"image_id": 152360, "caption": "The image depicts a street market filled with a variety of fruits on both sides of the roadway. The market has an abundance of bananas, as multiple bunches of bananas are hanging from the ceiling at different heights. There are also apples displayed in separate locations, showcasing a variety of fresh produce available for sale.\n\nApart from the produce, the scene also features several cars parked along the left side of the market. A person can be seen on the left side of the market, possibly browsing or shopping for fresh fruits. The street market serves as a hub for the local community to access fresh produce conveniently."}
{"image_id": 205601, "caption": "The image features a young woman cooking dinner in a large pan full of food, positioned on a stove. The woman is using a ladle, carefully adding ingredients to the dish. Several other people are present in the scene, located near one of the corners, possibly sharing a meal, discussing, or assisting in the cooking process.\n\nVarious utensils can be seen around the room. There are multiple spoons, one near the bottom left corner, another in the top left corner, and the third one closer to the center. In addition, there are two knives, one in the bottom left portion of the scene, and another in the top right corner of the image. The presence of these utensils suggests that a variety of ingredients might be used for this meal."}
{"image_id": 174004, "caption": "An old yellow tow truck with a crane arm on the back is parked in a field, surrounded by tall grass. The truck is parked next to a tree, giving the sense of a forgotten relic in a wild setting. Some plants and flowers can be seen around this rickety vehicle, with two prominent patches of flowers located close to the right tire and near the rear end of the truck.\n\nThe truck appears to be old and somewhat damaged, reflecting its age and disrepair in this open field. The scene is reminiscent of an old west ghost town, giving an eerie and eerily abandoned vibe."}
{"image_id": 31542, "caption": "In this image, a person is captured in the middle of an impressive snowboarding trick as they are soaring above a snow-covered slope. The snowboarder appears to be grabbing the rail in the jump while lifting off the ground, showcasing their impressive skills. \n\nThe scene gives off a sense of motion and excitement, depicting the thrilling nature of snowboarding. The snowboarder's snow gear suggests their preparation for the sport, capturing the essence of winter and adventure."}
{"image_id": 305268, "caption": "The image features a woman standing on an outdoor tennis court, holding a tennis racquet and preparing to hit the ball. She is in motion and swinging the racquet, demonstrating her skills in the sport. \n\nThe tennis court itself is surrounded by several walls, providing a secure environment for the player. There is a clock visible near the top right corner of the court, allowing players to keep track of the time during their matches. Additionally, a backpack can be seen placed close to one of the walls, likely belonging to the player."}
{"image_id": 2867, "caption": "The image captures a group of four people standing on a snow-covered ground, ready to engage in a fun winter activity. The individuals are holding skis and are geared up to ski together. They are all wearing backpacks, indicating they might be on a longer skiing adventure. \n\nEach person has a pair of skis, either standing on the ground or positioned horizontally on the snow. The group is arranged with one person on the left, another in the center, another on the right, and the last one in the background, on the left side of the image. This group of friends is likely enjoying their skiing experience and spending quality time together outdoors."}
{"image_id": 72428, "caption": "The image depicts a well-maintained, spotless white toilet without any stains or dirt. Besides the toilet, a white roll of toilet paper is neatly placed on a shelf above it, showing both the careful and tidy maintenance of this bathroom corner. The overall atmosphere of the bathroom showcases a clean and organized space."}
{"image_id": 158494, "caption": "The scene showcases two giraffes in a green enclosure. One giraffe is standing tall on the left side of the image, while the other smaller giraffe can be seen on the right, crouching slightly. The two giraffes are standing next to each other and sharing a piece of grass with each other's mouths. \n\nAnother piece of grass is also visible in the middle of the scene, likely to accommodate the giraffes' diet. These animals appear to be friendly and comfortable with each other's proximity."}
{"image_id": 147629, "caption": "The image depicts a white cat lying on a carpeted floor on its side, surrounded by a few items. A toy elephant, possibly a small brown rubber ball, is lying next to the cat, while another smaller plush toy in blue is positioned on top of the cat. In addition to these toys, there is a grey stuffed animal, a blue ball, and a tennis ball scattered around the cat, adding to the cat's toys on the floor."}
{"image_id": 581899, "caption": "The image features several blue passenger trains parked next to each other on a side track. One train can be seen on the left side of the image, while another is more prominently seen in the right half of the photo. A blue train takes up a significant part of the middle of the scene, with a person standing on a step of the train in the middle of the image.\n\nIn addition to the people on the trains, there are at least three other individuals positioned throughout the scene, observing the scene or waiting near the trains. The scene gives off an impression of a lively train station or yard."}
{"image_id": 369345, "caption": "The image shows a cozy blue living room with a blue love seat and a table placed next to it. A lamp stands between the sofa and the table, providing soft lighting to the space. The room also has a wood table and bookshelves full of various books, giving the room a warm and welcoming atmosphere. \n\nOn the table, there is a keyboard and a remote control, indicating that a television might be present in the room or a computer could be used in this space for leisure or entertainment purposes. The neatly arranged books also suggest an interest in reading and spending time in the comfort of this living room."}
{"image_id": 372246, "caption": "The image shows two road signs at an intersection in a wooded, rural area. The left sign reads \"US Highway 395 Hell Canyon Road,\" while the right sign reads \"Stop.\" Several other directions appear on the left sign as well. \n\nThere is a person standing relatively close to the left sign, possibly observing or taking a picture of the signage. A stop sign can be seen partially to the right of the left side sign, directing traffic at the intersection."}
{"image_id": 261563, "caption": "The image features two young dogs interacting playfully outdoors in a large grassy field. One of them is holding a yellow Frisbee in its mouth, likely playing with it and posing for a photo. The other dog, which is closer to the viewer, is watching its companion, possibly anticipating its move or its next move. Both dogs are in a relaxed, fun environment, enjoying the open field and their time spent playing together."}
{"image_id": 461802, "caption": "The image depicts a man in orange clothing, likely a construction worker, walking on a bridge above a passenger train stopped at the station. The worker is carrying construction supplies, likely tools, on one side of his body. The railway car occupies a large portion of the image, with the train's platform and tracks stretching across the background.\n\nThere are several clocks visible in the scene, with one hanging on the wall near the top right corner, another closer to the middle of the platform, and a third on the floor in the middle of the scene. There are also several chairs placed near the foot of the stairs, as well as multiple umbrellas positioned in various spots throughout the station. Additionally, there is a handbag placed close to the central clock, adding to the busy atmosphere of the scene."}
{"image_id": 138175, "caption": "The image captures a man talking on his cell phone, positioned at the center of the scene. Another person can be seen walking by in the background, and another person is holding a handbag. Aside from these individuals, there are no other people in the scene.\n\nIn the background, there is a TV placed against the wall at the top right, and a couch is situated near the middle of the scene."}
{"image_id": 103488, "caption": "The image features a large, public restroom with two large sinks, one on the left side and the other on the right side of the room. These sinks are situated under mirrors, providing a convenient reflection for those using them. \n\nIn addition to the sinks, there are several hanging partitions in the restroom with various items attached to them. Some of these hanging partitions include multiple cups, likely for handwashing purposes, and a hand towel. In the area around the middle of the space, a backpack can be seen placed on a surface.\n\nOverall, the room presents a functional and inviting environment for public restroom users."}
{"image_id": 215901, "caption": "The image features a bowl of fruit displayed on a dining table. Inside the bowl, there are several apples, with one being visible towards the center and another slightly apart to the left, as well as the main one positioned at the lower part of the bowl. An orange is also placed inside the bowl, situated to the left side of the main apple. \n\nThere is a chair positioned at the back of the table, and a banana can be seen alongside the main apple. The whole scene has a pleasant and inviting atmosphere, with the assortment of fruits offering a visually appealing and healthy choice for someone to enjoy."}
{"image_id": 514180, "caption": "The image features a buffet with several pizzas on pans, all placed at different locations within the scene. There are three pizzas in the focus, with the middle pizza being predominantly visible, while the other two pizzas are located on the left edge and the bottom left corner.\n\nTwo forks are present in the scene, one positioned near the top right corner and the other fork located near the bottom right corner. The forks and pizzas suggest that people may be eating the food. The overall atmosphere appears to be appetizing and inviting."}
{"image_id": 396338, "caption": "The image captures a lively scene of several people walking in a bustling city area, likely a village. They appear to be passing by or making their way through the city amidst traffic. There are at least six people visible in the image, with some of them carrying backpacks as they navigate the busy street.\n\nTwo motorbikes are located in the scene, one situated to the left side of the image and the other more towards the center. Two cars can be seen driving, with a single car on the far left side, and another car located slightly behind the motorbike on the left side. Additionally, two handbags are discernible on the ground, one slightly closer to the left side and the other further back. An umbrella is open in the image, positioned to the left and slightly above the center of the scene, likely providing protection from unexpected precipitation."}
{"image_id": 579362, "caption": "The image captures a picturesque beach scene, where a man is sitting on a park bench overlooking the ocean. While lounging, he looks out at the vast water, and in the distance, there is a boat passing by. \n\nAlong the beach, there are many people enjoying the day outdoors. They are scattered along the shore, some more closer to the water, and others near the park bench where the man is sitting. \n\nVarious backpacks can be seen in different spots on the beach, perhaps belonging to the people enjoying the beach or even other beachgoers. Additionally, a bottle is also visible near the edge of the scene."}
{"image_id": 289512, "caption": "The image features a woman in a cowboy hat riding a brown horse in an open field with trees in the background. She appears to be enjoying her time on the horse as she navigates through the landscape. The woman's riding gear and confident pose suggests she is likely an experienced horse rider. The brown horse is well-attended to and well-behaved as they traverse the field together."}
{"image_id": 306928, "caption": "The image depicts a tall brick clock tower bustling with a large flock of birds flying around it. Many birds are visible near the top of the building, with some flying close to the steeple and others perching on it. At least twelve birds can be counted spread across the scene, including a few in the surrounding area. The clock on the tower is prominently observed, and the overall atmosphere is lively and energetic."}
{"image_id": 453009, "caption": "The image features a white bench on which a teddy bear is sitting. A stuffed duck, or loon, is sitting next to the teddy bear, creating an amusing and playful scene. Both the bear and the duck are positioned in similar directions, facing the camera. \n\nOn the side of the bench, a few potted plants may be seen, adding a touch of greenery to the setting. There is also a car partially visible in the background of the scene. The overall atmosphere of the scene seems lighthearted and fun, reflecting the playful interaction between the teddy bear and the toy loon."}
{"image_id": 112581, "caption": "The scene features a man wearing a Boston Bruins shirt, likely an ice cream vendor, operating a slushy machine. He is in the process of placing change into a slushy machine, while a person behind him in the background watches and waits for their turn. The man is smiling and appears to be enjoying his task.\n\nThe setting seems to be an ice cream shop or a food and beverage stand, with multiple items around them, including cups, bowls, and bottles. The man holds a wallet in his hand, likely filled with the change required to purchase an ice cream or slushy."}
{"image_id": 504977, "caption": "The image depicts an older woman sitting on a park bench, positioned centrally in the scene. She is holding a purse on her lap, which contains a cigarette pack. Despite the presence of a bag, the woman appears to be without shoes.\n\nThe bench spans across the background, occupying a significant portion of the frame. The woman is the primary subject of the scene, and her pose on the bench with her purse indicates a relaxed, casual mood."}
{"image_id": 228764, "caption": "The image captures a scenic beach setting with a cat standing next to a black and white dog walking nearby. They both appear to be calmly strolling along the shoreline. Nearby, there are some cars parked, and a few potted plants and chairs scattered across the area. Moreover, two trucks can be seen further in the distance behind the dog.\n\nA total of seven people can be caught in the frames of the image, some possibly observing the animals or the overall beauty of the beach. There's also an umbrella set up toward the side of the scene. With the combination of the sandy beach, dogs, and cars, it seems like a pleasant and enjoyable outdoor experience."}
{"image_id": 151528, "caption": "The image depicts a dog walking along a dirt path, appearing to be staring at something close to the grass. A man stands on the top of a hill, looking into the distance. The dog and the man seem to be the main subjects of the scene.\n\nThe path where the dog stands out is surrounded by grass and stone walls. The hill in the background is lush and green, creating a picturesque environment for the man and his dog to explore."}
{"image_id": 248919, "caption": "The image showcases a beautifully decorated kitchen with wooden cabinets and a stove located near a table. A refrigerator is prominently visible in the background, while a microwave oven is situated above the table. There are a variety of fruits on display, including an assortment of apples and oranges scattered across different parts of the scene. A single banana is also visible near the center of the kitchen, adding to the collection of fruits. The presence of a dining table and chairs complements the kitchen, creating a cozy and inviting atmosphere for meal preparation and dining."}
{"image_id": 580607, "caption": "The image depicts a scenic view of several boats on a river or lake below a bridge. There are five boats visible in the water, as well as two boats docked closer together. There are several people milling about on the sidewalk close to the river, enjoying the view and the serene atmosphere. \n\nWhile there are many people dispersed across the scene, they are not crowded, giving the area a more relaxed feel. The people are engaged in various activities, and some of them appear to be riding a bicycle near the bridge. Additionally, there is at least one handbag present, possibly belonging to one of the individuals in the area."}
{"image_id": 200291, "caption": "There is a table with two plates on it, each containing different types of food. The first plate has a sandwich cut into four pieces, paired with crispy waffle fries and pickle spears. The second plate features a healthy option with bread, jam, and a portion of broccoli on the side. Both sets of food are presented neatly and invitingly. \n\nA spoon can be seen on the table, likely to serve the broccoli spears on the second plate. The table setting creates a pleasant atmosphere, ready for someone to enjoy a delightful meal."}
{"image_id": 296231, "caption": "The image depicts an old-fashioned room with shelves full of knick-knacks and a television sitting in front of them on top of a piece of wood. The room has several objects scattered around, including a clock hanging on one of the shelves and two potted plants on a surface in the room, one nearer to the left side and the other more towards the right. \n\nThere is also a red vase on a shelf nearby, contributing to the cozy atmosphere of the space. Additionally, a wine glass is placed on a surface in the room, adding to the clutter of objects. Pictures hang on the walls behind the television, enriching the display throughout the room."}
{"image_id": 505663, "caption": "The scene features a large analogue clock with roman numerals and hands placed on the side of a brick building. The clock is located high above, making it easy to see, and it appears to be lit up at night. The building it's attached to is made of distinct bricks, creating a visually striking appearance.\n\nIn the background, an archway entrance can be seen, and there is a clock placed on the far left side of the image. The overall setting is architectural and striking, with the clock at the heart of the scene."}
{"image_id": 41572, "caption": "The scene takes place in a sports field during the day. A baseball player is holding a baseball bat and getting ready to swing at a ball. There are two other people present in the field, possibly teammates or opponents, one further back near the middle and the other almost towards the right edge of the image.\n\nIn addition to the players, there are several baseball gloves scattered across the field, hinting at ongoing practice or a game. Numerous baseballs can be seen in different positions, some near the players and others closer to the edge of the field. Other objects in the scene include a car and a backpack near the left-centre of the image, likely belonging to spectators or players."}
{"image_id": 509589, "caption": "The image features a group of people standing around a skateboard ramp, with a boy in a tie-dye shirt riding a skateboard and about to perform a trick. Nearby, a few other people watch the skateboarder or engage in skateboarding themselves. \n\nThere are several other skateboards scattered around the area, some placed on the ground, while others are being used by individuals. In addition to this, several backpacks can be seen, indicating that the people might be carrying belongings with them."}
{"image_id": 357238, "caption": "A surfer stands atop a surfboard in the middle of rushing water off the coast of the ocean. Nearby, the surfer is accompanied by another individual who observes the scene. On the shore, there are more people and kites in the background.\n\nA small part of the sky can be seen, but the majority of the scene is dominated by massive waves and high clouds. The kites in the background add a colorful touch to the overall view. Overall, it's a lively and exciting setting where surf lifting and flying kites can be enjoyed."}
{"image_id": 466575, "caption": "A large, well-used suitcase is sitting on a grey road. The suitcase appears to be old and possibly made from a fabric material such as leather. The leather is worn and weathered from years of travel, giving the suitcase a unique and vintage look. The suitcase lays on its side on the paved street, which provides a clear view of its interior compartments. The luggage seems ready for a journey, or waiting to be picked up after a traveling adventure."}
{"image_id": 271970, "caption": "The scene shows a peaceful, small village town center with a white stone church tower in the center of the scene. This prominent clock tower has two visible clocks on it. There is also a clock placed near the top of the tower, a bit more challenging to see.\n\nIn the town center, there are a few people visiting or passing by, giving the scene a sense of everyday life. Among them, there is a bicycle parked on the right side of the photo. The overall atmosphere of the small quaint village is aesthetically pleasing and offers a pleasant environment."}
{"image_id": 305540, "caption": "In the image, there are a pair of large metal scissor-shaped garden decorations visible on the sidewalk. The scissors are positioned upside down on a piece of cement, drawing attention to their novel appearance. \n\nIn addition to the scissors, there is a group of people walking by, one of whom is wearing a tie. One person is carrying a handbag, and another handbag can be seen close by. A potted plant is also present in the scene, adding a touch of greenery to the environment."}
{"image_id": 462928, "caption": "The image shows a man holding up a cellphone to the side of his head, possibly engaged in a conversation or looking at something on the device. Around the scene, there are multiple books scattered, some on a surface in the background and others placed nearby. Additionally, there is a clock on the wall behind the man, possibly indicating the time or marking an important event. Furthermore, a book cover is visible on the edge of the image, possibly related to the scene or the man's interests."}
{"image_id": 270544, "caption": "In the image, a group of people are enjoying a day of water sports on a lake with white caps. There are a total of five people in the water, with two women more prominent in the scene. They are actively engaged in surfing, with one woman on the front surfboard and the other positioned behind her surfing together.\n\nThere is a motor boat visible farther back in the scene, likely providing a cruise or support for the water sports activities. The scene portrays a fun and active atmosphere, with participants and spectators enjoying the exciting moments on the lake."}
{"image_id": 134042, "caption": "The image captures a blue sky with clouds and a plane flying through the sky. The plane is soaring in the air toward the right side of the frame, giving a sense of movement and depth to the scene. There are no other objects or planes visible in the picture, allowing the focus to remain on the main subject – the airplane flying gracefully through the open sky."}
{"image_id": 120340, "caption": "The image displays a man wearing a brown shirt, bent over, attending to the bicycle in front of a bus. He appears to be in the process of adjusting the bicycle's tires and possibly fixing a bicycle lock. The bike stands prominently, occupying a significant portion of the scene, and the bus can be seen in the background.\n\nIn addition to the man and the bicycle, there are other individuals present in the scene, one of whom also seems to be attending to a bicycle. There are three other people in total, with one of them located in the far left-hand corner, another at the far right, and the third person standing slightly further back."}
{"image_id": 418949, "caption": "The image features a baseball game in progress. A batter wearing a helmet for protection and a red and blue jersey is standing near home plate. Another baseball bat is lying on the ground, possibly left behind by the batter. \n\nThere are three baseball gloves worn by different players on the field, two of which can be seen closer to the batter at the plate, and the third one located further in the background, towards both sides of the image. Three players are visible, with two of them visible in the middle and right sections of the image, and the third one located towards the right edge."}
{"image_id": 520109, "caption": "The image features a scene filled with a large variety of umbrellas sitting on the ground in a sunny park. These colorful umbrellas are scattered all around, with a line of blue umbrellas stretching along one side of the field. The arrangement of the umbrellas creates a vibrant and lively atmosphere in a serene park setting.\n\nThe sky can be seen in the background, adding to the overall open, and airy feeling of the park. There are some benches placed throughout the scene, possibly for visitors to relax and enjoy the spectacle of colorful umbrellas surrounding them. A person can also be spotted in the park, likely taking in the view or possibly attending to one of the many umbrellas."}
{"image_id": 50753, "caption": "The image depicts a clean, modern kitchen featuring a stove-top oven, a refrigerator located to the left of the oven, and ample counter space. The kitchen is well-equipped with items such as a microwave, sink, toaster, and a bowl placed on the counter near the sink. It also has several utensils nearby, including a couple of knives, a pair of scissors, and a spoon. Two clocks can be seen in the kitchen – one on the refrigerator, and the other on the oven.\n\nThere are several cups positioned around the kitchen, with one on the countertop, another one placed near the sink, and the third one near the entrance of the kitchen. The arrangement of these kitchen items and items make the space feel organized and functional."}
{"image_id": 329939, "caption": "The image captures a serene scene of a herd of giraffes in a savannah setting. There are four giraffes in total, walking through an open field with tall grass. They are all spread out, with one giraffe on the far left, another in the middle, and the last two slightly to the right. They are all walking and enjoying the wildlife surrounding them, contributing to their natural habitat's charm."}
{"image_id": 351345, "caption": "In the image, there is a young woman prominently positioned in a living room near a wall, possibly in her kitchen. She appears to be holding or gesturing with a remote control in her hand. Another person, a man, is also standing in the same room close to the woman on her left. \n\nThe room features a TV positioned to the left side of the woman, and a couch can be seen toward the right side of the room. The scene suggests that the woman is either interacting with the TV or showing the man something on the screen."}
{"image_id": 25293, "caption": "The image captures a majestic female figure holding a Frisbee in one hand, showcasing her unique skill. The woman wearing a dress and holding the blue Frisbee appears to be poised, focused, and ready to play. The overall atmosphere of the image exudes a sense of strength and control. The woman and the Frisbee appear to be the main subject of the image, capturing the essence of this moment."}
{"image_id": 543041, "caption": "The image showcases an enticing display of multiple types of doughnuts, including plain, glazed, and frosted varieties. The doughnuts are set on a table and arranged neatly in a box, offering a visually appealing sight for anyone with a sweet tooth.\n\nIn total, there are ten doughnuts of varying textures and flavors. The collection features at least three donuts with frosting on top of them. There may also be a cupcake present in the assortment, among the group of delightful treats."}
{"image_id": 568265, "caption": "The image depicts a group of people walking on a walkway next to parked cars and trees. Several individuals can be seen strolling in the area. A kite is flying overhead, providing a lively atmosphere and adding fun to the day. \n\nAlso, there is a bus visible at the end of the walkway, and several handbags can be noticed being carried by the people around. A truck can be spotted nearby the people.\n\nOverall, the scene captures a lively, bustling atmosphere with people enjoying their time and taking in the surroundings."}
{"image_id": 467386, "caption": "The image features a door with blue panels and a window above it. The doorway is located outside a building, providing entrance or exit. The building appears to be old and has weathered some of the panels on the door. \n\nOn the ground outside this blue door, there is a cat sitting near the entrance. Next to the cat, you can find several cigarette butts scattered around the area near the steps, indicating that someone might have been smoking. Additional items are visible on the ground, including a bottle and a bowl."}
{"image_id": 242363, "caption": "This image depicts a simple, clean bathroom with a toilet positioned near a sink and a bathtub. The toilet is located inside of the bathroom, while the sink is placed towards the left side of the room. The tub is situated to the right corner of the bathroom, almost filling the entire right edge of the image. A shower head can be seen in the upper-right part of the bathroom. The color of the walls is predominantly white, and the room appears to be relatively spacious."}
{"image_id": 554900, "caption": "The scene is set in a bathroom, where a toilet is prominently displayed in the center with the lid up and surrounded by white tiles. Next to the toilet is a small package, likely disposed of or discarded. The scene appears to be taken from the user's point of view, capturing an overhead perspective.\n\nThe restroom is designed to blend in with its surroundings, which helps create an unbiased and inclusive environment."}
{"image_id": 115006, "caption": "The image captures a baseball game in progress, with a player taking off from home plate to hit the ball. The batter is swinging the bat, preparing to strike the ball. Several people are on the field, including teammates and opponents, along with the umpire observing the play.\n\nIn addition to the batter, there are several other on-field players and a few team members. Some people can be seen in the background, likely providing support to the teams or being off-duty.\n\nThe baseball bat is prominently featured in the scene, located near the left side of the frame where the batter is swinging at the ball. This engaging and exciting moment showcases the skill and focus of the baseball player as they react to the ball in play."}
{"image_id": 75375, "caption": "The image features a group of people enjoying a sunny day on the ocean, engaging in fun water activities. There are several individuals kiteboarding, holding on to surfboards while floating on the water. They are wearing kites and parachutes which support their surfboards, providing the thrill of being towed and gliding across the waves. Some of the riders have their surfboards up while others have them down, showcasing different states of riding.\n\nApart from kiteboarding, there are also regular surfboards seen in the water. A person in the middle of the scene seems to be enjoying the boat ride, while others in the scene seem to be participating in other water sports or just floating around. The atmosphere is one of excitement and leisure, highlighting a day of adventure on the ocean."}
{"image_id": 419223, "caption": "The image depicts a group of young soccer players on a grassy field, engaged in an intense game. One boy can be seen choking another player's neck, both trying to take control of the sports ball. The sports ball is located on the bottom left side of the image. There are a total of five players visible in the scene, all trying different moves to win the game. In addition to the players involved in the physical interaction, two others look on from their positions on the field, making the scene dynamic and action-packed."}
{"image_id": 137578, "caption": "The image displays a restroom with two toilets placed next to each other. The toilets have their seats up, most likely due to regular cleaning. Each toilet is mounted on a floor frame, contributing to the clean lines in the restroom. The white toilet bowls are clearly visible, along with the seat cushions on each toilet.\n\nThe room's walls are tiled in different shades of brown, adding depth to the design. Despite being side by side, the toilets are slightly apart, giving a sense of separation between the two. The large restroom provides a sense of comfort and cleanliness for its users."}
{"image_id": 408808, "caption": "The image depicts toothpaste and toothbrush packaging displayed on a white surface, possibly a countertop or a table. There are various toothpaste bottles and toothbrushes lined up next to each other, creating an organized and visually pleasing arrangement. The toothbrushes come in different sizes, and their packaging indicates they are ready for purchase. The bottles are positioned in various orientations around the main toothpaste bottle, with each bottle and toothbrush standing apart."}
{"image_id": 243773, "caption": "The image depicts a kitchen with wooden cabinets and a stove top oven. The oven has been opened or is in the process of being emptied or cleaned, as evidenced by the disarray of various items scattered about the area.\n\nThere are multiple bottles of varying sizes placed around the stove, some of which are near the top of the wood paneled cabinet above the oven. Additionally, there is a bowl on top of the stove and a red wine bottle sitting next to the stove top. Multiple knives can be seen on the surface of the kitchen, possibly lying on kitchen countertops. A cup is also visible in the image.\n\nA cell phone is placed on the countertop near the edge of the image, as well as a keyboard nearby. These items suggest that someone may have been multitasking while attending to the kitchen tasks."}
{"image_id": 436492, "caption": "The image features a street sign on a sidewalk, indicating the presence of a project related to American recovery and investment. The sign is positioned between two traffic lights. In the background, a stop sign can be seen further down the street, marking the start of a construction zone. Several pedestrians are walking along the sidewalk, some of them close to the ongoing work while others are further away from it.\n\nApart from the main group of pedestrians, there is also an individual carrying a cell phone. This might suggest that they are communicating with others about the ongoing project, checking their phone for directions, or simply using it for navigation. Additionally, a truck can be seen driving in the background, providing further context to the urban setting of the scene."}
{"image_id": 556648, "caption": "The image features a white smartphone sitting on a display shelf or stand. The cell phone appears to be the main attraction, as it occupies a large portion of the background.\n\nBelow the smartphone, there is a collection of cell phones and a few other accessories. These include seven cell phones positioned in various positions, possibly on display for potential buyers. Additionally, two books can be spotted on the lower right side of the picture, possibly related to the smartphone sale or usage."}
{"image_id": 298924, "caption": "The image displays a large bowl filled with noodles and various types of meat. It is sitting on a dining table, possibly within a restaurant. Beside the bowl, there are several utensils and sauces present including two ladles - one larger and one smaller. A spoon is also visible, placed near the main bowl. \n\nIn addition to the utensils and sauces, multiple bottles can be seen on the table, each possibly containing a different dipping sauce or beverage. The close-up view of the bowl reveals the delicious contents, including shrimp. Overall, the dish looks appetizing and ready to be enjoyed by those who partake in it."}
{"image_id": 562030, "caption": "The image depicts an indoor scene featuring small potted plants, some of which are placed near a wooden deck. Five small round pots can be seen on the floor, each containing a plant or sapling inside. There are also plastic containers placed above some of the potted plants, possibly for their growth stage or as additional protection.\n\nThe wooden deck is surrounded by plants, with a few placed within close proximity to the main deck. In addition to the plants and pots, there are a pair of scissors, possibly for plant care, and a few more potted plants in various locations. There is also a bowl located near one of the potted plants."}
{"image_id": 501315, "caption": "The image features a man riding a green and white motorcycle around a corner on a paved road, wearing a safety helmet. As he takes the sharp turn, the motorcycle seems to be leaning backward, showcasing the rider's skill and balance. \n\nIn the scene, there is a motorcycle clock visible, likely placed there for the racer to accurately track lap times. Additionally, there is a person situated towards the left side of the image, but their involvement with the motorcycling event is uncertain."}
{"image_id": 436162, "caption": "The image features a white parking lot bus parked in a lot. The bus is white with a gray metal color on its front end. Along the side of the bus, there's a large window which possibly provides passengers access to the interior.\n\nThe bus is currently not in use but sits next to a green sidewalk, giving it a prominent location in the lot. The parked bus is freeing up more space for other vehicles and offering a safe place to take breaks as there's no oncoming traffic at this moment."}
{"image_id": 323888, "caption": "The image captures a large stone building, likely a train station, at night. On the front of the building, a clock is featured on the top. The clock is lit up, and its display reads \"4:40\". The building itself is lit up as well, which creates a captivating scene.\n\nTwo vehicles are parked in front of the building. A car can be seen on the left side of the building, while a truck is parked on the far right side. There are several people inside the station, either walking or standing, contributing to the bustling atmosphere."}
{"image_id": 211476, "caption": "The image features two bento lunch boxes, both filled with a colorful lunch containing several ingredients. These lunches consist of fresh broccoli as a garnish, a pile of beans within each container, and possibly some other vegetables. One lunch box is sitting in front of the other on a dining table. To accompany the meal, there is a small container of lemonade placed beside the top lunch box.\n\nIn addition to the main bento dishes, the table also showcases various items such as a knife to one side, a bowl, and two cups spread across different corners of the table. The combination of fresh ingredients, beans, and the lemonade create a healthy and appetizing meal setting."}
{"image_id": 473433, "caption": "The image features an open suitcase placed on a table, filled with various items including a photo album and two types of containers like a bowl and a large container. The photo album is located in the middle of the suitcase, while the bowl is placed towards the upper left side, and the large container is to the upper right of the suitcase. The overall setting appears to be a mix of personal belongings and memorabilia from the past."}
{"image_id": 165752, "caption": "The image features a black dog, possibly a Schnauzer, happily holding a frisbee between its paws, giving it the appearance of wearing a frisbee hat. The dog seems proud displaying it with a playful smile. \n\nThe dog is positioned near a wooden fence with a piece of grass on the ground, as if it had been playing with the frisbee momentarily. There are no people visible in the image, and the scene captures the dog's joy and playful behavior as it adorns itself with the frisbee on its head."}
{"image_id": 573756, "caption": "The image shows two giraffes standing in the grass near trees. Each giraffe is behind the other, with a bush in between the two of them. One giraffe is located close to the left side of the image, while the other giraffe is by the center of the image. \n\nThe grassland environment surrounding the giraffes consists of various trees visible in the background, with some of them being thinner and taller than the trees closer to the giraffes. Their shadows can be seen on the ground, offering insight into the lighting of the scene. Overall, it is a serene image of these two giraffes peacefully grazing in their natural habitat."}
{"image_id": 187450, "caption": "The image displays a large train engine with a blue and grey color scheme parked at a train station. The train occupies a significant portion of the frame, stretching from the left to the right side. \n\nIn addition to the train, there are several other elements in the scene. A couple of street lamps can be seen, one near the left edge of the image, and another further to the right. There are five people dispersed throughout the scene, with some standing close to the train and others scattered around the platform. Moreover, there is a suitcase visible near the center-left of the image. The train station also has two benches, one situated at the far left and the other close to the edge of the platform."}
{"image_id": 43266, "caption": "A giraffe and a zebra are seen in a grassy field near some trees. The giraffe and zebra appear to be enjoying each other's company, standing side by side and posing together for the photo. The giraffe, located further to the left, has its head down, while the zebra stands a bit to the right of it, with a similar position.\n\nThe field exhibits various natural elements, such as rocks of different sizes scattered throughout the area. Some are close to the zebra, while others are positioned near the giraffe in the foreground. The overall setting is a scenic, grassy environment where the two animals can coexist peacefully."}
{"image_id": 150080, "caption": "The image displays a delicious pizza placed on a plate, sitting on a dining table. The pizza is topped with shrimp, vegetables, and cheese, making it a delicious and appetizing dish. \n\nThere are a total of 14 shrimp pieces on the pizza, along with multiple pieces of green onion and broccoli as additional toppings. The pizza is served in the main of the picture, taking up most of the view. \n\nThe table appears to be organized for dining, with other items such as a bowl and two forks situated around the pizza. The scene suggests that it could be a restaurant or a cozy dining setup where people gather to enjoy a pizza feast."}
{"image_id": 453757, "caption": "In the image, there is a group of players actively engaged in a soccer game. The soccer ball is flying through the air, with various players in the field trying to reach it. Many soccer players are on the field, some standing, while others are running.\n\nThere is a diverse group of soccer players, including a man dressed in blue who is playing defense, another player dressed in orange standing to the side of the ball, and a group of other players scattered around the field. Some players are closer to the ball, while others are positioned further back in the playing area. The players are competing against each other, with the ball coming close to the ground on the left side of the field with one player seemingly making way towards it."}
{"image_id": 354460, "caption": "The image features a group of three people—two men and a woman—smiling as they cut the ribbon at a ribbon-cutting ceremony. The individuals are in a festive mood, posing for a picture. Among these cutters, there is a woman in a dress and a crown, who plays the role of a beauty queen. The man standing next to her has a tie, likely to represent the event's importance.\n\nIn the background, there is a second person, partially visible in the top corner of the image. This person is possibly the event's organizer or a guest attending the ribbon-cutting ceremony."}
{"image_id": 221681, "caption": "The image showcases a modern bathroom decor with white tiles and blue fixtures. The bathroom has a sink, toilet, and an overall white color scheme. There is also a window in the bathroom, which provides natural light.\n\nVarious objects are placed in the bathroom, including two bottles and multiple towels, with some in the foreground and some in the background. There is also a cup situated on the counter, suggesting that it could be for rinsing out mouthwash or other hygiene products. Additionally, there is a bowl near the sink which might be for holding cleaning supplies or miscellaneous bathroom accessories."}
{"image_id": 349324, "caption": "The image depicts a train carrying a large load of brown freight cars. There are a total of 11 cars on the train, including one brown car. The train is going through the tracks with the freight cars neatly lined up, highlighting their organization and structure. The train occupies the majority of the scene, spanning from the left to almost the right side of the image."}
{"image_id": 225133, "caption": "The image showcases a large wooden tree adorned with numerous colorful Asian-style umbrellas or parasols. The umbrellas of various sizes and patterns are spread all over the tree, making for a visually striking scene. In addition to the umbrellas, a few decorations, such as kites, can be observed hanging from the tree, adding to the beauty and diversity of the display. The overall scene appears to be a delightful and creative outdoor artistic display."}
{"image_id": 452566, "caption": "The scene presents a large stop sign near a mountain range, with a fence covering the side of the winding road. A few trees can be seen surrounding the area, some closer to the fence and others in the more distant background. \n\nThere are three vehicles in the scene: a car positioned at the beginning of the winding road, another car further down the road, and a third car slightly behind the other two. The environment gives a sense of a small, remote location with a vast, rocky landscape in the background."}
{"image_id": 124952, "caption": "The scene features a blue transit bus driving down a street next to a car. The car is positioned in front of the bus, and they are both stopped at a stop sign. There is a total of six traffic lights visible in the image, some of which are quite close to each other. The first two traffic lights are on the right side of the image, with the next two slightly further back, and the last two located on the far left side of the street.\n\nInterestingly, there is a dog walking across the scene, making its way through the street corner."}
{"image_id": 26697, "caption": "The woman is wearing a gray jacket while holding a blue toothbrush. She is facing the window, looking up, and posing for the camera. The scene appears to be taking place indoors, either in her bedroom or another room, with a wooden door nearby.\n\nThere are additional toothbrushes placed at various spots around the room, and a cup is visible on the counter. The room also features a sink, a bowl, and a vase, which adds to the overall atmosphere of the setting."}
{"image_id": 126064, "caption": "The image features a man skillfully riding a surfboard on a wave in the ocean. He is skillfully positioned on the crest of a sizable wave, making it a thrilling moment to witness. The man's body is positioned in an athletic manner as he glides across the surface of the water on his surfboard.\n\nAdditionally, a surfboard can also be spotted in the scene, suggesting this could be a popular spot for surfers, and the man may be preparing to catch the wave that is just breaking in front of him."}
{"image_id": 557190, "caption": "The image features two men wearing business suits, standing outdoors next to a hillside on a sunny day. One of the men has a tie on while they pose together for a picture. They are standing on a green hill by a roadside with several other people in the background. Another man and a boy can also be seen in the scene, possibly enjoying the outdoor atmosphere.\n\nAs the men proudly pose with their friends, it seems like they might be attending an outdoor event or a family gathering in the beautiful, sunny location."}
{"image_id": 137612, "caption": "The image features a residential building with many balconies and an address on the side. It's a four-story building located near a river, and several boats can be seen on the water. The address is 42, as indicated by the number on the side of the building.\n\nThere is a street sign with a \"no car\" sign at the front of the building. Additionally, a red no left turn sign sits near the entrance. Surrounding the building, there are various vehicles, including two cars and a motorcycle parked in front. The vehicles are parked on the left side, while a few more cars can be seen on the right side of the building."}
{"image_id": 408480, "caption": "The image depicts a large red lighthouse standing next to a river in a small city. The lighthouse and another boat are docked at the pier, located near the city center. Nearby, there is a tall crane, suggesting ongoing construction or development activity in the area.\n\nSeveral cars are parked along the river near the lighthouse and the dock. The presence of trees in the background adds an element of nature to the environment."}
{"image_id": 277694, "caption": "The image captures a cow laying on the concrete street, with its head resting on its right front paw. The cow takes up a large portion of the scene, indicating its size.\n\nIn the background, there is a motorcycle parked on one side of the cow, and a scooter or moped on the other side, positioned against a building. The presence of these vehicles suggests that the scene is taking place in a city or urban environment."}
{"image_id": 74166, "caption": "The scene depicts a man skillfully performing a trick on a skateboard on a sidewalk, with another person watching closely. An additional individual is nearby, likely observing the trick as well. There are some people sitting or standing around in the background, although their focus is not on the skateboarder.\n\nThere are a couple of cars parked in the background, one on the left side near the viewer and another slightly to the right. A handbag is located near the middle of the scene, possibly belonging to one of the people in the area."}
{"image_id": 102625, "caption": "The image features a cozy kitchen with wood flooring that leads to a wooden dining room. The kitchen is equipped with a white refrigerator and an oven on the right, as well as a washing machine. The dining table is located near the kitchen and is surrounded by a few chairs. \n\nAdditionally, there are multiple cups, bowls, and bottles scattered across the kitchen and dining table, giving the room a lived-in feel. On the windowsill, there is a potted plant that adds a touch of greenery to the room. A backpack is also placed near the dining area, possibly signifying recent use by someone.\n\nIn the background, a TV can be seen on the left side of the room, indicating that this space is also a relaxation or entertainment area."}
{"image_id": 540694, "caption": "The image depicts an adult giraffe standing next to a few cars on a street. The giraffe, being notably taller than the vehicles, is extending part of its long neck towards the cars. Several cars, consisting of a mix of vehicles, are positioned throughout the scene. Some cars appear closer to the giraffe and others further away, creating a lively urban atmosphere with the majestic, unexpected presence of a giraffe."}
{"image_id": 518586, "caption": "The black and white photograph features a train traveling down the tracks next to a rural village with a train depot close by. A man is walking on the gravel near the tracks, likely paying attention to the train's movements. \n\nThere are three individuals in the image, one standing closer to the train, and the others positioned near the train depot. Additionally, a car is visible in front of the train, indicating the presence of a transportation hub nearby."}
{"image_id": 81303, "caption": "The image features a man skating down a snowy slope next to a snowy hillside. He is expertly maneuvering on a pair of skis, enjoying the thrill of the downhill run. The ski slope also has another skier in the distance, who seems to be making their way through the snow.\n\nThe man in focus appears well-prepared for the activity, wearing an appropriate jacket and goggles to shield himself from the cold and snow. He skillfully uses both poles to maintain balance and control his movement as he glides through the snow."}
{"image_id": 383065, "caption": "The scene is set in a tourist area of a large city with a toilet, specifically a toilette, made of stone-green color. A person is standing next to the toilette, which appears to be in a foreign language or the sign of a city map. \n\nThere is also a dog standing near the toilettes, perhaps accompanying the person or enjoying the presence of the green square stall. The location seems to be a popular spot for visitors, with several people in the image, including the person by the toilette and another person in the background."}
{"image_id": 169602, "caption": "The image depicts a woman in a wetsuit riding a surfboard, skillfully navigating the waves in the ocean. She appears to be enjoying herself and maintains her balance as she surfs towards the shore. The scene is framed by the ocean waves surrounding her on all sides, adding an exhilarating atmosphere to the photograph."}
{"image_id": 19890, "caption": "In the image, two zebras are standing on the sandy ground, positioned near a metal cage or fence. They appear to be grazing and feeding on hay or a food source. The scene suggests they might be in some type of zoo or enclosed habitat. The zebras are next to each other, showcasing their social interaction and bonding. The environment appears to be quite peaceful and suitable for the zebras to feed and live in."}
{"image_id": 236604, "caption": "The image features a spacious living room with a shiny tile floor and well-placed furnishings. There is a sofa and loveseat placed against the wall, as well as a coffee table that adds stability to the space. A few potted plants are scattered around the room, creating a warm and inviting atmosphere. A vase can be seen on the coffee table, adding a touch of elegance to the living room setup.\n\nThe room also features a decorative staircase, providing additional visual interest and space. A dining table is located in the back of the room, further enhancing the openness of the living area. The combination of furniture and decorative items creates a luxurious and comfortable living environment."}
{"image_id": 270753, "caption": "The image features an uncut half of a large deep dish pizza. The pizza has cheese, meat, broccoli, and mushrooms on several layers, showing an enticing combination of flavors for diners. The pizza is placed on a dining table, with one slice ready to be cut. A knife is lying on the table next to the pizza, which is poised to cut into the rest of it. The pizza appears to be a delicious snack or meal, offering a delectable combination of ingredients and textures."}
{"image_id": 457178, "caption": "The image captures a bustling city scene featuring numerous horse drawn carriages and their passengers navigating the area. A woman wearing a red dress stands prominently in the foreground, drawing attention with her bright outfit. \n\nA horse is prominently visible in the middle of the scene, leading a group of many other horses in the background. The image shows a lively mix of people and animals, creating a sense of activity and movement. \n\nA row of old-fashioned houses serves as the backdrop for the busy city setting, and a small statue can be observed among the architectural elements on the street. Despite the busy atmosphere, the overall impression of the city remains calm, providing a picturesque urban scene."}
{"image_id": 577712, "caption": "The image depicts a group of tourists, including a man in a red shirt and a woman in a pink shirt, standing close to a giraffe at its enclosure in a zoo. Other people in the group are looking at the giraffe, observing its unique features. They are all at various positions around the enclosure, with some closer to the front and some farther away.\n\nIn addition to the people, there are some handbags on the ground nearby, suggesting that the visitors have temporarily set their belongings down while they focus on the giraffe. The scene creates a sense of excitement and interaction between the visitors and the large animal. This gathering could also be interpreted as several people looking towards a large building, but the focus of the image is on the giraffe and the tourists."}
{"image_id": 414560, "caption": "The image displays several brown and white cows comfortably lying down on a pile of dry grass. The cows are mixed around each other, creating a sense of peaceful coexistence in the grassy area. Some cows are closer to the top of the pile while others are more towards the bottom, providing a varied landscape of resting cows. In the background, a barn or pen with a metal fence can be seen, enclosing the animals.\n\nIt appears that the location is a rural or pastoral setting, providing a natural environment and a comfortable resting area for the cows."}
{"image_id": 388983, "caption": "The image features a delicious food item with a cooked hot dog covered in ketchup and mustard, resting on a bun. Next to the bun, a pickle slice is placed, adding a complementary flavor to the meal. The hot dog is in the center of the display, drawing attention to the main dish. The bun is positioned towards the bottom of the scene, while the pickle slice is located below the hot dog towards the right."}
{"image_id": 245965, "caption": "The image features an open, blue umbrella anchored in a field with a mix of brown, green, and yellow grasses, providing protection from the elements. The umbrella is placed in a lush vegetation area, which suggests it could be a part of a landscaping solution.\n\nIn the scene, there is a bicycle, positioned in the middle of the grass in the lower-middle portion of the image. This adds an interesting detail to the picturesque setting."}
{"image_id": 147590, "caption": "The image depicts a wooden dining table with a wineglass, placed on one of the corners of the table. The wineglass appears to be filled with an amber-colored liquid. Next to the wineglass, there is a cheese board with various cheeses for guests to enjoy. The table is set with a cup placed towards the left side of the wineglass.\n\nThere is another cup positioned further away, near the top left corner. The table setting also includes two bowls, one on the left side and another closer to the bottom of the table. A spoon is situated in the middle of the table, to the right of the second cup. There is a person partially visible in the upper right corner, possibly sitting at the table or standing nearby. The arrangement suggests a gathering or meal is about to take place."}
{"image_id": 46882, "caption": "In the image, there is a group of people gathered in a park, engaged in a friendly Frisbee competition. The Frisbee is in flight, with a boy leaping high to catch it. Other people are spread around the park, either waiting for their turn or cheering their friends on.\n\nThere are a total of nine people visible in the image, participating in or observing the game. Some are standing in the foreground, while others are in the background of the park or walking around. Additionally, there are three benches positioned within the scene, possibly for spectators or resting players. A backpack is placed near the left side of the image, likely belonging to one of the spectators."}
{"image_id": 518719, "caption": "The image features a large, colorful, vintage bowl placed on a patterned surface, possibly a linen cloth or a couch cushion. The bowl has a mixture of colors, combining tan and dark swirls, which creates an attractive display. The vintage nature of the bowl suggests it could be an antique or collectible item."}
{"image_id": 176312, "caption": "In the image, a woman wearing a black and white dress is standing in front of a podium, looking at a map posted on the wall. She is also looking at her cell phone, which is placed next to her mouth, possibly checking a message or referring to it while navigating the area. \n\nThere are handbags in the vicinity: one in the foreground right next to the woman, and the other one in the vicinity at a certain distance, along with a purse hanging off another person's shoulder. The room seems to be a busy or communal area, with various other people dispersed throughout the scene. The focus of the image, however, remains on the woman looking at her phone and the map."}
{"image_id": 580746, "caption": "The image features a group of sheep grazing peacefully in a grassy pasture on a hillside. The flock consists of nine sheep spread across the field, some nibbling on the grass while others rest. Some of these sheep have been identified as cashmere goats, adding to the scenic rural charm of the scene.\n\nThere is a wall overlooking the pasture, giving the impression of a picturesque landscape. The sheep are grazing calmly and comfortably, while the field is an open area that provides an ideal environment for the animals to roam and graze."}
{"image_id": 541223, "caption": "The image shows a large white airplane parked outside, occupying most of the scene. It appears to be an airplane repair station or work space, possibly for a hanger. The airplane is positioned next to a green awning and above a few bushes, creating a pleasant juxtaposition between nature and technology. \n\nThere are multiple people visible nearby, with one close to the right side of the airplane, and two people positioned to the left. Another person can be seen standing near the top-right corner of the scene. A tie is also noticeable, possibly belonging to one of the people in the area."}
{"image_id": 22589, "caption": "The image features two sheep of varying sizes standing in a lush green field. The smaller sheep appears to be staring at the camera, possibly in front of a large animal cage, as suggested by the context. They are positioned towards the left side of the ground.\n\nAside from the sheep, there are also a few trees in the background on the right side of the scene, providing a natural setting for the animals to graze in."}
{"image_id": 196815, "caption": "The image depicts a group of five young men playing Nintendo Wii, sitting on chairs and standing in a living room. Three chairs are visibly present in the scene, with two located next to each other, while the other one is positioned on the opposite side of the scene.\n\nThere is a TV on the left side of the room, where the men seem to be focused on, enjoying the video game. The young men are likely bonding and participating in a multiplayer video game together."}
